{
    "url": "/personal-finance/never-kill-your-golden-goose/",
    "title": "Never Kill Your Goldent Goose",
    "image": "/img/personal-finance/never-kill-your-golden-goose.jpg",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "p",
            "html": "What does secured capital mean? It means <b>Minimum Risk and Maximum Security</b> to me."
        },
        {
            "tag": "p",
            "html": "These are the most common ways to kill your Golden Goose."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Bad investment thereby losing the capital and potential return.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Secured capital and promised return but you spend your interest earned.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Born poor, lived modestly, spent everything and died poor. (Never tried to make a golden goose)</p></div>"
        },
        {
            "tag": "p",
            "html": "There is another way to kill your golden goose before making one, without even knowing you are killing it “by being trapped in a cycle of creating and destroying your savings”. It renders the process of building your golden goose useless."
        },
        {
            "tag": "h3",
            "html": "Burden of Debt"
        },
        {
            "tag": "p",
            "html": "I have seen a lot of people who are never too serious about their goals in life. If you are not serious about your intentions and what you would like to do with your money, no other being will give a serious thought about it."
        },
        {
            "tag": "p",
            "html": "Everybody dreams of buying a new home but how many ever see it to the completion without ever having to get a bank loan?"
        },
        {
            "tag": "p",
            "html": "Why is housing loan bad anyway? Ask yourself: What is the probability of your not going through a crisis in the period that you are repaying the loan? (10 years, 15 years or 25 years)"
        },
        {
            "tag": "p",
            "html": "For me, the possibility of experiencing a financial crisis in a 25 year period is 100%."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Never pay for your Current Desires with your Future Income”</i>."
        },
        {
            "tag": "p",
            "html": "It is going to be really hard to shake the home loan off once you take it."
        },
        {
            "tag": "p",
            "html": "Everyone is attached to their home. We see it as our home. It’s a pride of possession to be possessive about. But is it really yours when somebody can take it away from you if you do not pay them for a certain amount of time?"
        },
        {
            "tag": "p",
            "html": "I am here promoting that the debt is unnecessary for anybody but what the heck will the economy do without a debt?"
        },
        {
            "tag": "p",
            "html": "The whole system relies on DEBT. If there is no DEBT, there is no money in the system to circulate."
        },
        {
            "tag": "p",
            "html": "Have you watched the video about how the economic money machine works?"
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“You don’t need to be in Debt if the money in debt is not generating more than what you have to pay for it”</i>."
        },
        {
            "tag": "h3",
            "html": "Ball and Chain"
        },
        {
            "tag": "p",
            "html": "Have you ever felt that however hard that you try to save in order to build your golden goose it becomes much more futile?"
        },
        {
            "tag": "p",
            "html": "If you have not, then you are the lucky few whose life is nurtured the right way."
        },
        {
            "tag": "p",
            "html": "Chances are that some circumstances or people in your life are sucking the golden goose dry as soon as you make them. Whom to blame? You are to blame. Yes!"
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“If you are born poor it’s not your mistake; but if you die poor it’s your mistake”</i> - <b>Bill Gates</b>."
        },
        {
            "tag": "p",
            "html": "The choices that we make in our life have a pattern. We all have our preferences in life. The pattern in life can be consciously made or it may be a habit which we obtain from our parents, loved ones or whomever we spent the most time with."
        },
        {
            "tag": "p",
            "html": "Bad habits, i.e. the habits that are detrimental to our financial and personal life seep into our lives if we are not too bothered about whom we spend the most time with."
        },
        {
            "tag": "p",
            "html": "It will be hard to shake off the habit once it becomes a part of your identity. People start expecting it from you and you find some pleasure in doing it."
        },
        {
            "tag": "p",
            "html": "Maybe it’s your loved ones who are draining your Golden goose dry."
        },
        {
            "tag": "p",
            "html": "Analyse who has the power to sap the golden goose dry. Make sure they are synergising with you and that you both are on the same page."
        },
        {
            "tag": "p",
            "html": "It’s of no use if one is trying to build a home while the other person is trying to use the same pool of resource for something else."
        },
        {
            "tag": "h3",
            "html": "Destruction in Disguise"
        },
        {
            "tag": "p",
            "html": "Have you ever meant to help someone in money trouble by lending them some amount of money and ended up losing the relationship and the money?"
        },
        {
            "tag": "p",
            "html": "Even the right intention can be a wrong decision if money is involved."
        },
        {
            "tag": "p",
            "html": "The questions to ask yourself when someone is borrowing money from you are:"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Does he have a current income source from which he could easily repay the amount in the time frame that he has promised to repay?</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Does the person have the intention to repay?</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Where does the money go? Is he borrowing it to consume or produce?</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">4</div><div class=\"copy-container\"><p class=\"description mb-3\">What is the immediate crisis which makes the money necessary?</p></div>"
        },
        {
            "tag": "p",
            "html": "How could you be polite while saying “no” to the lending? Saying “NO” to lending at dire moments in life can be disastrous to the relationship if done at the wrong time and in the wrong situation."
        },
        {
            "tag": "p",
            "html": "Friends and Family are there to help each other in times of hardship and struggle both emotionally and financially if necessary. But lending too much money at the wrong time to the right person for them to consume an unnecessary merchandise which will add no value to the borrower will have repercussions if the borrower does not have the intention/income to repay the borrowed sum of money."
        },
        {
            "tag": "p",
            "html": "Another question to ask is: Which is the source of money?"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Is it from your emergency fund?</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Is it from your golden goose?</p></div>"
        },
        {
            "tag": "p",
            "html": "It is not too much money if the money lent can be generated by you in a few months."
        },
        {
            "tag": "p",
            "html": "If you are lending from your emergency fund, you are essentially losing your security of emergency fund temporarily to support your friend/family in need."
        },
        {
            "tag": "p",
            "html": "Of course, you earn the trust and reliability from your friend/family. But are they the kind of persons who keep up their end of the bargain?"
        },
        {
            "tag": "h3",
            "html": "Misery Loves Company"
        },
        {
            "tag": "p",
            "html": "Have you ever noticed that some people are always in the state of emergency, always facing mishaps in life? They are always a few hundred dollars short every month."
        },
        {
            "tag": "p",
            "html": "I personally know a handful of persons who are always short on money; but why?"
        },
        {
            "tag": "p",
            "html": "They care the least about money. I have asked them why are you least bothered about money? You know what they say?"
        },
        {
            "tag": "p",
            "html": "“Money comes; money parts. But relationships are for fostering and nurturing.”"
        },
        {
            "tag": "p",
            "html": "Well, I say “misery loves company”. These people will stay broke and long to stay broke together."
        },
        {
            "tag": "p",
            "html": "They are getting exactly what they bargained in life. They are trading money for the comfort of staying broke with their friends/relatives."
        },
        {
            "tag": "h3",
            "html": "Can Someone be Comfortably Broke"
        },
        {
            "tag": "p",
            "html": "One feels at home when people who have the same mindset get together. You never want to leave them ever. They become your best friends and next of kin."
        },
        {
            "tag": "p",
            "html": "That’s a comfort circle someone is building for themselves. Inside that zone, everyone stays the same and on par. If someone steps up, he is either pulled down or has the necessity to pull the circle to the new level which he has reached or leave the comfort zone which he was a part of and start a new life."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“The fear of losing loved ones in the future is much painful than losing money today.”</i>"
        },
        {
            "tag": "h3",
            "html": "Paying for your Comfort Zone"
        },
        {
            "tag": "p",
            "html": "It requires a good amount of vision and perseverance to achieve something in life. Life is going to be hard. You are going to lose the things you thought will be there with you for a lifetime."
        },
        {
            "tag": "p",
            "html": "Life is unpredictable. You can control it in two ways:"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">By letting fear control you and paying a premium fee to stay in your comfort zone and keeping others close together without letting them fly away.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Exploring the life in ways you would like to, by having a clear vision of where you are going and where you would like to.</p></div>"
        },
        {
            "tag": "p",
            "html": "You will be living a terribly unhappy life if you do not shape the life as you want it to be and by letting fear control you because “Change is the only constant in life”"
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Fear shouldn't paralyse us but has to motivate us”</i> - <b>Salvation, TV Series</b>"
        }
    ]
}