{
    "url": "/psychology/one-piece/straw-hat-luffy/",
    "title": "Straw Hat Luffy",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Psychology",
            "crumbUrl": "/psychology/"
        },
        {
            "crumbTitle": "One Piece",
            "crumbUrl": "/one-piece/"
        }
    ],
    "content": [
        {
            "tag": "img",
            "classInfo": "article-header-image",
            "srcUrl": "/img/psychology/bg-op-1.jpg"
        },
        {
            "tag": "p",
            "html": "A 17-year-old boy from a small town in East Blue sets off on a journey to become a pirate. In this hypothetical world like the real one, all the pirates are considered bad."
        },
        {
            "tag": "p",
            "html": "However, Luffy’s intention is not to spread suffering but to attain a treasure that Gold D. Roger had left for everyone to pursue ( Which is the only way to become King of all pirates). It has been his childhood dream that Garp (his grandfather) disapproves of."
        },
        {
            "tag": "p",
            "html": "Luffy is not greedy about the treasure there is no indication that one piece is in fact money. It could be something different entirely. He seems to be a happy character who is always laughing and enjoys small victories. We can see in his eyes that he is light-hearted during a friendly conversation."
        },
        {
            "tag": "p",
            "html": "Always assumes that everyone is friendly, believes every word that everybody says. We can see this early on as he believes every lie Usopp says which is a white lie."
        },
        {
            "tag": "p",
            "html": "Luffy as a character seems to be extremely susceptible to manipulation and often gets into too much trouble as he is the captain. It is a direct result of his straightforward character."
        },
        {
            "tag": "p",
            "html": "He says what he means and never lies. If he says something he would either accomplish the task or die trying. Also, he seems to be incapable of not involving himself in fixing a problem for someone he considers a friend."
        },
        {
            "tag": "p",
            "html": "His strong suit seems to be his happy face, his native approach, and his vision of the world. Which is often seen by others as a person incapable of harm. And these new friends are always surprised when they see his will and dedication of Luffy when he fights for something."
        },
        {
            "tag": "p",
            "html": "It is often that Luffy fights for someone else. As in, his fight is not a direct result of his selfish desire to attain something but is often to help a friend who is bogged down by their past or a stranger who is suffering."
        },
        {
            "tag": "p",
            "html": "As a result, he can only be seen as a revolutionary like his father Dragon. He almost dies almost always now and then. When he does die most often it is their friends and their crew who takes care of him and helps him recover. They don’t think twice before risking their lives but on the contrary, they fight to risk their lives for Luffy."
        },
        {
            "tag": "p",
            "html": "Even though, it seems too less. It seems like he deserves more. And every time he recruits someone, he asks them, and only if they want to be a part of the crew he recruits them. He often waits for a response and keeps his words even though he risks his life and the life of his crewmates like in Alabasta while waiting for a reply from Viví (Miss Wednesday). And she said No."
        },
        {
            "tag": "p",
            "html": "More often than necessary he is always confronted with an enemy that is much stronger than him. He never imagined if he would win the fight or not. He often goes to a fight without knowing the full extent of his enemy's strength. And as a result, he often encounters situations in which he is beaten to a pulp and is almost always destined to die. Then it is a friend or a stranger or a crew who saves him."
        },
        {
            "tag": "p",
            "html": "He is emotionally driven and with the right sense of instinct to guide him. So his sense of justice is often the reason to pick a fight with an enemy. Everything else does not matter. He always gets back up when he is seemingly destroyed. That shows his will to endure powered by a strong sense of justice."
        },
        {
            "tag": "p",
            "html": "That brings him to Enies lobby to take his crewmate, Nico Robin, back. At all costs, even though Nico Robin says she wants to die and does not want to do anything do with the Straw Hat pirates. He refuses to take No for an answer. It is as if he sees through the lie that Robin says. No, he is not that smart but he chooses to trust his crewmates with his life even though he doesn’t know anything about her."
        },
        {
            "tag": "p",
            "html": "It makes sense as Nico Robin saved Luffy’s life twice in Alabasta. The crew doesn’t know anything about Nico Robin and the world government seems to paint Nico Robin as a character who manipulates, and as someone immoral who is ready to deceive their crew. Even as someone capable of deceiving, Luffy’s undeniable trust in his crew has the potential to change the evilest of characters into the best as it is the most powerful personality one can have."
        },
        {
            "tag": "p",
            "html": "Luffy, however, does not trust everyone equally and is instinctively capable of selecting the right crewmates who are inclined to become loyal crew, friends, and family."
        },
        {
            "tag": "p",
            "html": "The enemies of Luffy are often immoral characters who are willing to do anything to attain what they want. The villain is often the character who is unjust and spreads suffering to other people for the selfish benefit of one’s gain. A person who fights such a character is supposed to be the anti-villain or the hero who saves everyone."
        },
        {
            "tag": "p",
            "html": "The hero is also the person who is strong and saves someone else from a villain and prevents unnecessary suffering. This character seems to be ingrained in Luffy."
        },
        {
            "tag": "p",
            "html": "During the fight against the World Government when everyone warns him not to go to Impel down to save his brother Portez D Ace. All the has to say is “If I do not go I will regret it”. He goes anyway with the help of Hancock. Hancock however is madly in love with Luffy of his apparent lack of ability to fall in love with her and his ability to help Hancock sisters from exposing their past even when they were trying to kill Luffy."
        },
        {
            "tag": "p",
            "html": "He is fiercely loyal. It can be seen when Ace his brother is killed in front of him by Admiral Sakazuki. He cries so much and so loud that the trauma of his brother dying renders him unconscious. And as soon as he wakes up his first reaction is denial. Denial that his brother has died and this refusal make him partly destroy the forest of Amazon Lily. He had to recollect that he still had his 7 crewmates to count on which helped him come back to his normal senses."
        },
        {
            "tag": "p",
            "html": "All of these portray Luffy as a personality who trusts his crew with his life, loves food, and is a person who barges in and fights for someone once he is convinced that he is doing the right thing. In a lot of sense, the whole crew completes and complements Luffy. They make him complete."
        }
    ]
}