{
    "url": "/psychology/what-is-your-religion/",
    "title": "What is your Religion?",
    "image": "/img/psychology/what-is-your-religion.jpg",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Psychology",
            "crumbUrl": "/psychology/"
        }
    ],
    "content": [
        {
            "tag": "p",
            "html": "The need for religion and god is intrinsic in most people. Once the god is destroyed then we are in chaos."
        },
        {
            "tag": "p",
            "html": "After killing the highest god (self-transformation to become the highest good) then the lower gods like Politics, nationalists, fascists, communists, and other ideological beliefs take over our minds and are converted into belief."
        },
        {
            "tag": "p",
            "html": "There is a need for meaning in life that has to be found. Most people also identify them as a new age ideology which could be a belief system of the ideologies."
        },
        {
            "tag": "p",
            "html": "If you have too many choices in life then it becomes chaos itself but if you have too less then it becomes suffocating, which is why people make choices that restrict them in a meaningful way."
        },
        {
            "tag": "p",
            "html": "If you do not live by a rule then everything can descend into chaos."
        },
        {
            "tag": "p",
            "html": "It is our choice to start fighting with ideologies and then choose the best one that incorporates the best of all the ideologies and create a new god which unites everyone under that one umbrella. We know now that That god has not been assembled yet."
        },
        {
            "tag": "p",
            "html": "Religion is not just dogma and constraining. It served as a community, it was soul fulfilling in some manner. We feel more meaningful if we are a part of something bigger than ourselves."
        },
        {
            "tag": "p",
            "html": "Religion provides a moral code by which to conduct people's lives. We see that morality is thrown out of the window by certain sects of the population and the only thing that holds them from doing something bad is the Law."
        },
        {
            "tag": "p",
            "html": "If you say that I do not belong to any ideology. Then life becomes meaningless. And then a sect forms around that which is a group of people living meaningless lives."
        },
        {
            "tag": "p",
            "html": "I do not suggest that is all people are once they adopt an ideology but once you convince yourself that you are a communist or a capitalist then the choices that you make in life will be influenced by those ideologies."
        },
        {
            "tag": "p",
            "html": "Then we can see it play through people's lives and derive an explanation as to which it was meaningful to suffer because they chose that ideology."
        },
        {
            "tag": "p",
            "html": "Pick your poison man! We all will suffer! We just get to choose what it is that we are suffering from!"
        },
        {
            "tag": "p",
            "html": "I still do not think going back to religion and dogma and drinking cow urine (yea! I was freaking shocked as well, people do sell this shit and India) is the right way to go about in life."
        },
        {
            "tag": "p",
            "html": "I think religion died for good, it had to! Our ancestors killed god and now we are killing religion, I still think it is the right way to go about it."
        },
        {
            "tag": "p",
            "html": "We just have to be a bit more careful as to what to choose instead of choosing religion or god! You are choosing something."
        },
        {
            "tag": "p",
            "html": "I loved things, that then evolved into materialistic ideology then it was easy to become a capitalist which automatically made me an anti-communist. Then I married a communist! Life! I know!"
        },
        {
            "tag": "p",
            "html": "Now I see the advantage of a communist government in a democracy with a capitalistic economy."
        },
        {
            "tag": "p",
            "html": "Well, see what is happening in the US and India. What is missing is communism. The environmentalists are probably becoming apocalyptic and think humans should not inhibit the plant at all! That just makes everything that we have ever accomplished a grand mistake."
        },
        {
            "tag": "p",
            "html": "Life is more meaningful when we are intermingled."
        },
        {
            "tag": "p",
            "html": "The ethical principles and morality are thrown out of the window when we choose capitalism as such selling something bad to someone are bad but if you throw away the morality then you can sell anyone anything and feel good thinking that you are doing what you do because you do not earn enough. When you have more money you will stop doing it."
        },
        {
            "tag": "p",
            "html": "Well, cheating was a bad thing until we killed god and destroyed religion. Now it is a commonality among poor people to have been married or been with multiple partners with kids from multiple partners. That’s a receipt for disaster!"
        },
        {
            "tag": "p",
            "html": "And you ask the parents what do they want for their kids, they would say marry a rich man! Ha! But that’s not what you did!"
        },
        {
            "tag": "p",
            "html": "Take alcoholism for example, according to Jordan Peterson, connecting people back to religion is a definitive way of making the alcoholic stop drinking alcohol and never touch it again ever!"
        },
        {
            "tag": "p",
            "html": "People are spiritual but that does not mean that we need to be religious connecting morality to religion and throwing morality out is throwing the baby with the bathwater."
        },
        {
            "tag": "p",
            "html": "Take the good, and ignore the bad, repeat, until you die!"
        }
    ]
}