{
    "url": "/psychology/search-for-the-good/self-preservation/",
    "title": "Self Preservation",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Psychology",
            "crumbUrl": "/psychology/"
        },
        {
            "crumbTitle": "Search for the Good",
            "crumbUrl": "/search-for-the-good/"
        }
    ],
    "content": [
        {
            "tag": "img",
            "classInfo": "article-header-image",
            "srcUrl": "/img/psychology/search-for-the-good/self-preservation.jpg"
        },
        {
            "tag": "p",
            "html": "What is good? That is a hard thing to crack, right? That’s the most abstract word anyone has ever found. It has multiple meanings if we try to crack it from the top-down and people can get lost in the search for good."
        },
        {
            "tag": "p",
            "html": "Anyone can then convince you like the Nazis that what is ultimately good is what is good for the nation and the individual is bound to do great things but to do them one has to be willing to do bad things for the good of the nation. That’s not a bad narrative, right? If you convince yourself with the notion of “kill or be killed”. But what they forgot was they were the ones who started the war in the first place. There were atrocities on both sides during world war 2. What fascinated me was post-traumatic stress disorder."
        },
        {
            "tag": "p",
            "html": "Let us say a soldier was convinced with the above narrative and started killing and raping women, then when he comes back and lives a normal life with his family, guess what? A certain portion of them develops post-traumatic stress disorders. I don’t know anyone or any true story about this scenario but we all understand this scenario. What didn’t make sense as it was the same person then and it is the same person now."
        },
        {
            "tag": "p",
            "html": "According to Jordan Peterson, what changes in the narrative?"
        },
        {
            "tag": "p",
            "html": "So what changes are the narrative and the ideology? But you know what traumatized them even further. They realized that they loved doing all of those things to other people and some how they were surprised that they loved doing harmful things to other people. They rejoiced in it. That what’s haunts most of them. A narrative within them is destroyed. That a monster is always someone else something that is not you but once you found out that they did all those things and makes them the monsters."
        },
        {
            "tag": "p",
            "html": "God only knows how someone could get out of that mess. Maybe we have to integrate that monster into ourselves. Know exactly under what circumstances a human being or any human being can commit unspeakable crimes against humanity and while doing it rejoice over it and get away with it because he was doing it in the name of a country and that country won the war."
        },
        {
            "tag": "p",
            "html": "Usually, when the country wins the war and maintains the victory for a long period of them that means they are the good ones and what they fought was bad and that war was necessary to eradicate the evil. So under most circumstances, these people have done terrible things and they do not pay the price for it. That’s also what is haunting them, I suppose? They did something bad in the name of a country and got away with it."
        },
        {
            "tag": "p",
            "html": "That person while doing it might have thought that what he was doing was necessary for the greater good. Something more than him. Therefore he is eligible to do horrible things now."
        },
        {
            "tag": "p",
            "html": "Now all the war movies make sense, before a war, there is usually a speech by the leader trying to motivate them and bring them together to forget themselves and serve the nation and emerge victoriously and that victory was the only way forward. That destroys the last bit of morality back into the deepest corner of anyone who has any left."
        },
        {
            "tag": "p",
            "html": "I always thought that speech made me energized, motivated, and focused. All those were true but among all those, they also serve as a cure for someone who is not willing to kill in the name of morality. That killing is what is expected in the name of God, country, and for the good of all the people within that umbrella."
        },
        {
            "tag": "p",
            "html": "There is truth within it, right? After all, who wants to be dead, raped, and looted but to prevent that and the only way to prevent that is by you doing all of those things to the opposition could haunt some soldiers for the rest of their lives."
        },
        {
            "tag": "p",
            "html": "Now that we have a convincing argument that good is more complicated that there is more to it. Let us continue."
        },
        {
            "tag": "p",
            "html": "I do not criticize all the soldiers, on the contrary. What surprises me is the lack of sufficient psychological training that is given to them before going to war that some of them are diagnosed with PTSD. Being a soldier is in part an ability to inflict harm and kill a human being without a shred of a doubt or a second thought. You want them to keep doing it in the future and that warrants psychological retraining."
        },
        {
            "tag": "p",
            "html": "Self-preservation as a form of defense and inflicting minimum necessary harm to the attacker to disable him from inflicting any harm to you is an Integral part of BEING GOOD."
        }
    ]
}