{
    "url": "/personal-finance/i-cannot-save-a-penny-more/",
    "title": "I cannot save a Penny More",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "img",
            "classInfo": "article-header-image",
            "srcUrl": "/img/personal-finance/i-cannot-save-a-penny-more.jpg"
        },
        {
            "tag": "p",
            "html": "Why aren’t people saving?"
        },
        {
            "tag": "p",
            "html": "You’ll start saving money when your future needs become more important than your current desires."
        },
        {
            "tag": "p",
            "html": "People spend on things which they do not need. One could easily avoid regular restaurant expenses by cooking from home. That’s the reason why people are not saving. Your current wants outweigh the necessity to save more for tomorrow."
        },
        {
            "tag": "p",
            "html": "If you tend to be one of them, it’s time to change the perspective. Else your primitive brain will induce pain whenever you try to save more money. Why? Because you are putting off something. The pain should be replaced with pleasure. That’s the only way you will start saving more money."
        },
        {
            "tag": "p",
            "html": "What are the ways to save more money if I cannot find a penny more to save?"
        },
        {
            "tag": "h3",
            "html": "Create a Budget"
        },
        {
            "tag": "p",
            "html": "Create a budget, plan your budget and stick to it. Allocate money to your expenses like food, electricity & gas bill, home rent/mortgage, travel and miscellaneous expenses. Have a budget and allocate a percentage of your income towards all the categories and stick to the plan until the end of the month."
        },
        {
            "tag": "p",
            "html": "I am pretty sure the first time you try to create a budget some of the sectors will run out of money. Don’t worry you will get better the next month"
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“The trick to mastery is repetition.”</i>"
        },
        {
            "tag": "p",
            "html": "The key to creating a new budget is to just start saving a $100 the first month or any amount you can afford for that matter and create a budget with the remaining amount. Stick to it until the end."
        },
        {
            "tag": "p",
            "html": "Still, can’t find enough money to save? Can’t find that extra $100?"
        },
        {
            "tag": "h3",
            "html": "Latte Factor"
        },
        {
            "tag": "p",
            "html": "Latte factor is the answer to your questions. Latte factor was first introduced by David Bach in his book “The Automatic Millionaire”. We can all find our Latte factors in life."
        },
        {
            "tag": "p",
            "html": "All we have to do is write down all the expenses that you had for that day after reaching home. You will find that you grabbed a cup of coffee from Starbucks for $4 or that you have muffins for $4.75 every day for your breakfast. Well, that is $80 for one month if you can choose an alternative plan to fetch that cup of coffee. Everybody has one. There is not a single soul who cannot find the one thing he is spending the extra money on."
        },
        {
            "tag": "p",
            "html": "Eating outside, drinking outside, the extra expense which we seduce ourselves with are all the excuses we make to spend the money today instead of saving them for our future."
        },
        {
            "tag": "h3",
            "html": "Bring in More Money"
        },
        {
            "tag": "p",
            "html": "Are you the extraordinary person who does not have any Latte factor in your life? Or not willing to cut back your spending but choose to find an alternative approach to saving? Find new ways of bringing in more money to your family. It may be an extra part-time job every weekend that you have to do or a passive stream of income. Every penny you add extra will go towards the saving."
        },
        {
            "tag": "p",
            "html": "Find your savings. Plan for the future. Have a purpose to drive your income higher. Save more when you earn more."
        },
        {
            "tag": "h3",
            "html": "Clear Cut Strategy"
        },
        {
            "tag": "p",
            "html": "In the next chapter, we will be allocating a budget for you. This strategy is designed to pay yourself first.  All the strategy mentioned in Chapter 13: Income Allocation is currently being practiced by myself"
        },
        {
            "tag": "p",
            "html": "I can personally assure you that this budgeting strategy is extremely efficient in paying yourself first. I recommend to have a separate account for your savings and have a separate account for your spending."
        },
        {
            "tag": "p",
            "html": "Transfer all the “Pay Yourself First” money automatically on the 1st of every month. Never fail to stop doing that as the day you stop paying yourself first will be the day you have failed to live up to your dream."
        },
        {
            "tag": "p",
            "html": "Always! Have a “lavish spending” account which is used to fulfill your desires. This never fails to motivate you always to anticipate the next month."
        },
        {
            "tag": "p",
            "html": "Income allocation is by far the first strategy every individual has to implement in their lives. If you do not measure what comes in and decide what goes out and how you will end up spending everything you earn."
        },
        {
            "tag": "p",
            "html": "Out of your savings account goes your debt repayments except for your mortgage. It is designed this way for a reason which we shall discuss in Part Four: Debt Management Strategy."
        },
        {
            "tag": "p",
            "html": "Your Emergency Fund and Your Savings account are one and the same. The Emergency Fund is deposited as Fixed Deposit in the Savings Account which you have allocated for “Pay Yourself First”."
        },
        {
            "tag": "p",
            "html": "Your expenditure account will pay your rent/mortgage, insurance, self education expenses & charity expenses."
        },
        {
            "tag": "p",
            "html": "You will spend the food/travel expenses in cash. It will ensure that you always have money in your wallet and that will be a constant reminder of your habit of budgeting."
        },
        {
            "tag": "p",
            "html": "We will use the savings account later to invest periodically if necessary to attain your mid-term and long-term goals. So it is mandatory to have a savings account in order to begin implementing personal financial success habits."
        },
        {
            "tag": "p",
            "html": "Have you allocated a savings account? Alright! Let's move on!"
        }
    ]
}