{
    "url": "/personal-finance/financial-goals-to-achieve-before-you-turn-thirty-five/",
    "title": "Never Kill Your Goldent Goose",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "img",
            "classInfo": "article-header-image",
            "srcUrl": "/img/personal-finance/financial-goals-to-achieve-before-you-turn-thirty-five.jpg"
        },
        {
            "tag": "p",
            "html": "You must have come across a recent study which suggests that you must have saved twice your annual salary before you reach the age of 35 in order to ensure that you retire by 67 having to live a similar lifestyle afterward. As many agree and as many disagree, The fact still remains the same."
        },
        {
            "tag": "p",
            "html": "We start earning when we are about 25 and by the time we have reached 10 years of our working life, it is only reasonable to expect that one has saved about 2 years of one’s annual salary."
        },
        {
            "tag": "p",
            "html": "A minimum of one in three persons could expect to live till their 80’s which requires a minimum of 13 years after his retirement to be sponsored by the 30 + years of his working life."
        },
        {
            "tag": "p",
            "html": "Having said that, it is only fair to expect that you have at least 2 years of your annual income as savings/investment by the time you reach 35 (assuming you have a private pension)."
        },
        {
            "tag": "p",
            "html": "How do we achieve that figure?"
        },
        {
            "tag": "p",
            "html": "Let’s take for example: That you take 10% of your income and invest in Apple Stocks from the start of 2008 till now (2018)."
        },
        {
            "tag": "img",
            "classInfo": "article-image",
            "srcUrl": "/img/personal-finance/apple-stocks-graph.jpg"
        },
        {
            "tag": "p",
            "html": "The table below explains how you could have saved up to 3.6 times your annual income assuming that your salary is $35,000 and that you save $300 every month."
        },
        {
            "tag": "table",
            "html": "<tbody><tr><td>Stock</td> <td>AAPL</td></tr> <tr><td>Type of Investment</td> <td>Dollar Cost Averaging</td></tr> <tr><td>Start Date</td> <td>07/11/2008</td></tr> <tr><td>End Date</td> <td>03/27/2018</td></tr> <tr><td>Dollar Cost Averaging Interval</td> <td>1 month</td></tr> <tr><td>Amount to Invest Every Month</td> <td>$300</td></tr> <tr><td>Initial Investment</td> <td>$300</td></tr> <tr><td>Total Invested Capital</td> <td>$35,100.00</td></tr> <tr><td>Annual Return (%)</td> <td>25.29%</td></tr> <tr><td>Final Net Worth</td> <td>$128,032.03</td></tr></tbody>"
        },
        {
            "tag": "p",
            "html": "Although the above mentioned table is a hypothetical example, it provides a reasonable estimate of the power of savings and Investments and Dollar Cost Averaging."
        },
        {
            "tag": "h3",
            "html": "Being Paid for your Value"
        },
        {
            "tag": "p",
            "html": "Negotiating your salary is a conversational skill which can be improved."
        },
        {
            "tag": "p",
            "html": "The sooner you get paid more the better it is."
        },
        {
            "tag": "p",
            "html": "Earning more soon will directly impact your possibility of a happy retirement. The initial 10 years of your growth and savings contribute up to 4 -12 years of your retirement if invested on a proper vessel."
        },
        {
            "tag": "p",
            "html": "However, the later investments have the potential to compensate 2-6 years of your retirement assuming all the savings are 10% and are invested in a growing stock/index fund."
        },
        {
            "tag": "p",
            "html": "Not having your salary rise now could cost you up to 4 – 12 years of your retirement savings, That’s an unbelievably high amount for a small 5 – 10% rise. All thanks to the power of compounding."
        },
        {
            "tag": "p",
            "html": "No one is born with an inbuilt talent to negotiate. It is a skill which is developed as you keep practicing."
        },
        {
            "tag": "p",
            "html": "The more you practice your skills on negotiation, the better the chances you have at not chasing your payment on bills down the line."
        },
        {
            "tag": "p",
            "html": "Inform your intention of getting a raise to your boss. Chances are that he has to discuss them with other colleagues in your company. Inform your boss well in advance, tell them how you have brought value to the company while being a team player and how excited are you about the work you do in the same organization."
        },
        {
            "tag": "p",
            "html": "While getting a raise do not just think about raising your base salary, think about the possibility of including stock compensation, vacation days, insurance, tax-free benefits and other possibilities while negotiating."
        },
        {
            "tag": "h3",
            "html": "Have a Full Fledged, Practising Personal"
        },
    ]
}