{
    "url": "/personal-finance/financial-goals-to-achieve-before-you-turn-thirty-five/",
    "title": "Never Kill Your Goldent Goose",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "img",
            "classInfo": "article-header-image",
            "srcUrl": "/img/personal-finance/financial-goals-to-achieve-before-you-turn-thirty-five.jpg"
        },
        {
            "tag": "p",
            "html": "You must have come across a recent study which suggests that you must have saved twice your annual salary before you reach the age of 35 in order to ensure that you retire by 67 having to live a similar lifestyle afterward. As many agree and as many disagree, The fact still remains the same."
        },
        {
            "tag": "p",
            "html": "We start earning when we are about 25 and by the time we have reached 10 years of our working life, it is only reasonable to expect that one has saved about 2 years of one’s annual salary."
        },
        {
            "tag": "p",
            "html": "A minimum of one in three persons could expect to live till their 80’s which requires a minimum of 13 years after his retirement to be sponsored by the 30 + years of his working life."
        },
        {
            "tag": "p",
            "html": "Having said that, it is only fair to expect that you have at least 2 years of your annual income as savings/investment by the time you reach 35 (assuming you have a private pension)."
        },
        {
            "tag": "p",
            "html": "How do we achieve that figure?"
        },
        {
            "tag": "p",
            "html": "Let’s take for example: That you take 10% of your income and invest in Apple Stocks from the start of 2008 till now (2018)."
        },
        {
            "tag": "img",
            "classInfo": "article-image",
            "srcUrl": "/img/personal-finance/apple-stocks-graph.jpg"
        },
        {
            "tag": "p",
            "html": "The table below explains how you could have saved up to 3.6 times your annual income assuming that your salary is $35,000 and that you save $300 every month."
        },
        {
            "tag": "table",
            "html": "<tbody><tr><td>Stock</td> <td>AAPL</td></tr> <tr><td>Type of Investment</td> <td>Dollar Cost Averaging</td></tr> <tr><td>Start Date</td> <td>07/11/2008</td></tr> <tr><td>End Date</td> <td>03/27/2018</td></tr> <tr><td>Dollar Cost Averaging Interval</td> <td>1 month</td></tr> <tr><td>Amount to Invest Every Month</td> <td>$300</td></tr> <tr><td>Initial Investment</td> <td>$300</td></tr> <tr><td>Total Invested Capital</td> <td>$35,100.00</td></tr> <tr><td>Annual Return (%)</td> <td>25.29%</td></tr> <tr><td>Final Net Worth</td> <td>$128,032.03</td></tr></tbody>"
        },
        {
            "tag": "p",
            "html": "Although the above mentioned table is a hypothetical example, it provides a reasonable estimate of the power of savings and Investments and Dollar Cost Averaging."
        },
        {
            "tag": "h3",
            "html": "Being Paid for your Value"
        },
        {
            "tag": "p",
            "html": "Negotiating your salary is a conversational skill which can be improved."
        },
        {
            "tag": "p",
            "html": "The sooner you get paid more the better it is."
        },
        {
            "tag": "p",
            "html": "Earning more soon will directly impact your possibility of a happy retirement. The initial 10 years of your growth and savings contribute up to 4 -12 years of your retirement if invested on a proper vessel."
        },
        {
            "tag": "p",
            "html": "However, the later investments have the potential to compensate 2-6 years of your retirement assuming all the savings are 10% and are invested in a growing stock/index fund."
        },
        {
            "tag": "p",
            "html": "Not having your salary rise now could cost you up to 4 – 12 years of your retirement savings, That’s an unbelievably high amount for a small 5 – 10% rise. All thanks to the power of compounding."
        },
        {
            "tag": "p",
            "html": "No one is born with an inbuilt talent to negotiate. It is a skill which is developed as you keep practicing."
        },
        {
            "tag": "p",
            "html": "The more you practice your skills on negotiation, the better the chances you have at not chasing your payment on bills down the line."
        },
        {
            "tag": "p",
            "html": "Inform your intention of getting a raise to your boss. Chances are that he has to discuss them with other colleagues in your company. Inform your boss well in advance, tell them how you have brought value to the company while being a team player and how excited are you about the work you do in the same organization."
        },
        {
            "tag": "p",
            "html": "While getting a raise do not just think about raising your base salary, think about the possibility of including stock compensation, vacation days, insurance, tax-free benefits and other possibilities while negotiating."
        },
        {
            "tag": "h3",
            "html": "Have a Full Fledged, Practising Personal"
        },
        {
            "tag": "p",
            "html": "It is mandatory to have a full roadmap of your personal financial life before you turn 35."
        },
        {
            "tag": "p",
            "html": "The financial plan would include your short-term goals, mid-term goals and long-term goals. It serves as a way of measuring your goals vis a vis  where you are right now."
        },
        {
            "tag": "p",
            "html": "Without a proper measuring tool (your Personal Financial Roadmap), you will be lost."
        },
        {
            "tag": "p",
            "html": "Do you know anybody who was lost in a forest? Ask them what happened. It is most likely that it was next to impossible to get out of it without having a proper plan which includes measuring something (Sun/Stars)."
        },
        {
            "tag": "p",
            "html": "They generally walk in circles only to find out that they have walked back to where they have started."
        },
        {
            "tag": "p",
            "html": "This exact scenario is true in personal financial life as well. If you do not have a proper roadmap and vision, you would end up walking in circles."
        },
        {
            "tag": "h3",
            "html": "Having saved 6 - 12 months Worth of income as Emergency Fund"
        },
        {
            "tag": "p",
            "html": "We are sure that you would have ended up in a financially daunting situation in 10 + years of your work life like a shortage of money, your getting fired or staying jobless for a month or two."
        },
        {
            "tag": "p",
            "html": "It is only rational to believe that you should be saving a minimum of 6 months of your monthly salary as an emergency fund."
        },
        {
            "tag": "p",
            "html": "If not, it is guaranteed that you would end up struggling a lot when things go south."
        },
        {
            "tag": "p",
            "html": "Emergency fund acts as a security between you and any financial situation. This is reflected in how you see life itself and can directly impact how you work."
        },
        {
            "tag": "h3",
            "html": "Dedicating a Portion of your Income towards your Retirement"
        },
        {
            "tag": "p",
            "html": "By 35, you should have already started saving a portion of your salary consistently towards your retirement."
        },
        {
            "tag": "p",
            "html": "Your initial investment between 25 years of age and 35 years of age will go a long way in determining how soon you will be able to retire."
        },
        {
            "tag": "p",
            "html": "Below is an example of how the age plays a role in how soon you retire if you save $3,600 every year with an initial deposit of $3600 initially."
        },
        {
            "tag": "table",
            "html": "<thead><tr><th>Year</th><th>Year Interest</th><th>Total Deposits</th><th>Balance</th></tr></thead> <tbody><tr><td>1</td><td>$434.17</td><td>$7,100.00</td><td>$434.17</td><td>$7,534.17</td></tr> <tr><td>5</td><td>$1,888.44</td><td>$21,500.00</td><td>$5,666.84</td><td>$27,166.84</td></tr> <tr><td>10</td><td>$4,464.32</td><td>$39,500.00</td><td>$22,441.20</td><td>$61,941.20</td></tr> <tr><td>15</td><td>$8,249.13</td><td>$57,500.00</td><td>$55,536.13</td><td>$113,036.13</td></tr> <tr><td>20</td><td>$13,810.25</td><td>$75,500.00</td><td>$112,611.36</td><td>$188,111.36</td></tr> <tr><td>25</td><td>$21,981.38</td><td>$93,500.00</td><td>$204,921.49</td><td>$298,421.49</td></tr> <tr><td>30</td><td>$33,987.43</td><td>$111,500.00</td><td>$349,003.27</td><td>$460,503.27</td></tr> <tr><td>35</td><td>$51,628.27</td><td>$129,500.00</td><td>$569,154.58</td><td>$698,654.58</td></tr> <tr><td>40</td><td>$77,548.45</td><td>$147,500.00</td><td>$901,076.99</td><td>$1,048,576.99</td></tr></tbody>"
        },
        {
            "tag": "p",
            "html": "From the above mentioned table, we can find out that the money has more than doubled in the successive 10 years (30 – 40 years) from $460,503.27 to $1,048,576.99."
        },
        {
            "tag": "p",
            "html": "So, this could be the key to maintaining your current lifestyle throughout your retired life in lieu of living the last few years penniless."
        },
        {
            "tag": "p",
            "html": "The ideal age to start saving for your retirement is 25, although you ought to keep in mind that it is never too late."
        },
        {
            "tag": "h3",
            "html": "Having Multiple Sources of Secure Income"
        },
        {
            "tag": "p",
            "html": "Finally, having multiple sources of income is a sure shot way to make your life stress free and secure."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Have a passive stream of income. <i>(check out Pat Flynn’s website for more information about building a passive online business)</i></p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Build a nest egg which generates money for you.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Rent out your second home.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">4</div><div class=\"copy-container\"><p class=\"description mb-3\">Invest in Index Funds.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">5</div><div class=\"copy-container\"><p class=\"description mb-3\">Develop new skills.</p></div>"
        },
        {
            "tag": "p",
            "html": "All these are some of the ways to generate multiple streams of income. Sure, they come with their own risks. Tell me what doesn’t?"
        }
    ]
}