{
    "url": "/personal-finance/how-to-save-your-way-to-achieve-your-dream/",
    "title": "How to Save Your Way to Achieve your Dream",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "img",
            "classInfo": "article-header-image",
            "srcUrl": "/img/personal-finance/how-to-save-your-way-to-achieve-your-dream.jpg"
        },
        {
            "tag": "p",
            "html": "There is one thing that we know with certainty, i.e. in today’s economic situation a single steady income stream is not enough to sustain a family."
        },
        {
            "tag": "p",
            "html": "Feudalism supported loyalty; The Lord provided land and safety in exchange for service and loyalty. Communism supported equality; Every person is equal economically and hence ensure everyone is suffering in equal misery or enjoys equal benefits. Capitalism supports competition; You have to be better than the other person while doing the same job in order to excel."
        },
        {
            "tag": "p",
            "html": "Competition is the only known self-motivator that has been adopted worldwide today. While competition is important so is collaboration among the members of your organization who are working towards the same goal (to get a better share of money from the economy)."
        },
        {
            "tag": "p",
            "html": "In order to achieve this, you and your team have to always compete to provide more in service for the same price. That’s the only way the economy moves forward and that means that more is expected of you than was expected the previous year."
        },
        {
            "tag": "p",
            "html": "The same is expected of your income. You are expected to earn more as the time flies because standing still in today’s world is equivalent to going backward."
        },
        {
            "tag": "p",
            "html": "We are expected to grow with the economy to stay on the same level as we were the previous year."
        },
        {
            "tag": "h3",
            "html": "Invest in Yourself"
        },
        {
            "tag": "p",
            "html": "Change is the only constant in the economy we live in today. We are often expected to provide more services for the same pay."
        },
        {
            "tag": "p",
            "html": "It makes complete sense. You have to provide more value to others than what you demand in pay."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“The only way to make money and stay wealthy is to find a way to do more for others than anyone else is doing which people value”</i> - <b>Tony Robbins</b> "
        },
        {
            "tag": "p",
            "html": "There are people who would like to do the least and expect the most from the society and the economy. This cannot be a reliable strategy as it is not a viable long-term solution to the economic problem."
        },
        {
            "tag": "p",
            "html": "Providing more in value has its perks. It does not mean that you have to expect less and provide more. For example, if you are currently working in an organization and you want a promotion, the viable strategy to implement would be to do 100% of your work and 50 % of your boss’ job."
        },
        {
            "tag": "p",
            "html": "Chances are that in order to do what your boss is doing you have to learn their skill set. Your boss will be much more willing to delegate the work which you are good at than the one you are not."
        },
        {
            "tag": "p",
            "html": "This forces everyone to always strive to learn. It would be a delight if learning is a pleasurable experience for you."
        },
        {
            "tag": "p",
            "html": "The days that you wait for the promotion to come to you is gone. You either take what is rightfully yours or stay in the same position and begin to rot."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“We are either growing or dying”</i>"
        },
        {
            "tag": "h3",
            "html": "Expanding your streams of Income"
        },
        {
            "tag": "p",
            "html": "Another way of generating more income would be to expand your streams of income. Conventional ways of thinking are only going to take you so far."
        },
        {
            "tag": "p",
            "html": "There are going to be good times and bad times in life. It is better to take advantage of the good times and start building molds around your castle in order to prevent destruction during the bad times."
        },
        {
            "tag": "p",
            "html": "In the developed nations, you could find organizations which enjoy a monopoly over certain sectors. This is because they have grown too large to be meddled with. There is always a tipping point where a company becomes too large to fail. Similarly, there is a tipping point for every individual’s financial situation. At first, it is going to be hard to earn one months income as an extra earning every year."
        },
        {
            "tag": "p",
            "html": "If we keep at it, keep working on our financial situation, always tweaking to find out what works and what does not for us. We are eventually bound to reach a tipping point after which the money that is produced from your investments or streams of income is more than enough to sustain your current lively hood."
        },
        {
            "tag": "p",
            "html": "Usually, it takes a million failure and many more attempts to get things right. But more than that we need ideas, capital, willingness to take the risk."
        },
        {
            "tag": "p",
            "html": "Traveling is one of the most important aspects to gain new ideas. As soon as you get them, write them down somewhere."
        },
        {
            "tag": "p",
            "html": "Learning a new language, culture, traveling, finding what businesses solve what problems abroad will give you a different perspective of the world. They are often necessary to create better opportunities for ourselves."
        },
        {
            "tag": "p",
            "html": "The more the problems people solve, the more difficult it is to find a new one. You will be paid in accordance with the value you provide."
        },
        {
            "tag": "p",
            "html": "After finding a solution to some key problems in life, start providing solutions to those problems and start to innovate, take a major share of the market and start building customer trust. These are the molds that we build around ourselves / businesses."
        },
        {
            "tag": "h3",
            "html": "Paying Less Tax"
        },
        {
            "tag": "p",
            "html": "Did you know that you pay less tax when you make money with money than by making money by providing services?"
        },
        {
            "tag": "p",
            "html": "There are ways to pay lesser tax. Always find a way to pay lesser tax if possible."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Do not get a home loan because the money and the interest you pay will not be taxed</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Do not get a loan in general for the tax benefits.</p></div>"
        },
        {
            "tag": "p",
            "html": "If you do the calculations, you will know that it is better to pay taxes than to take a loan. If you take a home loan for $100,000 and you pay $12,000 every year for the next 15 years, you will not be paying tax for the $12,000 but you will be paying around $180,000 in the span of 15 years to the banks."
        },
        {
            "tag": "p",
            "html": "Payment to bank = $12,000 x 15 = $180,000"
        },
        {
            "tag": "p",
            "html": "You pay $80,000 to the bank towards interest alone."
        },
        {
            "tag": "p",
            "html": "if you pay taxes on the $12,000 for the next 15 years, assuming that the tax will be 30%, you will have."
        },
        {
            "tag": "p",
            "html": "$8,400 (take home for $12,000) * 15 = $126,000"
        },
        {
            "tag": "p",
            "html": "$180,000 – $126,000 = $54,000"
        },
        {
            "tag": "p",
            "html": "You pay $54,000 to the government in taxes."
        },
        {
            "tag": "p",
            "html": "There are ways to prevent a certain amount of money from being taxed and help it grow at a steady rate."
        },
        {
            "tag": "p",
            "html": "Examples are ROTH IRA / IRA in the US, Public Provident Fund (PPF) / Employee Provident Fund (EPF) in India."
        },
        {
            "tag": "p",
            "html": "I am sure every country has its own name but the point remains the same. You either pay the government or invest in the stock market before you obtain your pay. Hence that sum will not be accounted for taxes."
        },
        {
            "tag": "p",
            "html": "Employee Provident Fund and Public Provident Fund in India do not tax upon withdrawal."
        },
        {
            "tag": "p",
            "html": "ROTH IRA in the US demands the tax to be paid while entering the fund but has a tax free growth once the money is in the ROTH IRA."
        },
        {
            "tag": "p",
            "html": "IRA in the US demands a tax to be paid upon withdrawal."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“It is always better to pay the taxes before growth than after growth”</i>"
        },
        {
            "tag": "p",
            "html": "You will be paying more otherwise."
        },
        {
            "tag": "h3",
            "html": "Save more by Cutting Spending"
        },
        {
            "tag": "p",
            "html": "One of the first things to do while starting to save is to cut spending. it is so easy to say but so hard to implement."
        },
        {
            "tag": "p",
            "html": "It is often considered as a no-brainer. You will have to forego on a lot of things. Cut all of your unnecessary expenses. Live with the bare minimum. Start saving money."
        },
        {
            "tag": "p",
            "html": "While you are at it, the first few months will be the hardest as you will see very less result for your hard work."
        },
        {
            "tag": "p",
            "html": "You keep at it for a few months / a few years. You will start to see the results."
        },
        {
            "tag": "h3",
            "html": "Doubling down on What Works for you"
        },
        {
            "tag": "p",
            "html": "There are things which will yield maximum results for your neighbor but will yield none for you. Learn to accept the fact that you are better at certain things in life and others are better at certain other things."
        },
        {
            "tag": "p",
            "html": "You can try a lot of things at a given time or give your best on one thing. It is better to start working on the things that you do best without deviating."
        },
        {
            "tag": "p",
            "html": "If something works for you, better double down on it till you get the maximum juice out of it. Keep at it till you can get no more from it. Then you will start to get a steady stream of income from that work."
        },
        {
            "tag": "p",
            "html": "Always work on generating passive income from your business. It is one of the most basic principles for generating multiple streams of income."
        },
        {
            "tag": "p",
            "html": "One of the important passive income streams is through investing in a business. The investment can be in the form of stock market purchase, mutual fund purchase, index fund or building your own business."
        },
        {
            "tag": "p",
            "html": "It takes time to build your own business from scratch. It is all the easier to buy an already established business if you are short on time in order to generate income."
        },
        {
            "tag": "p",
            "html": "Another better example of doubling down on what you are good at is trying to get a better return on your investment for the same amount of risk for the same amount of money."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Can anybody imagine a time where times were not hard and money not scarce”</i> - <b>Ralph Walford Emerson</b>"
        },
        {
            "tag": "p",
            "html": "Generating money is a hard task. That’s exactly why many settle down for good enough returns."
        },
        {
            "tag": "p",
            "html": "Best yields can be generated for the opportunistic. To obtain the best results you need to analyze what you currently have and learn to appreciate the things which you currently have and are good at."
        },
        {
            "tag": "p",
            "html": "Improve on what you are good at and delegate the tasks you are bad at. You only have a finite amount of time with you. You cannot possibly imagine doing all the things on your own."
        },
        {
            "tag": "p",
            "html": "That’s exactly why businesses are for. You can pay them to do your work for you."
        },
        {
            "tag": "h3",
            "html": "Planning to Achieve your Dreams"
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“When you cease to dream, you cease to live”</i> - <b>Malcolm Forbes</b>"
        },
        {
            "tag": "p",
            "html": "What happens after you start generating some money from the above-said strategies?"
        },
        {
            "tag": "p",
            "html": "You start to give the money a name, a purpose. Everything in life needs a purpose. What happens to the money you do not give a name to? You would eventually waste it away."
        },
        {
            "tag": "p",
            "html": "We dream of buying things and consuming them in our lives. What if we find a way to save money for spending it eventually on the dreams."
        },
        {
            "tag": "p",
            "html": "Tony Robbins calls it DREAM BUCKET. What are the things that you could only dream of having right now but want it really bad enough?"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">List the most important dreams in your life.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Allocate the newly generated resources to aid in the attainment of the dream.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Keep at it till you achieve enough capital.</p></div>"
        },
        {
            "tag": "p",
            "html": "The greatest advantages of dreaming to attain something is that it requires a great deal of effort, innovation, problem solving and luck. If you really want it bad enough you will plan for it and execute a detailed plan to attain it."
        },
        {
            "tag": "p",
            "html": "As long as it could be obtained in a way which would be beneficial for all parties concerned, it should be possible."
        },
        {
            "tag": "h3",
            "html": "Grass is greener on the Other Side"
        },
        {
            "tag": "p",
            "html": "Appreciating what you currently hold dear is just as important as dreaming and chasing your dream."
        },
        {
            "tag": "p",
            "html": "It could be a foolish move if you choose to chase your dream without realizing what you would like to never miss in your life. I could remember a huge number of people who have made that mistake and are regretting it now."
        },
        {
            "tag": "p",
            "html": "A classic example is a relative of mine. Let’s call him Kevin. Kevin was a physiotherapist. He was working in Chennai, India for a few years after which he got a really good offer in Kuwait. It was the best financial move for him and life was happy for a few years until Kevin’s parents started seeking an alliance."
        },
        {
            "tag": "p",
            "html": "We still practice arranged marriages in India where parents would seek alliance and ask their children to marry them. It was back in 2003 when the “US invasion of Iraq” began. Bombshells would hit the country of Kuwait. So people were afraid to marry him as it would mean that the girl goes to Kuwait and risks her life."
        },
        {
            "tag": "p",
            "html": "Having searched for an alliance for years unsuccessfully, the family members of Kevin arranged for a new job in Dubai. A much safer country when compared to Kuwait back in the days of Iraq war. Kevin finally got married and was successfully working in Dubai. Even though the salary wasn’t much, his wife would also aid him financially by working in Dubai. It was a happy family. They couldn’t save a lot but they were getting along."
        },
        {
            "tag": "p",
            "html": "I honestly do not know what hit them. After eight years in Dubai as a physiotherapist, Kevin moved back to India. I could only imagine that such a move had a more emotional explanation than a rational explanation. That was when I was doing my undergraduate and even I knew at that time that it was a wrong decision! I even told them but what’s the use of telling them after they have moved to India."
        },
        {
            "tag": "p",
            "html": "Now, he had borrowed ₹1,000,000 to rent a space and make it a hospital to treat patients. Don’t ask me what happened to the savings which Kevin had while he was working in Dubai."
        },
        {
            "tag": "p",
            "html": "I should only imagine that they had spent it all and came back to India empty-handed. Probably lived an extravagant life or earned too little. I would never know and Kevin was not exactly transparent about his financial situation with anyone."
        },
        {
            "tag": "p",
            "html": "So, Kevin’s new hospital is being totally new and only starting to attract new customers. It had been one year since Kevin opened a new hospital in India. As you know, any hospital requires reputation and Kevin was by all means building his own reputation in India. He was also very stubborn about building his from scratch. One could only wonder why!"
        },
        {
            "tag": "p",
            "html": "He also had an opportunity to buy a 10-year-old hospital with regular customers at a much affordable price which he instantly denied."
        },
        {
            "tag": "p",
            "html": "It all turns out to be a mistake only when you give up. It is never a wrong decision until you give up! Kevin gave up on Dubai. It was the wrong decision. Kevin gave up on building his reputation in India and migrated to Canada a couple of years later."
        },
        {
            "tag": "p",
            "html": "That was about the time when I traveled to the UK for my Masters. Kevin was in his 40’s and he had a 8-year-old kid at that time. He imagined a better place in Canada. Till today, He is working as a part-time physiotherapist and could not find a more permanent job, During his stay in Canada, Kevin had another child. They are now a happy family of four."
        },
        {
            "tag": "p",
            "html": "For their migration, they had borrowed another ₹500,000 more. Now, they owe a grand total of ₹1,500,000. How could Kevin repay the amount in full when he is struggling financially?"
        },
        {
            "tag": "p",
            "html": "Borrowing from relatives has its own perks. You do not have to pay interest on the money borrowed but when you fail to repay the money promptly, you risk losing the relationship. I guess that’s what happened with Kevin. He lost the people close to him because he wanted a financial shelter under their roof."
        },
        {
            "tag": "p",
            "html": "He is now slowly starting to repay the borrowed amounts but the damage has already been done. Everyone looks to him as a person who had missed the opportunity to be someone better."
        },
        {
            "tag": "p",
            "html": "Kevin acknowledges the fact as well. He often regrets leaving Dubai and says “My junior is now managing the whole physiotherapist department. If only I had been there!”"
        },
        {
            "tag": "p",
            "html": "<b>It is sometimes wise to plant your roots and settle down in a single place if you know you are doing reasonably good there.</b>"
        },
        {
            "tag": "p",
            "html": "It makes sense then to say “The grass is not always greener on the other side; It may seem to, but in reality, it is not”."
        }
    ]
}