{
    "url": "/personal-finance/investment-management-strategy/",
    "title": "Never Kill Your Goldent Goose",
    "image": "/img/personal-finance/investment-management-strategy.jpg",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "p",
            "html": "The investment management strategy has to be personalized and should satisfy your need. For this reason, I do not provide a tailor made strategy which could satisfy everyone's needs."
        },
        {
            "tag": "p",
            "html": "The above mentioned strategy is a sample blueprint which could be implemented by any individual in India."
        },
        {
            "tag": "p",
            "html": "I believe that the above example would shed some light on how to invest. Let’s take a retirement plan in India. Apart from your mandatory payments to the Employees Provident Fund (EPF), let’s imagine that you are having a surplus and are choosing to invest in an index fund (UTI Nifty Fund) a set amount periodically and systematically. In other words, you are investing in UTI Nifty Fund with Rupee Cost Averaging strategy."
        },
        {
            "tag": "p",
            "html": "After you retire, you are withdrawing all of the balance from the UTI Nifty Fund and are choosing to do it in a cost efficient manner."
        },
        {
            "tag": "p",
            "html": "You could split the investment into two if not three separate sections."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">First ₹5,000,000 from the UTI Fund Investment goes into a Capital Gains Scheme Bond which is offered through National Highway Authority of India (NHAI)  & Rural Electric Corp. (REC).</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Second split which could be any amount which you desire is necessary to build a home goes into a Capital Gains Account Scheme.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Third split is left in the UTI Nifty Fund untouched to grow.</p></div>"
        },
        {
            "tag": "p",
            "html": "Wait for the first ₹5,000,000 which is invested in the Capital Gains Scheme Bond to mature. It has a maturity period of 3 years, after which you could invest the capital gained which is legal and tax free into Fixed Deposit & Annuity Plans."
        },
        {
            "tag": "p",
            "html": "If you are building a home, you have a three year period before which you have to use the money invested in the Capital Gains Account Scheme. You have to use it only for that purpose and the government will make sure of it. So, build the house for you to live or better build one with the sole intention of renting it."
        },
        {
            "tag": "p",
            "html": "The third section which we have left it in the UTI Nifty Fund could be taken after the first investment in the Capital Gains Scheme Bond have matured, because the total aggregate maximum investment allowed in these bonds are capped at ₹5,000,000. You can keep repeating this cycle to retrieve the investment from the index funds tax free in India."
        },
        {
            "tag": "p",
            "html": "Else, you will be liable for taxes on the capital gains. We should make sure that wherever possible we legally avoid all the taxes."
        },
        {
            "tag": "p",
            "html": "Indian government have provided us with EPF and PPF which could be considered as a boon. Other countries do not have such schemes and we can consider ourselves lucky as the growth with in the EPF & PPF are not taxed along with the invested capital."
        },
        {
            "tag": "p",
            "html": "Roth IRA & IRA are taxed one way or the other while ROTH IRA requires tax paid dollars to be invested, traditional IRA requires the employee to pay tax upon withdrawal."
        },
        {
            "tag": "p",
            "html": "Further explanation is provided in the Part 27 : Investing in Index Funds."
        }
    ]
}