{
	"url": "/personal-finance/what-is-money/",
	"title": "What is Money?",
	"image": "/img/personal-finance/what-is-money.jpg",
	"subcategoryPresent": false,
	"breadcrumb": [
		{
			"crumbTitle": "Blog",
			"crumbUrl": "/"
		},
		{
			"crumbTitle": "Personal Finance",
			"crumbUrl": "/personal-finance/"
		}
	],
	"content": [
		{
			"tag": "p",
			"classInfo": "quote",
			"html": "<i>“Do nothing, say nothing and be nothing and you'll never be criticized”</i> - <b>Elbert Hubbard</b>. "
		},
		{
			"tag": "p",
			"html": "Money, Love & Enemy… "
		},
		{
			"tag": "p",
			"html": "These are some of the words which evoke extreme emotions. "
		},
		{
			"tag": "p",
			"html": "Love is prevalent in the society. We learn to express them from the moment we are born. Nobody has to expressly teach us how to love. They are embedded in our DNA. "
		},
		{
			"tag": "p",
			"html": "However the same cannot be told for money. Ask yourself what is money? "
		},
		{
			"tag": "p",
			"html": "Ask others “What is money?” Everyone has a different explanation for it. Some say “Money is the root of all evil”. "
		},
		{
			"tag": "p",
			"classInfo": "quote",
			"html": "<i>“The love of money is the root of all evil”</i> - <b>Bible, 1 Timothy 6:10</b>. "
		},
		{
			"tag": "p",
			"html": "Some are ashamed of not having enough money. Some are guilty of having a lot of money. Some are indeed greedy. There are as many emotions as there are emotions themselves which are expressed when money comes into play. "
		},
		{
			"tag": "p",
			"html": "Some are willing to trade something more valuable than money like their family, health, happiness, etc as money has the power to create and destroy everything in its path. "
		},
		{
			"tag": "p",
			"classInfo": "quote",
			"html": "<i>“Money is a good servant but a bad master”</i> - <b>Sir Francis Bacon</b>. "
		},
		{
			"tag": "h3",
			"html": "What is money?"
		},
		{
			"tag": "p",
			"html": "Can you imagine the times without money? Imagine yourself there wanting salt in an era without money. All you have is two bags of rice. When you go to the salt vendor he says “I already have enough rice mate, bring me two live chickens, I’ll trade with you”. "
		},
		{
			"tag": "p",
			"html": "Things escalate quickly when the livestock vendor wants something else. It’s such a pain! "
		},
		{
			"tag": "p",
			"html": "Money liberates you from pain and provides the option to do whatever you want to do with it."
		},
		{
			"tag": "p",
			"classInfo": "quote",
			"html": "“Money is freedom”"
		},
		{
			"tag": "p",
			"html": "How you are willing to build the wealth is what differentiates one from the other. While choosing a title for this book, I was perplexed by the choice of using “The Art of Building Your Wealth”.  Building your wealth requires vivid imagination & skill and expresses important feelings and emotions. If building your wealth is not art what else is it? "
		},
		{
			"tag": "p",
			"html": "Science is boring for many. Art feels beautiful & skillful. Only the experienced, well educated in the art of personal finance can even think of building their wealth. You’ll see in the pages to come how to build your wealth from scratch. "
		},
		{
			"tag": "p",
			"html": "I always feel if you want to become like someone find out how they achieved it and follow their path. You will reach there all by yourself. "
		},
		{
			"tag": "p",
			"html": "Having been perplexed with the same questions and spending quite a couple of years learning about the successful people I stumbled upon an important factor common with all the successful ones. "
		},
		{
			"tag": "p",
			"html": "We all remember them for the work which they do without that they are nobody. What comes to your mind when I say Elon Musk, Warren Buffett, Bill Gates, Tony Robbins, Mark Zuckerberg? Their contribution to this society is humongous and they are an immense success. "
		},
		{
			"tag": "p",
			"html": "I’ve been studying them and this is what I have found. Although their work life has to do nothing with their personal life, it creates an opportunity for them to be successful. But wait, not all of them are Donald Trumps & Mike Tysons. They are in the top 1%. What about the remaining 99% of the population? "
		},
		{
			"tag": "p",
			"html": "How can they be successful? Heck! I am in the 99%. If only the top 1% can be successful in life, we are all failures and I am too proud to declare it! "
		},
		{
			"tag": "p",
			"html": "Success for most of us (Millennials) is building a home, buying a car, retiring with a lump sum of money while traveling around the world. "
		},
		{
			"tag": "p",
			"html": "Knowing how to achieve these is half the battle won! I developed four simple strategies to implement in your life to make sure that you reach there and they are <b>Income, Debt, Savings & Investment Management Strategies.</b> "
		},
		{
			"tag": "p",
			"html": "My promise to you is: If you choose to stick with me until the end, these four strategies have the power to help you reach your financial freedom. "
		},
		{
			"tag": "p",
			"html": "I detest to use the word win! As it brings the thought of losing to mind! If you win, someone else loses. We the 99% often lose! That’s how we learn. But if you know the rules of money, you can keep making a decent amount of money for a really long time and retire rich. "
		},
		{
			"tag": "p",
			"html": "When I say Sylvia Bloom, does it ring a bell? I am sure it doesn’t. She was a frugal receptionist who made a whopping $12 million dollars by the time she died."
		},
		{
			"tag": "p",
			"html": "She did it the slow way, She did not earn the lottery or win something huge along the way. She learned the rules of money and she applied it to her life. "
		},
		{
			"tag": "p",
			"html": "You can make it too. Any normal person has the ability to do just that if he or she is willing to. Life is full of opportunities and those with a strong purpose and determination can achieve what Sylvia Bloom has achieved."
		}
	]
}