{
    "url": "/personal-finance/include-your-partner/",
    "title": "Include your Partner?",
    "image": "/img/personal-finance/include-your-partner.jpg",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "p",
            "html": "Your partner is one of the most influential people in your life. The importance of having a right partner in life is realized in the emotional and financial aspect of your life."
        },
        {
            "tag": "p",
            "html": "With increasing equality towards women even in the developing nations, it is an eventuality that they will be treated equally to men around the world, a safer world where they have equal rights."
        },
        {
            "tag": "p",
            "html": "The developing nations are the most affected by the changing gender equality, being forced to accept the truth."
        },
        {
            "tag": "p",
            "html": "The world is becoming a safer place to live for both men and women. It is becoming a better place for the benefit of all of us. All the governments around the world are keen on promoting gender equality; so it is time for us to let them into our personal finance as well."
        },
        {
            "tag": "p",
            "html": "In the quest for more knowledge and wisdom, there is no room for male chauvinism and the similar beliefs preventing one from reaching the best expression of oneself."
        },
        {
            "tag": "p",
            "html": "So, having destroyed any room for male chauvinism to prevent one from including your partner in your endeavor to achieve financial freedom, we can speak about the advantages of including your partner."
        },
        {
            "tag": "h3",
            "html": "Synchrony"
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“It is necessary to stay in synchrony financially and emotionally to make sure that the relationship pushes both of them to achieve”</i>. "
        },
        {
            "tag": "p",
            "html": "The financial barrier is a hard nut to crack. Everyone has one’s own priorities and wishes in life. After all, it is your earning and your savings; the one who is entitled is you, isn’t it?"
        },
        {
            "tag": "p",
            "html": "Who owns the relationship then? Is it you or is it she? The question is absurd, isn’t it?"
        },
        {
            "tag": "p",
            "html": "If you are in a relationship, it is equally taking part in it that makes it a relationship. Else I guess you can call it dictatorship."
        },
        {
            "tag": "p",
            "html": "If you both equally love each other and trust that the bond will be lasting, it will not be hard to include the other half in your financial situation."
        },
        {
            "tag": "p",
            "html": "If you cannot trust them with your finance, don’t trust them in the first place; why did you get married?"
        },
        {
            "tag": "p",
            "html": "There is no room for selfishness in a relationship. If you have a child together, who owns the child? The child owns himself/herself."
        },
        {
            "tag": "p",
            "html": "You both play a role in shaping the child. You own nothing! Nothing except for the love that you share with your child and having the other half loving your child equally, as your child is equally hers."
        },
        {
            "tag": "p",
            "html": "You could create a financial situation from which you both could enjoy the benefits as long as you live and pass it on to your child after you are history."
        },
        {
            "tag": "h3",
            "html": "Individualism"
        },
        {
            "tag": "p",
            "html": "What is the point of living for yourself when the whole society is designed on how useful you are to others?"
        },
        {
            "tag": "p",
            "html": "Do you want to pay for everything with money? Everybody in this society even your partner wants your money; don’t they?"
        },
        {
            "tag": "p",
            "html": "They will only want it as long as you say it is yours. When you develop a habit of sharing in your relationship, it is no longer yours but ours."
        },
        {
            "tag": "p",
            "html": "All these make sense when you are creating a stable financial situation together from scratch. But life is not always like that; Is it?"
        },
        {
            "tag": "p",
            "html": "You have a legacy. You also bring your inheritance from your parents and their parents when you are marrying someone and getting into a long-term relationship."
        },
        {
            "tag": "p",
            "html": "What do you do with it as it is only yours? We have Prenups for that!"
        },
        {
            "tag": "h3",
            "html": "Prenup"
        },
        {
            "tag": "p",
            "html": "If you are already in a financially stable position when you meet your partner then it makes sense to get a prenup."
        },
        {
            "tag": "p",
            "html": "Even after getting a prenup, the society and the law can decide to throw the prenup out of the door and take the other partner's side."
        },
        {
            "tag": "p",
            "html": "These circumstances are becoming increasingly common as the divorce rates are increasing at a phenomenal rate."
        },
        {
            "tag": "p",
            "html": "This situation will put your financial situation in jeopardy. Better start the relationship thinking everything is ours so you won’t have a financial and emotional shock if your partner decides to leave you."
        },
        {
            "tag": "p",
            "html": "For a good number of people, money governs their relationship, themselves and everything they do. These people are the ones that often break the relationships for money. They are also called Gold Diggers. It is relatively easy to find the gold diggers when you are an emotionally intelligent person."
        },
        {
            "tag": "p",
            "html": "Be a good judge of character. Spend time to nurture your relationship. Share the happiness. Experience life together."
        },
        {
            "tag": "p",
            "html": "If you cannot trust your partner with half of your finances, you are bound to live a stressful life."
        },
        {
            "tag": "h3",
            "html": "One Build; The other Destroys"
        },
        {
            "tag": "p",
            "html": "If you are already in a relationship where one has a surplus of money and the other is short on money, it is not uncommon to find one of them on a spending spree while the other tries to accumulate money."
        },
        {
            "tag": "p",
            "html": "A collaborative effort can take advantage of synergy and yield many times the result one could imagine achieving alone."
        },
        {
            "tag": "p",
            "html": "When you make the other person responsible for your money, they take pride in the ownership and try to preserve the current financial state."
        },
        {
            "tag": "p",
            "html": "Make sure you and your partner are on the same page when it comes to what you would like to do with the money that you both choose to save."
        },
        {
            "tag": "p",
            "html": "There is always an underlying reason when your partner is least bothered about the importance of saving. Convey how important it is for both of you to be secure financially and that relying solely on consumerism and borrowing for joy is a game which is bound to lead both of you to misery."
        },
        {
            "tag": "p",
            "html": "Start producing something together and find joy in generating money rather than consuming it. There are CEOs worth million dollars who have never borrowed a penny but own 100% of the company."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Only Morons Start a Business on a Loan”</i> - <b>Mark Cuban</b> "
        },
        {
            "tag": "p",
            "html": "As life goes on, it either improves the relationship by building on trust or destroys the relationship. If you keep at it for long enough, you will either have an unbreakable trust or a broken marriage."
        },
        {
            "tag": "h3",
            "html": "Divorce"
        },
        {
            "tag": "p",
            "html": "Divorce could be the single worst thing that could happen to anybody both emotionally and financially."
        },
        {
            "tag": "p",
            "html": "It usually happens in the 40’s and 50’s due to the mid-life crisis or happens as soon as you are married i.e within the first 5 years."
        },
        {
            "tag": "p",
            "html": "When it happens within the first 5 years, it would be easy to come out of it as you would just have started to build a life for yourself. But if it happens in your late 40’s or 50’s, that is often the time when you would have built a solid financial base for yourself and have a strong relationship with your children. It would take a turn for the worse."
        },
        {
            "tag": "p",
            "html": "Even having a prenup would be of no use at times. During a divorce, your money is no longer yours to control. The state decides what to do with your money; how much of it goes where and who gets to see the children, when and for how long."
        },
        {
            "tag": "p",
            "html": "Divorce is when you realize even your children are not yours to see when you deem fit. Lives are destroyed when there is a divorce. People end up with their life savings wiped and all their pensions vanished."
        },
        {
            "tag": "p",
            "html": "It’s the worst nightmare that could happen at the worst time. You will no longer have the strength to make that kind of money and will soon be rendered unfit to work."
        },
        {
            "tag": "h3",
            "html": "What will you do then?"
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“if the relationship can’t survive the long term, why on earth would it be worth my time and energy for the short term?”</i> - <b>Nicholas Sparks, The Last Song</b> "
        },
        {
            "tag": "p",
            "html": "Better build a strong relationship and nurture it. Stay with your partner for life."
        },
        {
            "tag": "p",
            "html": "Choosing a right partner with the right intentions is one of the most important prerequisites to start your journey towards financial freedom."
        },
        {
            "tag": "h3",
            "html": "The Financial Conversation"
        },
        {
            "tag": "p",
            "html": "Remember the girl who trusted me with £7000. I ended up marrying her. It was the best thing that ever happened to me."
        },
        {
            "tag": "p",
            "html": "By that time, I had disappointed her in money management so much that she had started managing her money for almost a year."
        },
        {
            "tag": "p",
            "html": "Now, I wanted to make sure that we had a single financial goal and plan after being motivated by reading the book “Think Big and Kick Ass” by Bill Zanker & Donald Trump.  Except that, she would not agree to it. It was the most difficult conversation we have ever had. We had to set up ground rules."
        },
        {
            "tag": "p",
            "html": "What could be worse? We had all these conversations over the phone. I was in Spain and she was in India. We were engaged by then and were about to get married in three months."
        },
        {
            "tag": "p",
            "html": "It has been a year and a half after marriage. I have lived up to my expectations. It is a promise for a lifetime. Still, have a lifetime left to live up to my expectations. I am sure that I will fail again."
        },
        {
            "tag": "p",
            "html": "As long as we are on the same page, we can still crawl out of any dire financial situations together."
        }
    ]
}