{
    "url": "/personal-finance/income-allocation-strategy/",
    "title": "Income Allocation Strategy?",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "img",
            "classInfo": "article-header-image",
            "srcUrl": "/img/personal-finance/income-allocation-strategy.jpg"
        },
        {
            "tag": "p",
            "html": "The income allocation blueprint is a suggestion to allocate a certain portion of your income."
        },
        {
            "tag": "p",
            "html": "This income allocation suggestion works really well when you include your partner as well.  To prevent you from calculating all the budgeting allocation yourself."
        },
        {
            "tag": "p",
            "html": "To help you understand the strategy better, all of the components mentioned in the strategy is broken down and explained in bullet points."
        },
        {
            "tag": "h3",
            "html": "Food / Travel Expenses"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">The food and travel expenses are set to 25 – 30%.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">They include your groceries, every day travel expenses.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">As your income grows you could include your expenditure for hotel and holiday travels within the food and travel allowances.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Food / travel expenses are better <b>spent on cash</b>.</p></div>"
        },
        {
            "tag": "h3",
            "html": "Emergency Fund"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">You don’t need a credit card to cover your emergency expenses. That’s what insurance and emergency funds are for!</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Six months of your monthly income as an emergency fund is a must to even start your journey towards financial freedom.</p></div>"
        },
        {
            "tag": "h3",
            "html": "Debt Repayment"
        },
        {
            "tag": "p",
            "html": "Find this strategy in Part Four : Debt Management Strategy."
        },
        {
            "tag": "h3",
            "html": "Miscellaneous Expenses"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">The miscellaneous expenses cover any expenses other than your food/travel, rent/mortgage, insurance, self-education and charity expenses.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Miscellaneous expenses can be expended for anything which you desire.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">The expenses might include your occasional visit to theatres / any pleasures that you find soothing to occasionally encounter.</p></div>"
        },
        {
            "tag": "h3",
            "html": "Insurance Expenses"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Insurance expenses are generally different from the “Pay Yourself First”, as they are a form of security and also fall under expenses.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">It is a security as it provides you the cover if things go bad but often they don’t.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Your car insurance, life insurance, medical insurances and every other sort of insurance go in here.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">4</div><div class=\"copy-container\"><p class=\"description mb-3\">If your insurance expenses are more than the allotted budget, maybe it is time to drop a handful of them or opt a reduced plan.</p></div>"
        },
        {
            "tag": "h3",
            "html": "Self-Education Expenses"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Often you can learn without spending a dime but there comes a time when you have to, if you need to have an in-depth knowledge on something, it will cost you.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Again, they are advisable only for those who could take care of their needs and afford to spend in this category.</p></div>"
        },
        {
            "tag": "h3",
            "html": "Charity Expenses"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">The charity expenses are only for those who earn enough salary to take care of themselves.</p></div>"
        },
        {
            "tag": "h2",
            "html": "Investment Strategy"
        },
        {
            "tag": "h3",
            "html": "Investment Vessels"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">They are the most reliable forms of investments for the long term which appreciate more than the inflation.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Ensure that you check the quality of the investment vessel before investing.</p></div>"
        },
        {
            "tag": "p",
            "html": "For more information on  individual investment vessels, please check the <i>Part Six: Investment Management Strategy</i>."
        },
        {
            "tag": "h3",
            "html": "Security Vessel"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">They are the safest form of investments which protect the investor from the downslide and the disadvantage of a security vessel is the lower returns which it yields.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">They are a must invest segment, you need a reliably money source to fall back to.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Annuity Plans are listed under investment but they are also a form of security.</p></div>"
        },
        {
            "tag": "p",
            "html": "Avoid Mutual Funds at all costs. Check out the book by Tony Robbins “Money - master the game” for over 600 pages advising why not to invest in a mutual fund."
        },
        {
            "tag": "h3",
            "html": "What's Worse?"
        },
        {
            "tag": "p",
            "html": "Income allocation could be demanding at first. Honestly, what could be worse than managing your income?"
        },
        {
            "tag": "p",
            "html": "Not managing your income!"
        },
        {
            "tag": "p",
            "html": "What is the cost of not managing your income? Millions!"
        },
        {
            "tag": "p",
            "html": "Let me tell you a real-life story of a man who inherited fifteen acres of land and two three bedroom houses when he turned twenty-five."
        },
        {
            "tag": "p",
            "html": "Let’s call him John. John lived with his mother when he inherited his father’s wealth. By all means, John’s father Jone was hardworking and a self-made millionaire. Jone had a medical condition induced by excessive cigarette smoking which ensured his premature death. Upon Jone’s death, his three male children inherited all his wealth. That brings us to John."
        },
        {
            "tag": "p",
            "html": "John got married really early and inherited money from his father. He hardly had the necessity to learn about finance and has scarcely worked his entire life. He didn’t really needed to, as his inheritance would feed him and his family for a lifetime."
        },
        {
            "tag": "p",
            "html": "So, he never really worked his entire life. His wife was by all means extravagant. They both lived a really comfortable life and never really wanted to work. So, they would sell all their earnings from their cardamom estate. Any farmer would know to keep a portion of their earnings to reinvest on that property. Apparently, John didn’t. He spent all their earnings from their real estate and borrowed money from a private lender to reinvest on the cardamom estate."
        },
        {
            "tag": "p",
            "html": "The private lender would charge 100% interest rate on the loan amount. We call them “Kandhu Vatti”, meaning, private lending at a ridiculously high rate. They were known to borrow this money for personal extravagance as well."
        },
        {
            "tag": "p",
            "html": "Could anyone survive this? No, apparently they started selling their property to pay off their debts and were often known to keep a small portion of their “Kandhu Vatti” remaining. God knows why! I guess, they just wanted to spend all the money for themselves. That could be the only possible explanation."
        },
        {
            "tag": "p",
            "html": "To teach us to live a mindful life, my parents and relatives would quote “They once hired a car to travel”. It was back in the 80’s, when only the ultra-rich could afford a car and the poverty rate in India was close to 60%."
        },
        {
            "tag": "p",
            "html": "Slowly but steadily, they lost their wealth. John also had the habit of gambling. He once went to jail for gambling as gambling is banned in India. He would often drink like a fish. Now, John is worth a total of ₹0."
        },
        {
            "tag": "p",
            "html": "He is in his 70’s and is a victim of a stroke. Stroke induced by stress. What could be worse right? Nope, he failed to educate his children and hence some of them are determined to abstain from work for their entire lives."
        },
        {
            "tag": "p",
            "html": "The last time I saw them was back in 2008 when they were living in their only home. I later found out that, they had sold that home and lent some of the money to a person whom they knew but they never got that back as well."
        },
        {
            "tag": "p",
            "html": "John’s life is filled with tragedy. He now relies on his son who never intend to work."
        },
        {
            "tag": "p",
            "html": "If there is one thing which could have changed their life, it was personal finance and budgeting."
        },
        {
            "tag": "p",
            "html": "I also know enough tragedies to <b>conclude that any person who is willing to work hard at an early age with enough determination to succeed in life will build a strong financial base for him and his family to prosper</b>."
        }
    ]
}