{
    "url": "/personal-finance/self-analysis-understanding-your-habits/",
    "title": "Self-Analysis! Understanding your Habits",
    "image": "/img/personal-finance/self-analysis-understanding-your-habits.jpg",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "p",
            "html": "We were born helpless, unable to speak or feed ourselves on our own. The factors that influence who we become is to a large extent from the outside. Isn’t it?"
        },
        {
            "tag": "p",
            "html": "Yes but we all know the one person who despite all their circumstances succeeded to a large extent."
        },
        {
            "tag": "p",
            "html": "Take Nelson Mandela for example. He is known for as a non violent activist to prevent the anti-racist movements. In 1961, Mandela orchestrated a three-day national workers’ strike. He was arrested for leading the strike and was imprisoned for the five years in prison. In 1963, He was brought to trial again and was imprisoned for life for political offenses and sabotage."
        },
        {
            "tag": "p",
            "html": "All of this was to abolish the racist ideology which was prevalent during his time. Oh! Yea, during his tenure, he also contracted tuberculosis for which he obtained comparatively poor treatment."
        },
        {
            "tag": "p",
            "html": "After receiving a Nobel Prize in 1993 for dismantling apartheid in South Africa, he became the first black President in 1994."
        },
        {
            "tag": "p",
            "html": "We do not have to go through what he had gone through; yet having the opportunity to grow, many of us settle down for far lesser than what we really deserve."
        },
        {
            "tag": "p",
            "html": "Let’s have a look at what shapes us!"
        },
        {
            "tag": "h3",
            "html": "Environment"
        },
        {
            "tag": "p",
            "html": "Does environment play a role in shaping you? Of course, it does."
        },
        {
            "tag": "p",
            "html": "There are 535 billionaires in the United States followed by China with 260 billionaires, that’s half less than the United States."
        },
        {
            "tag": "p",
            "html": "Simply counting the number of billionaires can be misleading. Let’s count the number of billionaires in proportion to the population. If we do that Monaco is the number one country with the population per one billionaire equal to 12,600. What about the United States? The United States grabs the thirteenth place with a population per one billionaire equal to 599,569."
        },
        {
            "tag": "p",
            "html": "Being born in United States for example provides a significant advantage over people being born in say, South Africa. Doing average in USA is equivalent to living a millionaire lifestyle in the developing nations."
        },
        {
            "tag": "p",
            "html": "However, “The Science of Getting Rich” by Wallace D. Wattles in 1910 argues that environment does not play a major role in shaping one's success. Wallace explains that getting rich is a not a matter of environment. If it were so then all the people from the same locality will be rich while the others would be poor."
        },
        {
            "tag": "p",
            "html": "He does agree that some environments may be much favorable than others."
        },
        {
            "tag": "p",
            "html": "What about talent then? Is it talent then which makes a man rich? But we can also find an extremely talented poor man. They are the most abundant in our generation."
        },
        {
            "tag": "p",
            "html": "What is the difference between the rich and the poor then? Rich people do things in a certain way. The way they do things in a certain way can be attributed to nurture, habit and character."
        },
        {
            "tag": "h3",
            "html": "Nuture"
        },
        {
            "tag": "p",
            "html": "Immediate gratification! That’s the crisis the Millennials are experiencing. How did it come to be? Immediate gratification is largely attributed to nurture.If you are the only child you are given everything that you want without having to experience rejection. We slowly become unable to face any rejection."
        },
        {
            "tag": "p",
            "html": "What are the effects of not being able to handle rejection or growing without experiencing any threat! You do not know how to handle these situations."
        },
        {
            "tag": "p",
            "html": "“Emotional Intelligence” by Daniel Goleman addresses these factors when he tells a story about a boy who was being harassed continuously by two bullies. Afraid that the bullies might hurt him, the boy brings his dad’s handgun to school and kills the two bullies. When asked he said, “I was afraid they might hurt me”"
        },
        {
            "tag": "p",
            "html": "Such extreme behaviors are attributed to the paralysing fear which the bullied experience."
        },
        {
            "tag": "p",
            "html": "What is the root cause of binging on food? Daniel Goleman says the root cause is the inability to understand if one is hungry or upset or angry is the root cause. As strange as it may be it makes complete sense. How could it be avoided? People often grow up without understanding their inner world."
        },
        {
            "tag": "p",
            "html": "These scenarios can be avoided by teaching emotional intelligence at school."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Emotional intelligence is the ability to recognize, understand, label, express, and regulate emotions, both one’s own emotions and those of others”</i> - <b>Susan Rivers, Deputy Director, Yale University</b>. "
        },
        {
            "tag": "h3",
            "html": "Habits"
        },
        {
            "tag": "p",
            "html": "It’s challenging to sit back and evaluate certain mindsets that you have developed over the past several years."
        },
        {
            "tag": "p",
            "html": "We often stick to our habits, either good or bad. The inability to evaluate oneself has become so common. We most likely develop these habits without being aware of it. How do you know if it is detrimental or beneficial to our long term success? By evaluating the world we live in and determining if the environment rewards you for the habit or punishes you."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Habits either make you or break you”</i>."
        },
        {
            "tag": "p",
            "html": "What are the most beneficial habits to incorporate if we decide to get rid of old habits? People cannot simply stop doing something just because they have decided to. They have to replace the bad habit with a good habit. That is the only way out. The book by Stephen Covey – “7 Habits of Highly Effective People” has seven suggestions to offer."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\"><b>Be Proactive</b> – Being proactive is actively thinking about the action and consequences; then choosing to act in a way that would be constructive for the situation rather than choosing to react to a situation.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\"><b>Personal Leadership</b> – Be your own leader. Hold dominant thoughts in your mind to guide you. Let it serve as a beacon of light in times of darkness.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\"><b>Personal Management</b> – Learn to manage yourself effectively and efficiently, Anger management, for example.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">4</div><div class=\"copy-container\"><p class=\"description mb-3\"><b>Seek Out to Understand; Then be Understood</b> – Become an active listener. Understand the underlying meaning and emotions of what other people say. Feel with them; then respond after they have finished.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">5</div><div class=\"copy-container\"><p class=\"description mb-3\"><b>Win-Win Situation</b> – Always seek out a plan which will be mutually beneficial rather than ripping somebody off which is a one-off Win-Lose Situation. Nobody likes to lose. Life is not a competition.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">6</div><div class=\"copy-container\"><p class=\"description mb-3\"><b>Synergistic solution</b> – Learn to co-operate and work together. Working together can yield results of many folds. Two companies can join together and reach the heights they could never have achieved alone.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">7</div><div class=\"copy-container\"><p class=\"description mb-3\"><b>Sharpen The Saw</b> – There are urgent – unimportant tasks, urgent – important tasks, not urgent – important tasks and not urgent – unimportant tasks. The first and the last have to be avoided at all costs, while the second task can be avoided by doing the third task proactively.</p></div>"
        },
        {
            "tag": "p",
            "html": "Uff! I know this blog was a long one. But what about character? The character is your identity. Some say never change your Identity. I say it is at the root of Nurture that you develop your own character. If the nurture was not fruitful, it’s time to change your character!"
        },
        {
            "tag": "p",
            "html": "Always remember, your habits become your character and your character becomes your identity"
        },
        {
            "tag": "h3",
            "html": "The Girl who thought me how to spend"
        },
        {
            "tag": "p",
            "html": "I never attributed myself as a personal finance expert while graduating from my bachelors back in 2012. I was well known to be a spendthrift."
        },
        {
            "tag": "p",
            "html": "Whenever I get a hold of money, I used to find a way to spend it all. When I possibly couldn’t want anything, I would just waste it away."
        },
        {
            "tag": "p",
            "html": "What changed? Everything! The world as I knew it came crashing down on me when I began following my passion and joined Coventry University to pursue my masters in late 2012."
        },
        {
            "tag": "p",
            "html": "I was supposed to manage the household expenses for all the members of the house. Back in the beginning, we were only 3 people. One for every room. I was chosen to be the most responsible of all (LOL! I was by no means responsible)."
        },
        {
            "tag": "p",
            "html": "I knew I wasn’t even close to being responsible. But something changed. The responsibility of making sure all of us had enough food till the month ends changed me for some reason."
        },
        {
            "tag": "p",
            "html": "We used to allocate £60 per person and had a grand total of £180 to spend on groceries every month."
        },
        {
            "tag": "p",
            "html": "I spent all the money one week before the month ends to buy all the groceries during the first month. As embarrassing as it may be, I learned that monthly budgeted spending on groceries does not work, if I don’t make sure that we spend in a controlled fashion every week, the effect of which could cost us one or two days of starving during the month end! You should see me by the end of four months! I have lost around 20 kilos."
        },
        {
            "tag": "p",
            "html": "Being poor at money management had a real effect on my health. I was dubious to manage the expenses on a weekly basis, mostly because we have become accustomed to this new impoverished lifestyle."
        },
        {
            "tag": "p",
            "html": "Maybe because the money management was already stressful enough, I didn’t want to impose another layer of control over the expense."
        },
        {
            "tag": "p",
            "html": "Then, I met a girl who came to the UK to study at the start of the new year 2013. For some reason, she chose to trust me with managing all of her money. The worst possible person to trust was me, according to me. I also gave her all the reasons she should not trust me with all of her money. She still insisted that I take control of her expenses and just ensure that the money £7000 is sufficient for her to stay till the end of the year."
        },
        {
            "tag": "p",
            "html": "For the first time in my life, I was afraid to manage money. I knew that I am not perfect in money management and I did not deserve to manage someone else’s money."
        },
        {
            "tag": "p",
            "html": "Heck! I couldn’t manage my expenses. To make long story short, by October 2013, her account had a grand total of £0. Our agreement was that I made sure that the account would run dry by the start of the new year January 2014."
        },
        {
            "tag": "p",
            "html": "As expected, I failed again. Miserably this time. I had successfully proved that I was untrustworthy. Motivated to make things a little right, I started working full time as my studies ended by September 2013."
        },
        {
            "tag": "p",
            "html": "I would generate some £800 every month of which I would contribute some amount to her and ensure that she would only ask her parents around £200 every month. That's the best I could do then."
        },
        {
            "tag": "p",
            "html": "Finally, I started to learn the lesson on money management the hard way. The importance of money management dawned on me."
        },
        {
            "tag": "p",
            "html": "After all the series of events which unfolded, I wanted to not let another person down in my life, incase one chooses to trust me again."
        },
        {
            "tag": "p",
            "html": "I should say, I was by no means perfect after that and had failed multiple times later on as well. Just that, when things started to turn south, I learned from the money mistakes. It took another 4 years for me to become considerably better at money management."
        }
    ]
}