{
    "url": "/personal-finance/self-motivation-a-necessity-for-success/",
    "title": "Self-Motivation! A Necessity for Success",
    "image": "/img/personal-finance/self-motivation-a-necessity-for-success.jpg",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "p",
            "html": "Self-Motivation. Some time that is the only thing you will have in order to push yourself towards success. Waking up every day feeling that you are causing a positive change in other people’s life and making it better for everybody as a community can be a motivator. Purpose can be the biggest motivator at times of hardship."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Man belongs to where he wants to go.”</i> - <b>David Schwartz</b>."
        },
        {
            "tag": "p",
            "html": "What can be more motivating than the purpose itself? The money that it reaps! It gives you the sense of fulfillment but getting the same amount of money for years together can be demotivating as well. As a human being, we either grow or die. Growth is the most important factor in everybody's life. How do we increase our ability to earn more money?"
        },
        {
            "tag": "h3",
            "html": "Increase your Ability to Earn"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">You need a strength of purpose to secure more money</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Increase your ability to work and your productivity</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Keen minded men look for progress and opportunities. They do not stand still, else they know they will be left behind</p></div>"
        },
        {
            "tag": "p",
            "html": "The hope of growth and the need to make more money often make us think, “What is all this for?” When should I say what I have done is enough! After all, Warren Buffet is 87 years old and John C Bogle is 88 years old as of 2017 and they haven’t stopped."
        },
        {
            "tag": "h3",
            "html": "Enough"
        },
        {
            "tag": "p",
            "html": "If you are not happy along the way towards success, why does it matter? Sometimes you have to wait for your loved ones to grow along with you."
        },
        {
            "tag": "p",
            "html": "Give them the opportunity and the freedom to do so with your newly acquired wealth; else you will leave behind everyone and grow to be an extremely successful lonely man."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Success is not the key to Happiness. Happiness is the key to Success”</i> - <b>“Enough”, John C. Bogle</b>."
        },
        {
            "tag": "p",
            "html": "Money makes us happy but the happiness which we experience rarely persists. Speaking and connecting with others provides lasting happiness when compared to the money. Without your loved ones around you, success and money mean nothing."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“The great game of life is not about money it is about joining the battle to renew our community, our nation, and the world. To make it better for everybody in the present and future to live a better and fulfilling life”</i> - <b>“Enough”, John C. Bogle</b>."
        },
        {
            "tag": "p",
            "html": "We can all learn to be happy first by living a purposeful and meaningful life by making others around us happy by giving. After all, isn’t giving loving?"
        },
        {
            "tag": "h3",
            "html": "Contribution"
        },
        {
            "tag": "p",
            "html": "The most selfless of all the needs in the path to becoming financially free is also the purest form of love. Contribution without expectation can be the greatest motivator. As Tony Robbins in the book “Money - master the game” said: “All I had was $14 and I gave it all away to the little gentleman who treated his mother like a lady in the restaurant”. It motivated him to achieve and be important in this life."
        },
        {
            "tag": "p",
            "html": "Now, Tony Robbins is worth millions of dollars. He still feeds a lot of people. He fed 100 million people recently. Of course with the help of others. It gives him a sense of purpose."
        },
        {
            "tag": "p",
            "html": "What is your motivation? Contribute today. Don’t wait till you make more money. Providing one dollar to the needy is contributing."
        },
        {
            "tag": "h3",
            "html": "Draining all of your Will Power"
        },
        {
            "tag": "p",
            "html": "Have you ever experienced the feeling of giving up on your pursuit to something? That’s the feeling of failure… Have you ever pushed yourself so hard to complete a task which you started?"
        },
        {
            "tag": "p",
            "html": "While staying motivated to learn about personal finance, I’ve pushed myself too hard to complete a book by John C. Bogle - “Bogle on Mutual Funds”."
        },
        {
            "tag": "p",
            "html": "The book was so dry and empty of emotions. No wonder they call him data devil. Any book which is void of emotion is a textbook of sort. It lacks the depth to connect with the reader but provides immense value to them."
        },
        {
            "tag": "p",
            "html": "I’ve learned as much as all the other personal finance books combined from Bogle on Mutual Funds. The value provided was immense but too daunting."
        },
        {
            "tag": "p",
            "html": "While reading a book, I do not just whoosh through it. I make sure to sustain as much knowledge as possible from the act of reading a book. I still vividly remember my motivation being drained slowly but steadily as I read through it."
        },
        {
            "tag": "p",
            "html": "As I finished reading half of the book, I realized that I didn't have any more motivation to read through it. I had to push myself to read the book very next day. It was daunting! It took me another 15 days to finish reading it."
        },
        {
            "tag": "p",
            "html": "Having used all of my willpower to finish reading, I never touched another book for a whole month and it took another two or three months to slowly start recovering from it. I had to re-motivate myself to start learning more about personal finance."
        },
        {
            "tag": "p",
            "html": "I swore to never do such a stupid thing ever in my life. I had wasted so much time not reading anything. I felt too low for not learning anything for one whole month. So I started learning about personal finance slowly."
        },
        {
            "tag": "p",
            "html": "Lesson learnt, <b>Never drain your willpower to do any act! Learn to motivate yourself to learn instead</b>."
        }
    ]
}