{
    "url": "/personal-finance/credit-cards-how-to-increase-your-credit-score/",
    "title": "Credit Cards: How to Increase your Credit Score",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "img",
            "classInfo": "article-header-image",
            "srcUrl": "/img/personal-finance/credit-cards-how-to-increase-your-credit-score.jpg"
        },
        {
            "tag": "p",
            "html": "Before reading Ramit Sethi’s book – “I Will Teach You To Be Rich”, I thought there are only two ways to finance your budget - cash or debit card."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Getting started is more important than becoming an expert”</i> - <b>Ramit Sethi</b>"
        },
        {
            "tag": "p",
            "html": "Never imagined a scenario where people are paying for their food with a credit card but that could be a good thing if you are disciplined enough."
        },
        {
            "tag": "p",
            "html": "There is a third way – Paying using credit card according to Ramit Sethi and I completely agree."
        },
        {
            "tag": "p",
            "html": "In all the developed nations, credit cards are most widely used. Majority of the financial advisers will want you to cut your credit card and throw it away."
        },
        {
            "tag": "p",
            "html": "We know the disadvantages of using a credit card."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Highest Interest Rates – 18% annually.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Fuels unnecessary consumption.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Buying the things you cannot afford.</p></div>"
        },
        {
            "tag": "p",
            "html": "But there are advantages of using a Credit Card as well."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Build a Credit Score (Example – FICO).</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Flight and Hotel points on Credit Card.</p></div>"
        },
        {
            "tag": "p",
            "html": "To take advantage of these aspects of the credit card benefits one has to be extremely disciplined to only spend the money which you can repay the same month in full."
        },
        {
            "tag": "p",
            "html": "When you repay everything you borrowed using your credit card the same month or during the start of the next month, you will essentially wipe out any possibility of charging you for the money borrowed."
        },
        {
            "tag": "p",
            "html": "Credit card companies charge you on a per month basis. It is the worst mistake of your life if you have a credit card with debt racked up which you could never imagine to repay in the next few years."
        },
        {
            "tag": "p",
            "html": "Never pay the minimum on your credit card. Pay as much as you can and finish off the debt."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Debt is bad; Credit Card is not.”</i>"
        },
        {
            "tag": "p",
            "html": "Just like the quote “Money is only a means to an end”, credit card is also a means to an end."
        },
        {
            "tag": "h3",
            "html": "Do I Need a Credit Card?"
        },
        {
            "tag": "p",
            "html": "In the developed nations where credit scores play a more important role in the economy to facilitate a car loan, yes, it plays a major role but only for those who want to build a credit score to get a loan for buying a financial security or to invest and make more money."
        },
        {
            "tag": "p",
            "html": "If you really love the concept of loyalty points and flight points, spending with your credit card is the way to go."
        },
        {
            "tag": "p",
            "html": "If you are disciplined enough to repay your credit card debts on time every month, maybe it is not a bad idea to have a credit card but my advice would be to stick with just one."
        },
        {
            "tag": "p",
            "html": "Usually, one credit card is more than enough to build your credit score, flight point & hotel points."
        },
        {
            "tag": "h3",
            "html": "Danger"
        },
        {
            "tag": "p",
            "html": "Honestly, Beware of the dangers of being addicted to spending on credit card. It’s a trap to lure you into getting a credit card."
        },
        {
            "tag": "p",
            "html": "The credit card companies all know that the majority of the people who get a credit card want to pay them on time and get it with all the right intentions to pay them on time but they eventually end up paying late."
        },
        {
            "tag": "p",
            "html": "Beware of the late payment fees. They are usually high, unexpected and will hit you hard."
        },
        {
            "tag": "p",
            "html": "Late payment fees are bad enough. What if you keep paying late and keep paying the minimum on the credit card and eventually max out your credit card?"
        },
        {
            "tag": "p",
            "html": "When we get used to credit cards that’s when we start taking it a little bit for granted and start paying a little late, start buying unnecessary consumables and buying things that you really can’t afford."
        },
        {
            "tag": "p",
            "html": "To prevent that from happening, always remember to have a clear budget on the credit card. Have the money in your bank account and spend the allocated equivalent amount on your credit card."
        },
        {
            "tag": "p",
            "html": "You could spend all your food budget on the credit card and repay the entire amount on the day you pay your credit card bills."
        },
        {
            "tag": "p",
            "html": "That would be the perfect scenario but just like using a debit card for budgeting, the disadvantage remains the same."
        },
        {
            "tag": "p",
            "html": "We cannot stick precisely to the budget while paying by card."
        },
        {
            "tag": "p",
            "html": "Imagine you set $100 to spend per week for food and groceries. If you pay by card, at first we borrow from the next week’s budget then we slowly start to borrow from the next month's budget."
        },
        {
            "tag": "p",
            "html": "Then we will no longer be able to pay for food and groceries with the allotted budget as it will always be less than what you actually spend."
        },
        {
            "tag": "p",
            "html": "If it is a debit card you will not be able to spend the money if you do not have money. But if it is a credit card you will be able to borrow money at a ridiculous rate of 18% per year."
        },
        {
            "tag": "p",
            "html": "The best form of payment for keeping your budget is CASH."
        },
        {
            "tag": "h3",
            "html": "CASH IS STILL THE KING!"
        },
        {
            "tag": "p",
            "html": "If a credit card is a bad tool to be used for spending on budget and repaying the borrowed amount immediately, then we are talking about having no credit score."
        },
        {
            "tag": "p",
            "html": "If one does not have any credit score then you will not be granted any loan or probably a minimum loan amount."
        },
        {
            "tag": "p",
            "html": "But you only need a credit score if you are planning to be in debt for something in the near or far future."
        },
        {
            "tag": "p",
            "html": "Flight points and hotel points may seem appealing to everyone, especially when it comes for free but the danger of using a credit card still remains. It is important to treat credit card with respect as it is as dangerous and addictive as it is attractive."
        },
        {
            "tag": "p",
            "html": "You can give up on ever having a credit score and wanting to earn flight points and hotel points. That’s the best course of action for the feeble heart."
        },
        {
            "tag": "p",
            "html": "If you are in a developing nation and the concept of credit score and earning loyalty points, reward points are nonexistent then forget about owning a credit card. There are better ways to live than to own a credit card."
        }
    ]
}