{
    "url": "/personal-finance/find-what-drives-you-to-achieve/",
    "title": "Find what Drives you to Achieve?",
    "image": "/img/personal-finance/find-what-drives-you-to-achieve.jpg",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "p",
            "html": "Let’s find out what drives us to achieve. A good number of people do the jobs they do not love to earn the riches they desire. If you have just enough determination, passion and desire to achieve and consistently outperform, financial success will be the byproduct. But we all know the person who works for more than 10 hours a day."
        },
        {
            "tag": "p",
            "html": "There are two perspectives to look at it. Either they are not efficient at finishing the work within the stipulated time or they are extremely good at what they do. Hence the manager prefers the hard worker to do the heavy lifting. The former might get fired and later might get to stay in the same position for years. What? Being extremely efficient is not enough to prosper? The fact is that the employee is more valuable to the business where he is. So how to prosper at work/business? Become an outlier!"
        },
        {
            "tag": "h3",
            "html": "Outliers"
        },
        {
            "tag": "p",
            "html": "“Outliers: The Story of Success” by Malcolm Gladwell holds the some of the answers we need to find our drive. Malcolm analyses the success of Bill Gates and the rock band Beatles. The ability to gain 10,000 hours of practice at a very young age when the computers could only be found in universities is what led Bill Gates to success."
        },
        {
            "tag": "p",
            "html": "Apart from intelligence, talent also plays a role in the success many people hold. The key point here is the determination and the motivation to learn is what lead Bill Gates to gain the 10,000 hours of practice at a very young age."
        },
        {
            "tag": "p",
            "html": "It takes approximately a decade to gain the practice time mentioned above. Do you have the determination and the drive to do what you love and stay on course for a decade to start becoming an outlier?"
        },
        {
            "tag": "h3",
            "html": "Passion"
        },
        {
            "tag": "p",
            "html": "What is the job that you would love to do? The one thing which makes you look forward to tomorrow. Have you ever jumped out of the bed the next day morning looking forward to doing something? What is that? That’s one of the things you are really passionate about."
        },
        {
            "tag": "p",
            "html": "To become truly successful never do anything just for money; do it with love. Find the career which you are passionate about."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“You need passion to overcome obstacles and setbacks in life”</i> - <b>Think Big and Kick Ass” by Donald Trump and Bill Zanker</b>. "
        },
        {
            "tag": "p",
            "html": "Do what you love most; do it till you get 10,000 hours of practice. Provide value along the way. After all being passionate about playing video games is not providing value to others."
        },
        {
            "tag": "p",
            "html": "The ability to monetize on your passion is a skill to master. <b>Be valuable to others in a field which you are passionate about with more than 10,000 hours of practice and people will die to work with you or be your customer.</b>"
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“The only person you are destined to become is the person you decide to be.”</i> - <b>Ralph Waldo Emerson</b>. "
        },
        {
            "tag": "h3",
            "html": "Value"
        },
        {
            "tag": "p",
            "html": "Become more valuable to others. Providing value is at the core of being successful.  Do 100% of your current job and 50% of your boss’ job to grow to the next level in your career."
        },
        {
            "tag": "p",
            "html": "What do I do if I am running a business? Be more valuable to others than anyone in your field. Provide more in usage value to others. Be the best in your field. Constantly strive to provide value."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Strive not to be a success but rather to be of value”</i> - <b>Albert Einstein</b>. "
        },
        {
            "tag": "h3",
            "html": "Desires of a Laptop Technician"
        },
        {
            "tag": "p",
            "html": "In India, sometimes we do not get what we want in our lives. I always wanted to be a software engineer. Back in 2008, during my high school, I was really good at computer science. I would often solve all the problems proposed by the teacher and would always rank first in the exams."
        },
        {
            "tag": "p",
            "html": "We were given an opportunity to choose our university degrees. I wanted to take B.E in IT and was pretty stern about it. My parents thought that enrolling me in  B.E Electronics and Communications Engineering would be a better option! Yes! Such things happen in India; I am not sure where else but definitely in India."
        },
        {
            "tag": "p",
            "html": "My parent's arguments were that choosing ECE would broaden my horizons and possibilities of landing  at a lucrative job after graduation. They were right. I was offered a job at Cognizant Technology Solutions. It was a dream for me. I always wanted to work for CTS and was planning on joining it. I thought my life was settled. An uncle of mine is working for CTS for the past 16 years. Who could ask for something more right? I did."
        },
        {
            "tag": "p",
            "html": "After getting an offer letter from CTS which I was eagerly waiting for since my first year in college and after attaining the goal, the fun was finally over. I wanted more; so I applied for masters in the UK and got that too."
        },
        {
            "tag": "p",
            "html": "Why did I apply? I wanted to see the other end of the world and know what’s out there! The initial visa for the education in the UK is one year and four months. I loved the change in the culture and the freedom which the UK had offered. By all means, I considered myself a successful graduate.  All of my friends except a handful have flunked and have returned to their home countries."
        },
        {
            "tag": "p",
            "html": "My visa was due to expire in the next few months. I wanted more of UK; so I applied for an MBA course in London; I had no intention of completing it. It was supposed to provide me with enough time to search for a job in the UK. Meanwhile I got a fulltime job as a laptop technician in Coventry."
        },
        {
            "tag": "p",
            "html": "Staying in the UK and experiencing the newly obtained freedom had obstructed my vision spectacularly. I wasted more than 8 months searching for a job while also being a laptop technician."
        },
        {
            "tag": "p",
            "html": "I had all the right intentions to do my best as a laptop technician in Coventry but my heart was always towards obtaining a corporate job as a control systems engineer or better a software engineer."
        },
        {
            "tag": "p",
            "html": "This prevented me from being the best expression of myself as a laptop technician. Even though I thought I was doing the best, I could hardly satisfy the owner. During the six months, I topped up once to a wrong number for a customer costing the company £20."
        },
        {
            "tag": "p",
            "html": "To put it into perspective, it was half of my daily income, then. I proved to be an expensive bargain for the mobile shop. So, they had to let me go after 6 months. I truly felt that I was not worthy of obtaining a corporate job. If I cannot work and satisfy a mobile shop owner, how could I truly satisfy a multinational company?"
        },
        {
            "tag": "p",
            "html": "Later, I was offered another Graduate Software Engineer job in Kings Lynn. Just what I wanted. So, I borrowed a total sum of £1500 from my parents to migrate from Coventry to Kings Lynn."
        },
        {
            "tag": "p",
            "html": "Life suddenly became colorful. I was motivated to do whatever best I could do and to be my best. For the first few months, the company wanted me to be in the production line, actually manufacturing the product."
        },
        {
            "tag": "p",
            "html": "I gladly accepted it. All, I wanted was a job and honestly if I can be a graduate software engineer it did not matter. They knew very well that I just graduated from the university and did not have any experience as a software engineer."
        },
        {
            "tag": "p",
            "html": "I proved to be too expensive for the company as the company could hire the same talent for 30% less salary. The UK would not allow me to be hired for such a low salary as it is a prerequisite to obtain my visa. So, I had to be let go off!"
        },
        {
            "tag": "p",
            "html": "“Don’t ask me, didn’t the company already know?” I was either too naive or they utilized me big time. I paid for the visa; I paid for migrating the house. Honestly, they had nothing to lose."
        },
        {
            "tag": "p",
            "html": "“I got fired again! Wow! I am truly unworthy”. I convinced myself that the UK did not want me there. So, I had booked a one-way ticket to India. I did not want to waste another 8 months looking for a job and waste my parent's money."
        },
        {
            "tag": "p",
            "html": "After finding a job in India, I wanted to be valuable to the organization. The company took me as an unpaid intern. So, I learned different programming languages during my training. Finally, I thought of myself as worthy of working in a software industry since I was starting to get ahold of what programming actually is. Just then, the company with which I was working became bankrupt and everyone in the company was let go!"
        },
        {
            "tag": "p",
            "html": "Fantastic! The world is conspiring against me. Why can’t I hold a job for more than a year?"
        },
        {
            "tag": "p",
            "html": "Lessons learned so far: "
        },
        {
            "tag": "p",
            "html": "<b>If you work for a company just for money, you will never be able to be the best expression of yourself</b>. You will be fired for underperformance. You will also be unhappy while working there."
        },
        {
            "tag": "p",
            "html": "<b>If you are overpaid for your underperformance, you will become too expensive for the company</b> and they would have to let you go; even if it is the only job which you wanted all your life. Unless you are valuable and be more valuable than what they are actually paying you. You are not worthy!"
        },
        {
            "tag": "p",
            "html": "<b>Even after you become valuable, the world could conspire against you</b> and throw you to trash. Don't think the world has ended!"
        },
        {
            "tag": "p",
            "html": "All these were the best things that could ever have happened to me. They were the most valuable lessons which life could teach me."
        },
        {
            "tag": "p",
            "html": "If I am not worthy, no company would keep me there. I would be fired immediately. So, I constantly strive to learn and be on top of all the technologies."
        },
        {
            "tag": "p",
            "html": "I always ensure that my manager is happy with my performance and strive to improve and deliver better."
        }
    ]
}