{
    "url": "/psychology/pursuit-of-problem-solving/",
    "title": "Pursuit of Problem Solving?",
    "image": "/img/psychology/pursuit-of-problem-solving.jpg",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Psychology",
            "crumbUrl": "/psychology/"
        }
    ],
    "content": [
        {
            "tag": "p",
            "html": "The mere fact that we are focusing on something and the limitation that it imposes on us ensures that other problems might arise out of this lack of focus on other aspects which also require your attention."
        },
        {
            "tag": "p",
            "html": "As a person, you might have N number of responsibilities to be in pursuit of. These responsibilities might be the battle that you chose and they might be equally important to you. That does not mean that we can focus on multiple things at the same time."
        },
        {
            "tag": "p",
            "html": "When I was studying during college multitasking was a thing. The ability to do multiple things at the same time. I was so into it and also proud of it that in my 6th semester I was watching the lord of the rings series and studying for an exam. It was typical that we had 2 - 3 days of holidays before an exam. They were tough. Guess what! I failed and had to rewrite it the next semester to pass it. I never did that again! Ever!"
        },
        {
            "tag": "p",
            "html": "Given that limitation, all I did was accept that I order to do a task in its fullness. We are obliged to give it 100% of our attention and this attention is what solves the problem that we chose to attend to."
        },
        {
            "tag": "p",
            "html": "Now I might put my headphones on with some music while writing this blog but it can hardly be categorized as multi-tasking. I know now that right now getting things off my mind is more important to facilitate me to focus on other things later on which might require its due attention. It just helps me focus and get the thoughts flowing. That way I guess that it would leave you with something more to take away from this blog than what you came with."
        },
        {
            "tag": "p",
            "html": "Imagine what happens to people who have no responsibility and would like to not take any responsibility consciously. Most of the men play games right? Isn’t that problem-solving in some sense? They enter a hypothetical world in which a problem is posed in front of them with limitations and the harsher the limitations, the better the game. You train yourself more and more in this virtual world and become a gamer. It might as well be because the real world rejected them or that everything that you connect or can connect is online in that game."
        },
        {
            "tag": "p",
            "html": "That would be the fundamental lack of taking real-world responsibilities but we are not talking about people who live a meaningless life spending years playing games without advancing in the real world. They would inevitably suffer when life gets to them. That day they might realize and be shocked at what they have become by comparing themselves with other people who are in a much better position than they are."
        },
        {
            "tag": "p",
            "html": "It might take years of hard work to get to a decent level but what is lost is lost. They can match up to the people who have chosen to work from the earliest possible day and try to achieve what they thought was necessary. Those are the people who have more responsibility and focus to solve one at a time by paying as much attention it deserves and as long as it takes to solve them."
        },
        {
            "tag": "p",
            "html": "After shouldering the burden of responsibility they might discover that they are in a better place than they started but still far away from where they want to be and a little off from where they need to be. Their focus needs to change a little, they might need to put in a little more work towards the new direction and start from where they are now. But overall there is satisfaction with what they have achieved like finishing a game and feeling accomplished. However, it is ever fleeing so we focus on other issues to resolve."
        },
        {
            "tag": "p",
            "html": "In reality, it is not the pursuit of happiness it is a pursuit that makes us happy even if we do not reach where we need to be. It is our responsibility to keep playing but not a necessity to finish it. That is what makes our life eternally meaningful. A life worth living, a task worth paying attention to, a place worth visiting, a future worth conquering."
        },
        {
            "tag": "p",
            "html": "Stay sane, pay attention to what needs to be paid attention to, and hopefully you will reach there one day or not! But keep smiling and try!"
        }
    ]
}