{
    "url": "/personal-finance/savings-management-strategy/",
    "title": "Savings Management Strategy",
    "image": "/img/personal-finance/savings-management-strategy.jpg",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "p",
            "html": "Savings management strategy is by far the simplest yet hard to implement amongst all the strategies. It demands that you change your mentality and destroy the previously held notions of money."
        },
        {
            "tag": "p",
            "html": "It is like executing a demonetization if necessary to your own personal finance. Remove all the money held in the wrong hands and put it back to where the money originally belongs!"
        },
        {
            "tag": "p",
            "html": "The habit of being frugal has to be developed in the place of lavish spending."
        },
        {
            "tag": "p",
            "html": "The savings strategy is simple. Check if you have 12 months of your monthly income as savings. If not, continue to invest all of your savings to repopulate your emergency fund."
        },
        {
            "tag": "p",
            "html": "If not, segregate your savings into four different strategies."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Savings to spend</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Short-Term Investment</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Mid-Term Investment</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">4</div><div class=\"copy-container\"><p class=\"description mb-3\">Long-Term Investment</p></div>"
        },
        {
            "tag": "p",
            "html": "You need to evaluate what you really want to be in life, not today but in the future. It demands that you know what you are doing now and where you financially are. Without a clear purpose for your money, you are bound to fail miserably."
        },
        {
            "tag": "h3",
            "html": "Saving to Spend"
        },
        {
            "tag": "p",
            "html": "The least preferable mode of saving compared to others. If you would like to buy an iPhone X for example, this is the bucket you are looking for."
        },
        {
            "tag": "p",
            "html": "All the expenses in this budget have to be reduced as much as possible. Do you really need an iPhone X? Can you settle for an iPhone 6 and would it serve the emotional purpose you are looking for?"
        },
        {
            "tag": "p",
            "html": "Most people buy an iPhone for prestige and the respect. Can you make sure that the iPhone is not stolen? Do your friends have the same phone? Do they feel jealous of you?"
        },
        {
            "tag": "p",
            "html": "My girlfriend was traveling from Mumbai to Kochi when the security inspection officer took her iPhone 6 (gold) to have a look. Nobody does that at the airport. It clearly signifies his intent. He likes it and would like to have it. I was not there myself as I was traveling to Chennai from Mumbai."
        },
        {
            "tag": "p",
            "html": "She forced the security inspection officer to return the phone by simply not allowing other passengers to pass her. She has to shout at the security officer to get it back. Yes! Actually, shout at them. When the passengers asked what happened, she conveyed the situation to other passengers and hence the security inspection officer returned the mobile back to my girlfriend."
        },
        {
            "tag": "p",
            "html": "How many of your friends are visibly greedy about other people's possessions?"
        },
        {
            "tag": "h3",
            "html": "Short Term Investment"
        },
        {
            "tag": "p",
            "html": "Short-term investment vessel includes your car as well. Car is a depreciating asset but you could put the money in a fixed deposit till you accumulate an adequate amount in order to buy a car.  The last thing which you should be doing is to buy a car on a loan."
        },
        {
            "tag": "p",
            "html": "Save your allocated budget as a recurring deposit if you are in India or in a fixed deposit. Keep it safe and risk-free."
        },
        {
            "tag": "p",
            "html": "Short-term investment vessels are generally very risky.  For example, Bitcoin investment in the wake of 2017. Bitcoins’ stocks soared from $1000 by more than 1300% to $14,500 by the end of the year."
        },
        {
            "tag": "p",
            "html": "What happened the next year? It is hovering somewhere in the $6900 range now."
        },
        {
            "tag": "p",
            "html": "Short-term investments are risky! There is no doubt about it."
        },
        {
            "tag": "p",
            "html": "Stock market investments are meant to be for long-term for a normal investor like you and me."
        },
        {
            "tag": "p",
            "html": "Any short-term gamble might take a turn for the worse and you may not even know until after it hits you."
        },
        {
            "tag": "p",
            "html": "So better stick with fixed deposits, recurring deposits, and any risk-free low-interest investment vessels."
        },
        {
            "tag": "h3",
            "html": "Mid Term Investments"
        },
        {
            "tag": "p",
            "html": "A mid-term investment could be for your children's college education or any obligation which you can foresee 15 years ahead."
        },
        {
            "tag": "p",
            "html": "Be covered for such an event; they are going to graduate no matter what. Graduation is the minimum requirement nowadays and educational expenses are soaring year by year."
        },
        {
            "tag": "p",
            "html": "Do not let your children accumulate debt for education. It is the one essential thing in life which you could sponsor."
        },
        {
            "tag": "p",
            "html": "A mid-term investment vessel in India could be a PPF. A public provident fund which offers an attractive interest rate of 7.6% and all the income deposited in it is tax-free. You could deposit a maximum of ₹150,000 into your PPF fund. There could be a maximum of 1 PPF account for a working individual."
        },
        {
            "tag": "p",
            "html": "Other mid-term options include bonds, structured notes, annuity plans, real estate investment trusts, individual stocks and index funds."
        },
        {
            "tag": "p",
            "html": "Based on your risk tolerance, you could choose one investment and periodically invest in that particular fund."
        },
        {
            "tag": "h3",
            "html": "Long Term Investments"
        },
        {
            "tag": "p",
            "html": "The long-term investment must include your retirement. It is a must-have!"
        },
        {
            "tag": "p",
            "html": "You are not going to be able to work one day or the other. You need to be covered for that. If you are procrastinating, think about the after retirement days where you have to rely on your children's ability to sponsor your livelihood, forcing them to pay for your medical expenses and having to rely on their income to buy medicine which could determine if you live a pain-free life."
        },
        {
            "tag": "p",
            "html": "Every part of your body might ache and you would no longer have the energy and mobility to earn as you did when you were in your 20’s."
        },
        {
            "tag": "p",
            "html": "This should motivate you to keep saving no matter what for your retirement. Later, we will discuss how time plays a role in your retirement lifestyle."
        },
        {
            "tag": "p",
            "html": "If you choose to invest early for your retirement it could make a difference between retiring & not reducing your lifestyle and retiring & reducing your lifestyle to a bare minimum."
        },
        {
            "tag": "p",
            "html": "Generally, India has Employee Provident Fund(EPF) which serves as a retirement pension for employees. All the income deposited in the EPF is tax-free and grows at a steady rate. The amount could be withdrawn after retirement, or in the event of sudden death of the EPF account holder and a part of the money can be withdrawn for marriage expenses as well."
        },
        {
            "tag": "p",
            "html": "Other ideal long-term investment vessels include index funds, tax savings bond, real estate investments, structured notes and annuity plans."
        },
        {
            "tag": "p",
            "html": "All the savings strategy always has a purpose right? - Buying a car, saving for your retirement or sponsoring your children’s education. Why is that? Other personal financial books speak about asset allocation without touching these aspects of your everyday life."
        },
        {
            "tag": "p",
            "html": "Are they complete? When I say allocate a 30% of your savings to fixed deposit, another 30% to Index Fund (VFINX) through a non taxable account such as Roth IRA in the US / directly to EPF in India while making sure that the last 40% of your savings should be split as 30% and 10% in which 30% goes towards government inflation protected bonds and the last 10% should be invested in the purchase of stocks which deals with commodity/gold."
        },
        {
            "tag": "p",
            "html": "Does it sound appealing to you? It does not to me. Asset allocation based on the investment vessel lacks emotion. It is for the ultra rich who choose to balance the risk vs reward. It means nothing to us."
        },
        {
            "tag": "p",
            "html": "All of the above mentioned stocks have to be purchased using the dollar cost averaging strategy. You put in a set amount of money every month into the purchase of the stock. We have to use the power of compounding to our advantage. Slowly, but steadily our investments would rise, giving it a strong meaning and purpose like retirement savings, emergency savings and home purchase fund will provide you with a strong reason to keep pushing yourself to save more, earn more and invest more as the first million is the hardest."
        },
        {
            "tag": "h3",
            "html": "The Friend who lost his lifetime savings"
        },
        {
            "tag": "p",
            "html": "Remember my friend who outsourced his personal finance to his uncle? Let’s continue talking about him."
        },
        {
            "tag": "p",
            "html": "He seemed a bit motivated about buying a home for himself. I do not know where he got the motivation from. Being curious about his financial situation, I asked him how he is willing to buy it and will he be taking a home loan."
        },
        {
            "tag": "p",
            "html": "He told me that his family had a life savings of ₹3,000,000 in a fixed deposit and that he and his family are willing to utilize two third of the money plus another ₹1,000,000 which my friend had saved up after working in Spain."
        },
        {
            "tag": "p",
            "html": "I was really happy for him. We left the conversation hanging and I thought he was looking for a good property for sale. After a few months, we were having a pretty deep conversation about his personal financial situation. It was about 6 hours long during which he revealed that his family's life savings of ₹3,000,000 was handed over to his uncle for safe keeping. A fixed deposit was jointly opened to save the ₹3,000,000. The joint account holders were his uncle and his mother."
        },
        {
            "tag": "p",
            "html": "The handling of the account was left to the wills and fancies of his uncle."
        },
        {
            "tag": "p",
            "html": "His uncle had informed my friend of his act of taking an overdraft from the fixed deposit for about ₹1,200,000 and that he intended to repay the amount in a few months."
        },
        {
            "tag": "p",
            "html": "My friends' mother was fully aware that the fixed deposit was expiring by May 2018, after which his mother promptly requested for the money back. He somehow convinced his mother of his intentions to repay the money in the coming few months and in fact, he had withdrawn ₹1,800,000."
        },
        {
            "tag": "p",
            "html": "When they asked for the remaining amount to be repaid, he had no intention to repay the remaining ₹1,200,000 and is intentionally postponing the repayment. Once his mother had forced an answer from his uncle he replied: “Let me remortgage my only home and go to the streets. But don’t worry; I shall repay the amount with the mortgage”"
        },
        {
            "tag": "p",
            "html": "I have to say at this point that his uncle was of much help to my friends family when they needed it most. He had sponsored four years of his high school education and his sister's education. He also sponsored an operation for his mother and honestly my friends family had no money to pay for the operation back then. All these would financially account for about ₹500,000."
        },
        {
            "tag": "p",
            "html": "I convinced my friend that his uncle had utilized all the money for sure and he had no intention of repaying the money back."
        },
        {
            "tag": "p",
            "html": "I also remember that his uncle wanted my friend to invest in Bitcoins in the wake of the new year 2018 and I promptly informed my friend not to as it would prove to be a dire mistake."
        },
        {
            "tag": "p",
            "html": "He also informed me that his uncle is investing in bitcoins because he thinks it is the hot new investment. During this six hours conversation which we had recently, he said: “the bitcoin investment which my uncle made was a loss, A total loss of ₹500,000 and all the money used to invest was from my family’s fixed deposit”."
        },
        {
            "tag": "p",
            "html": "“Wow” was the word which came to my mind. He continued “He also took all of my mother’s gold. All of our 30 sovereigns of it including my mother’s thali and it was five years ago. He still did not return an ounce of gold which he borrowed ”."
        },
        {
            "tag": "p",
            "html": "Thali is the equivalent of a wedding ring in European countries. The validity of the marriage is stored in the form of a symbol “Thali” and the emotions around it are so strong."
        },
        {
            "tag": "p",
            "html": "For a married woman to donate it for the sake of his brother is a true act of love & trust."
        },
        {
            "tag": "p",
            "html": "That was all of their families wealth. Everything! They live in a rented apartment in the town and his father earns just enough to cover all their families expenses. His mother, being frustrated as she is, kept asking his brother for at least the thali. So far! No luck."
        },
        {
            "tag": "p",
            "html": "Just recently, his mother started asking my friend to buy a thali for her. He was in the hope that his brother might return the thali back to his mom. He asked for my suggestion. What would you tell him?"
        },
        {
            "tag": "p",
            "html": "I needed more answers before giving him a reply. I asked him if his mom's opinion about her brother had changed! After all this, it does make complete sense to hate a person right? Wrong."
        },
        {
            "tag": "p",
            "html": "Apparently, his mother is still hesitant to even ask what is rightfully theirs. She still believes that he will return everything which he borrowed. She still trusts him. I don’t blame her. He doesn’t either."
        },
        {
            "tag": "p",
            "html": "His sister is also too hesitant to question her uncle. What would a rational human being do? My friend had all the right to be angry at his uncle. It has been close to a year since he stopped speaking to his uncle."
        },
        {
            "tag": "p",
            "html": "I asked him “Not to buy the thali‘. Cruel me! I had a good reason. Being denied her thali is the only way she could realize the true face of her own brother. Seeing the missing thali will remind her of the trustworthiness of her brother."
        },
        {
            "tag": "p",
            "html": "What happens if my friend buys a thali for his own mother whom he loves. His mother will continue to trust her brother as before always as if nothing has changed while her brother could continue to take full financial advantage of her."
        },
        {
            "tag": "p",
            "html": "My friend's sister is a chartered account and she knows what has been happening as well. She is just too afraid to speak up. My friend is in Spain. What could he possibly do from 8000 km away which his mother and sister cannot possibly do?"
        },
        {
            "tag": "p",
            "html": "My friend still believes that he will get the money back from his uncle. So, I had to dig in deeper. No matter how ugly the truth is. My friend was willing to know it after all “Trust has to be earned”."
        },
        {
            "tag": "p",
            "html": "So, I started asking him questions about his uncle. How much does he earn every month? How is he earning them? What are his assets?"
        },
        {
            "tag": "p",
            "html": "Thinking deeply, my friend replied “He might be earning about ₹10,000 every month. Definitely not more than that! He is currently running a business which acts as a middleman between the customer and the government to obtain any certificate or document from the government ASAP”."
        },
        {
            "tag": "p",
            "html": "To shed some light upon the truth, I continued “In other words, It would take your uncle approximately 25 years to accumulate the sum of ₹3,000,000 even if he saved all of the income generated from his business?”. I never mentioned about the inflation and the reduction of purchase power of the ₹3,000,000, 25 years later but he got the picture."
        },
        {
            "tag": "p",
            "html": "He replied “Hmm….”. Now he was starting to lose hope in ever getting the money back. The idea of his buying a home for his family was starting to fade away. He started to worry about his financial situation for the first time probably in his lifetime. His dreams shattered! He started to get ahold of himself. I could see the pain in his eyes. It deeply saddened me to have done this to him. It was at times like these that I remember “It is sometimes better to let a man live in his dreams, not revealing the truth if you know he is happy there‘."
        },
        {
            "tag": "p",
            "html": "It was too late for me now. I had to end what I had started. So I continued “including the 30 sovereigns of gold which your uncle has borrowed the sum is ₹3,700,000 which would take your uncle about 30 years to repay and just to return the thali, your uncle needs to save all of his income for 10 months straight”."
        },
        {
            "tag": "p",
            "html": "It would cost around ₹100,000 to buy a new thali for my friend's mother but his mother was eagerly waiting for his brother to provide her with the means to buy a new thali and my friend was also believing the same till then. I shattered it again!"
        },
        {
            "tag": "p",
            "html": "His uncle was known for his lavish spending. Later, my friend also told me that he is now starting to suspect that his uncle had used a part of the money which his mom gave for safekeeping to renew the house where he lived which cost about ₹1,100,000. “It was a couple of years ago when my uncle renewed his home. He never muttered a word about the overdraft on the joint fixed deposit then. They deposited it 3 years ago and he clearly had access to those funds” my friend continued."
        },
        {
            "tag": "p",
            "html": "The total spending accounted for about ₹1,600,000. But it still didn’t account for the remaining amount. His uncle also mentioned that he has spent a total of ₹1,800,000 and the remaining ₹200,000 was loaned to one of his friends and he was expecting it to be returned in a few months."
        },
        {
            "tag": "p",
            "html": "I asked my friend to ask his uncle to return all the remaining money, whatever he has left of the fixed deposit. He is yet to get a penny from his uncle."
        },
        {
            "tag": "p",
            "html": "The real cost of not taking control of your financial life! My friend is now starting to take control of his finances. Although the future may seem bleak, he trusts that he could make a difference. He is puffing up his emergency fund now and has a clear road ahead."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Save for emergencies</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Buy a home</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Sponsor his sister's marriage</p></div>"
        },
        {
            "tag": "p",
            "html": "That’s a good start. It would cost him close to ₹7,000,000 at the least to make this happen. I am confident that he would be able to do it."
        },
        {
            "tag": "p",
            "html": "What's your purpose of saving? Without it, don’t bother saving. <b>A purpose backed by strong emotion will push you to succeed in all aspects of your life</b>."
        }
    ]
}