{
    "url": "/personal-finance/investing-in-mutual-funds/",
    "title": "Investing in Mutual Funds",
    "image": "/img/personal-finance/investing-in-mutual-funds.jpg",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "p",
            "html": "Mutual funds also known as actively managed funds are the most sorted out forms of investments by the public."
        },
        {
            "tag": "p",
            "html": "The general interest towards the mutual fund being “You do not know the rules of investing in a mutual fund; let the professionals take care of your money and we will beat the market.”"
        },
        {
            "tag": "p",
            "html": "Mutual funds are managed by a professional investor for the profit of the organization he is working under and not for the clients who invest the money with them."
        },
        {
            "tag": "p",
            "html": "While choosing a mutual fund, we usually choose the best performing funds. Out of all, Morningstar provides a reasonable estimate of the best performing fund for the current year by segregating them in stars, 5-star funds being the best performing and 1-star funds being the worst performing."
        },
        {
            "tag": "p",
            "html": "This estimate cannot be reliably predicted for long-term performance of a mutual fund because the mutual funds fail in the long term and do not beat the market returns in the short term. Check out “Common sense on mutual fund investing” by John C Bogle for more information."
        },
        {
            "tag": "p",
            "html": "According to Bogle, the expense ratio is not a reliable estimate to predict the cost of a mutual fund as there are hidden costs Involved. The total costs involved in mutual fund investing are:"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Marketing Costs</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Tax costs</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Planned administration cost</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">4</div><div class=\"copy-container\"><p class=\"description mb-3\">Cash Drag</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">5</div><div class=\"copy-container\"><p class=\"description mb-3\">Redemption Fees</p></div>"
        },
        {
            "tag": "p",
            "html": "Generally, the cost of the fund is more than 2% and as high as 4% of the potential returns."
        },
        {
            "tag": "p",
            "html": "They generally charge you even if the investment fails to perform."
        },
        {
            "tag": "p",
            "html": "The best argument against the mutual fund is from Tony Robbins book, “Money - Master the Game”."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">48% of the actively managed fund managers in the US do not invest in their money themselves. They would do so if they believe that their funds perform well.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">The investors deem as a suitable investment. Do you ever settle for something that is suitable in life? like a suitable house, suitable meal?</p></div>"
        },
        {
            "tag": "p",
            "html": "The mutual funds are often suggested by financial advisers. They often do receive a percentage of your investment capital as commission. Never go through a financial adviser. As going through them will often include brokerage fees. They are included in the mutual fund costs."
        },
        {
            "tag": "h3",
            "html": "Why have People Invested in Mutual Funds"
        },
        {
            "tag": "p",
            "html": "In the US, Mutual funds are tied to retirement savings (401K). They are often the most sorted investments in India as well by some sectors of the society often due to lack of knowledge on the hidden cost and the underperformance of the funds."
        },
        {
            "tag": "p",
            "html": "People often go with the majority and start to buy stocks when the emotions and hopes are high in the market. That is when the mutual funds cost more to buy."
        },
        {
            "tag": "p",
            "html": "They often sell the mutual fund holdings within the year due to low performance. The chase for performance in this era is never ending and the only person who is bound to lose is the person who is investing."
        },
        {
            "tag": "p",
            "html": "It’s not called investing when you buy high and sell low. It’s expecting and speculating."
        },
        {
            "tag": "p",
            "html": "Do you ever buy a commodity for $2 and plan to sell it for $1 with the intention of making a profit?"
        },
        {
            "tag": "p",
            "html": "Isn’t that what majority of the people do when they buy and sell the stocks?"
        },
        {
            "tag": "h3",
            "html": "What about Others who Save for the Retirement with the Mutual Funds?"
        },
        {
            "tag": "p",
            "html": "The first question involved is how much are you paying in costs to the mutual funds?"
        },
        {
            "tag": "p",
            "html": "Did you know that there are options to pay the tax on the mutual funds before and let the money raise tax free in the US and in India?"
        },
        {
            "tag": "p",
            "html": "The retirement account will have a stunted growth due to the payment of costs. Costs cannot be taken lightly as 2- 4% of the cost can account for more than 70% of your potential earning for the retirement account."
        },
        {
            "tag": "img",
            "classInfo": "article-image",
            "srcUrl": "/img/personal-finance/sandp-five-hundred-returns.jpg"
        },
        {
            "tag": "p",
            "html": "The performance of the market is illustrated in the above mentioned graph. The total percentage of growth every year for S&P 500 Total Return is 11.37 percentage from 1988 to 2017."
        },
        {
            "tag": "p",
            "html": "If you had bought one share of S&P 500 Total Return in 1988 for 276.856 dollars, the invested capital would have become 4689.608 dollars, a growth rate of 1593.87% for a 30 year period from 1988 to 2017 assuming that you reinvest all the dividends earned."
        },
        {
            "tag": "img",
            "classInfo": "article-image",
            "srcUrl": "/img/personal-finance/inflation-chart.jpg"
        },
        {
            "tag": "p",
            "html": "The graph above mentions the inflation in the United States and India between 1988 to 2017 calculated by Consumer Price index formula. The United States inflation is much more contained at 78% for the period of 30 years when compared to other developing nations. In other words, the value of 1 dollar in 1988 is $1.78 in 2017."
        },
        {
            "tag": "p",
            "html": "The gain of 1593.87% of S&P 500 Total Returns mentioned above is the nominal total growth. The gain is not inflation adjusted. After adjusting for inflation the percentage of growth for S&P 500 total return is 850.976% with dividends reinvested. The gain is mainly due to the growth of every business in the S&P 500."
        },
        {
            "tag": "p",
            "html": "We should keep in mind that S&P 500 is an index and mutual funds that follow the index are called Index Funds. They are a whole different category of funds which we will discuss in the next section."
        },
        {
            "tag": "h3",
            "html": "Mutual Fund Nominal Returns vs Real Returns"
        },
        {
            "tag": "img",
            "classInfo": "article-image",
            "srcUrl": "/img/personal-finance/ffidx-mutual-fund-returns.jpg"
        },
        {
            "tag": "p",
            "html": "The above graph shows the returns generated by FFIDX Mutual funds for a period between 1980 – 2017. The FFIDX mutual fund returns growth is 174% for the past 38 years which is about 17% inflation-adjusted gain. The performance of the fund is average according to morning star with a 3-star rating. The fund invests 95 percent in stocks out of which some are high-risk category stocks. It is an incredibly risky stock which started in the 1930’s."
        },
        {
            "tag": "p",
            "html": "If the mutual fund has an average or a bad performance you might lose money in the long term instead of earning. Also, keep in mind the taxes incurred on the earnings."
        },
        {
            "tag": "p",
            "html": "If you find your mutual fund to be average, you should leave the money already invested in the fund and start a separate investment to an index fund. The tax payment on the stunted growth is not worth paying. It is worthwhile to let it grow and let compounding take care of the rest."
        },
        {
            "tag": "p",
            "html": "The poor performance of the mutual fund can either be due to the higher cost or poor asset allocation strategies by the fund managers. There are tax burdens involved in trading the stocks by the fund managers as well. These are hidden costs involved with mutual funds. They are directly charged from the investors."
        },
        {
            "tag": "p",
            "html": "The expense ratio of the FFIDX is only 0.52% but the growth rate cannot simply be explained by the expense ratio alone. Such a low expense ratio must yield great returns on the investment. It fails due to the active management and speculation."
        },
        {
            "tag": "p",
            "html": "By comparison, this is the worst form of investment for retirement account as it barely keeps up with inflation compared to the S&P 500 Total Returns index."
        },
        {
            "tag": "h3",
            "html": "why do we Calculate Inflation Adjusted Returns instead of Nominal Returns"
        },
        {
            "tag": "p",
            "html": "When we invest our money, we invest it in hope that the current purchase power of the money will grow."
        },
        {
            "tag": "p",
            "html": "As time goes by, the same amount of money is going to buy you less of something. It is necessary to adjust the returns to inflation in order to calculate the real increase in the purchasing power of the money that you invested."
        },
        {
            "tag": "p",
            "html": "By calculating the real increase in the purchasing power of your invested capital after tax, we will know how much you exactly earned through that investment. That is the true measure of potential returns on an investment."
        },
        {
            "tag": "h3",
            "html": "Comparison of After-Tax Returns"
        },
        {
            "tag": "p",
            "html": "The long-term capital gains in India from equity shares, units of the business trust and mutual funds are not taxed as long as you have not invested in Debt Mutual Funds."
        },
        {
            "tag": "p",
            "html": "The long-term capital gains in the US are not taxed for those who fall under the 10% and 15% income tax bracket but the wealthiest can be charged as high as 20% in taxes. If the capital gain is more than $200,000 an additional tax of 3.8% applies on top of the capital gains tax rates."
        },
        {
            "tag": "p",
            "html": "Dividends are taxed in the US based on your income tax rates."
        },
        {
            "tag": "p",
            "html": "Taxes cannot be generalized, The above information is collected in 2018 and is subjected to change but knowing how you will be taxed on the capital gains is mandatory."
        },
        {
            "tag": "p",
            "html": "If you are planning to sell your shares do not forget to calculate the capital gain tax."
        },
        {
            "tag": "h3",
            "html": "Should you Invest in a Mutual Fund?"
        },
        {
            "tag": "p",
            "html": "Do you find any mutual fund which could keep up with the growth of S&P 500?"
        },
        {
            "tag": "p",
            "html": "Finding one with a 30-year-old history is hard enough, given the number of funds that fail to perform at all. They are really high in the long run."
        },
        {
            "tag": "p",
            "html": "Did you choose a fund that keeps up close enough to the returns provided by S&P 500?"
        },
        {
            "tag": "p",
            "html": "How is its track record? How did it perform in the long run? How long since its inception?"
        },
        {
            "tag": "p",
            "html": "Rarely do the funds keep up with the S&P 500 and even when they do, it is even rarer to find one which keeps performing on a consistent basis."
        },
        {
            "tag": "p",
            "html": "There are better options available to invest rather than a mutual fund for retirement savings or any long-term investments for that matter."
        }
    ]
}