{
    "url": "/personal-finance/where-should-we-begin/",
    "title": "Where should we Begin?",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "img",
            "classInfo": "article-header-image",
            "srcUrl": "/img/personal-finance/where-should-we-begin.jpg"
        },
        {
            "tag": "p",
            "html": "We all have to start from wherever we are today. But to be financially successful where do we start from? Let’s find out,  Which statement resonates with you?"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">I am already doing whatever it takes but could barely get through life.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">I live a darn good life and don’t want to think about financial success.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">I have a million dollars! A billion dollars! Invested in a long-term passive income stream yielding 14% a year.</p></div>"
        },
        {
            "tag": "p",
            "html": "Our limiting beliefs demotivate us from achieving, Our ego doesn’t let us accept the reality, find out where you are now and accept the facts. Now it is time to take action. Why don’t we begin with simple actionable steps?. Let’s see."
        },
        {
            "tag": "h3",
            "html": "Definitiveness of Purpose"
        },
        {
            "tag": "p",
            "html": "If there is one thing that you could adopt from this book it would be this.You need a definite purpose for every goal; without a purpose we will be like a boat drifting along the sea without a destination. Why do you want to be financially successful? What is the drive that motivates you to take action? Don’t have a definite drive to motivate yourself to take action?  “Find your drive! ”"
        },
        {
            "tag": "p",
            "html": "We will be discussing about them in Part 6 : <i>Find Your Drive For Financial Freedom.</i>"
        },
        {
            "tag": "h3",
            "html": "What's your story?"
        },
        {
            "tag": "p",
            "html": "The story that you build around the motive to be financially successful is what is driving you to achieve and if you build a strong enough story that you constantly keep thinking about, it is one step closer to achieving success.Everyone would love to be financially successful. What is it that sets the ones who actually achieve financial success apart? Often the financial success is a byproduct of a successful career or business. The career success or business success is a by-product of opportunity and preparation. Don’t ever subscribe to the thought that it is pure luck. The preparation is a by-product of motivation and perseverance. Motivation and Perseverance are derived from reason. The reason is derived from the story you tell yourself."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Luck is what happens when preparation meets opportunity”</i> - <b>Seneca, A Roman Philosopher</b>. "
        },
        {
            "tag": "p",
            "html": "What is your story? Do you want to be financially successful because you wanted to be significant in life? Do you want money to grow to provide food and shelter for your family? As Tony Robbins in “Awaken The Giant Within” put it – “Everything that we do, we do for a  reason. Everything we do is due to a need to avoid pain or to gain pleasure”."
        },
        {
            "tag": "p",
            "html": "What is your pain or pleasure that is motivating you to move towards the financial success dream?"
        },
        {
            "tag": "h3",
            "html": "Plan"
        },
        {
            "tag": "p",
            "html": "With purpose sternly in place, what is the plan that you have right now that will move you towards the financial success dream? The natural outcome of definiteness of purpose is motivation and passion to achieve the dream. Utilize the motivation to plan the path which you would love to take. People are their best expression of themselves when they do what they love. It is extremely hard to be successful at what you do when you hate what you are doing."
        },
        {
            "tag": "p",
            "html": "Learn to love what you are doing. Become extremely good at it, better than anyone else in your field. Have the confidence to acknowledge the dream."
        },
        {
            "tag": "p",
            "html": "I do not know what to plan for! I am not sure if I will achieve what I am planning for. What do I do?"
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Dream is not that which you see while sleeping. It is something that does not let you sleep”</i> - <b>A P J Abdul Kalam</b>. "
        },
        {
            "tag": "h3",
            "html": "Action"
        },
        {
            "tag": "p",
            "html": "Having a definite purpose in life and a plan to achieve your dream will lead you to automatically take massive action."
        },
        {
            "tag": "p",
            "html": "Are you a procrastinator? Let us have a look at how to save more money for tomorrow. An awesome strategy implemented by Shlomo Benartzi called Save More Tomorrow."
        },
        {
            "tag": "p",
            "html": "There are techniques which yielded great wealth to the man in the ancient city of Babylon by simply saving one-tenth of what he has earned for his future and his family."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Gold cometh gladly and in increasing quantity to any man who will put by not less than one-tenth of his earnings to create an estate for his future and that of his family”</i> - <b>The Richest Man in Babylon by George Samuel Clason</b>. "
        },
        {
            "tag": "h3",
            "html": "Discipline"
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Self-discipline is your ability to systematically and progressively work towards a goal and achieve it”</i> - <b>The Neuropsychology of Self Discipline by Sybervision</b>. "
        },
        {
            "tag": "p",
            "html": "Discipline to continuously strive and complete the journey. Take continuous action till the dream is achieved. What will I do if I am not disciplined enough? We can change it, we will cover the topic later. Are you particularly interested in automating your success and never having to worry about it?"
        },
        {
            "tag": "p",
            "html": "As David Bach says “Who has the discipline to continuously save for years? Automate the process!”. For those of you who would like to automate the process of saving & investing, “The Automatic Millionaire” by David Bach is the answer. Let’s analyze it in the coming chapters"
        },
        {
            "tag": "h3",
            "html": "Overcoming Myopia"
        },
        {
            "tag": "p",
            "html": "How could my myopia have anything to do with personal financial freedom? It doesn’t. However, it has got everything to do with purpose, planning, taking action and being disciplined."
        },
        {
            "tag": "p",
            "html": "A young dumb and 18-year old version of me thought “Studying in less light might make my eyes stronger”. Continuing to do so for about a year, I found out that I could no longer see the blackboard in the classroom."
        },
        {
            "tag": "p",
            "html": "I can vividly remember the terrifying experience of no longer being able to see clearly. I reported that to my class teacher, who suggested me to wear glasses. Without a doubt, I was diagnosed with myopia -0.75 in my right eye and -1.00 in my left eye way back in 2008."
        },
        {
            "tag": "p",
            "html": "Fast forward to 2016, I have a -1.75 in the right eye and -2.00 in the left eye. Up until then, I was cool with wearing glasses and identified myself as a person wearing glasses."
        },
        {
            "tag": "p",
            "html": "I remember reading the book, “Spontaneous evolution: our positive future” by Bruce Lipton and had a revelation for the first time in my life. I knew something was wrong with wearing glasses. If I had a fever, Doctor would prescribe some medicine and the fever would go away in a few days."
        },
        {
            "tag": "p",
            "html": "Why doesn’t the same happen to myopia? I thought maybe glasses were contributing to the increase in myopia. To my surprise, I found some websites like endmyopia which motivated people to remove their glasses if they have a low prescription."
        },
        {
            "tag": "p",
            "html": "What was the downside? It takes years to reverse myopia, Luckily, I had developed myopia during my teenage and not previously. If I had developed it in my childhood, my eyeballs would have grown to accommodate for the spectacle power."
        },
        {
            "tag": "p",
            "html": "So, I removed my specs for the first time in my life on March 27, 2017"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\"><b>Motivation</b> - To reverse myopia and to be independent of glasses.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\"><b>Purpose</b> - I know wearing spectacles is being dependant on it forever, For some reason, I also felt having such a dependency would be a hurdle to propel me forward in my career path. I believed it strongly (I realize Sundar Pichai wears specs).</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\"><b>Plan</b> - Remove the specs, Try to relax my eyes as much as possible and never wear it again.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">4</div><div class=\"copy-container\"><p class=\"description mb-3\"><b>Action</b> - I put the specs away in my wardrobe and never touched it again. </p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">5</div><div class=\"copy-container\"><p class=\"description mb-3\"><b>Discipline</b> -  I never wore it again. Full stop.</p></div>"
        },
        {
            "tag": "p",
            "html": "As of July 30, 2018, my myopia has reduced from the previous -1.75 right eye and -2 left eye to -0.5 right eye and -1 left eye (Clinically Tested). A clear victory against progressing myopia. I am expecting to have myopia eliminated by 2020."
        },
        {
            "tag": "p",
            "html": "If I had never imagined that wearing spectacles would make me look a little more dependent than others who do not wear spectacles, I would never have done this experiment in the first place."
        }
    ]
}