{
    "url": "/personal-finance/is-your-home-an-asset-or-liability/",
    "title": "Is your Home an Asset or Liability?",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "img",
            "classInfo": "article-header-image",
            "srcUrl": "/img/personal-finance/is-your-home-an-asset-or-liability.jpg"
        },
        {
            "tag": "p",
            "html": "We call it home because we live there with our loved ones; else it is a house, a real estate property, an asset or a liability. Your financial planner / real estate agent calls your home an asset. But what is the difference between an asset and a liability in the first place? Is your home an asset or a liability? Well, you are going to pay a rent for the house you are living in if you do not own that house."
        },
        {
            "tag": "h3",
            "html": "Home is your Security"
        },
        {
            "tag": "p",
            "html": "Home can be categorized as a security. Home is the place you live in and it offers a secure place to stay. What else is categorized as a security? You need a place to live, you need food to live and you need clothes to wear. They are the most basic necessities. So buying a home where you live on a loan is also security. You are going to pay rent otherwise to somebody which is worse than paying a mortgage payment towards a home you live in."
        },
        {
            "tag": "h3",
            "html": "What is worse than Paying a Mortgage towards the Home you are living in?"
        },
        {
            "tag": "p",
            "html": "Buying a home when the prices are really high and continuing to pay the mortgage until 8 years later when the home prices have dropped by 40 – 60%. That’s painful! A lot painful than paying a rent. A situation which occurred in the US during 2008 housing crisis."
        },
        {
            "tag": "h3",
            "html": "Should you sell your Home?"
        },
        {
            "tag": "p",
            "html": "In an ideal world, you shouldn’t sell your home. But people move from place to place and sometimes are forced to sell their home. So in such cases, buy a home in areas where the prices are really low."
        },
        {
            "tag": "p",
            "html": "You make money while buying and not vice versa. If you find a good bargain while buying a home and are not paying a huge sum of money as transaction fees and are not buying a flexible interest rate on the mortgage or a mortgage for 30 years you can buy that home."
        },
        {
            "tag": "h3",
            "html": "What about a House or a Real Estate?, How should you buy the properties?"
        },
        {
            "tag": "p",
            "html": "Robert Kiyosaki the author of “Rich Dad Poor Dad” is certain that a house is a liability."
        },
        {
            "tag": "p",
            "html": "It is a liability if you are paying to cover the expenses and you can convert it into an asset with the right kind of price for the real estate you are buying, with the right amount of loan repayment plan. We have to analyze if the place provides the appropriate income necessary for the repayment of the mortgage. If it does then we can buy the property from the place and make sure that it provides money into your pockets and not the other way around."
        },
        {
            "tag": "p",
            "html": "Sometimes saving for buying a home and waiting for the prices to drop in order to explain the expenses and the income is the right way to move forward. For example, During the 2006 and 2007 in US, home prices were increasing so fast that people could buy a house which was being built and sell it before completion for a profit. Such times will not last forever; as of 2008 the prices started falling; the tides changed for the worse with too many bad debts stacking up against the bankers; banks started failing and the government had to back them up. We all know how that turned out to be."
        },
        {
            "tag": "p",
            "html": "Buying a home requires a lot of research and patience. It requires a minimum savings of nearly 10 – 30% of the total value of the home, although paying the full amount is the ideal case scenario. Ask yourself, is this house a liability or an asset? Is the property putting money in my pocket or taking it away from me?"
        }
    ]
}