{
    "url": "/psychology/is-racism-a-social-construct/",
    "title": "Is Racism a Social Construct?",
    "image": "/img/psychology/is-racism-a-social-construct.jpg",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Psychology",
            "crumbUrl": "/psychology/"
        }
    ],
    "content": [
        {
            "tag": "p",
            "html": "Racism could be a social construct or a learned behavior to a certain degree."
        },
        {
            "tag": "p",
            "html": "I am not suggesting that racism doesn’t exist. It does to a large degree! But all the countries are not the United States of America, as such assuming that equal amounts of racism exist in all the countries is just absurd."
        },
        {
            "tag": "p",
            "html": "Any amount of assumption more than necessary could become Racism!"
        },
        {
            "tag": "p",
            "html": "When we were in Paris while getting down from the basilica after having a good time during dusk, we saw six black men (is using the black racist?, how else should I describe black men then?) arrive around the dark patch. We were headed towards then inevitably that was our only exit, a man was inviting me to them while 2 men were standing next to him without making eye contact and the remaining 3 were standing Watch."
        },
        {
            "tag": "p",
            "html": "We had no choice but to walk into them, the leader asked me if he could tie a band on my arm, I said “no”. He pulled my arm and I resisted. He said “Respect, My friend” in a stern voice while we were slowly moving away from them and pulled my arm while holding it so tick ( I was thinking it was a power play to force me into submission)."
        },
        {
            "tag": "p",
            "html": "I looked at my wife who was now two steps behind me and nodded to her to get away. And while this was happening the 2 black men who were not standing watch were slowly trying to surround me. Something told me it was now or never! So my wife pulled my hand and started pulling me towards a well-lit area six steps away!"
        },
        {
            "tag": "p",
            "html": "While I was pulled by my wife I started walking backward while facing the guy who was trying to tie a band watching his facial reaction, all I saw was a surprise and his unwillingness to let go of my hand. He held it so tight that it was almost painful. And after I was firmly in the lit area, he had no choice but to let go of my area but not until he took his time to untie the band that he was trying to tie around my arms."
        },
        {
            "tag": "p",
            "html": "God, my heart was pumping so hard from fear, helplessness, and shock but at the same time relieved that we narrowly escaped a great misfortune that was about to happen that day!"
        },
        {
            "tag": "p",
            "html": "We dreamt of going to Paris for well over five years since we were doing our masters in the UK. It was our dream to go there but we never expected it to be splattered with misfortune and sheer terror!"
        },
        {
            "tag": "p",
            "html": "While in Paris people tried to rob us 5 different times unsuccessfully, Imagine feeling helpless, being out in a situation where you know you are going to be robbed, well you don’t want to be because you are after all an immigrant in Europe and losing your Visa means having to reapply for the visa. Well, forget about how to get back to Spain from Paris for a second and even get a temporary passport from the Indian embassy before all of this (Yes we had our passports and NIE with us during the time of attempted robbery). All of the effort that we put into getting out of India to have a better lifestyle in a Developed country (Just like an average Indian, nothing to be surprised about there)."
        },
        {
            "tag": "p",
            "html": "So of course I would do anything to try to not get robbed!"
        },
        {
            "tag": "p",
            "html": "So am I a human being who is so afraid to go back to Paris and meet a gang of black men trying to rob me? Or a Racist for being afraid that the next time around if I do go to Paris they might succeed?"
        },
        {
            "tag": "p",
            "html": "Being lucky 5 times in a row in Paris was lucky enough for me!"
        }
    ]
}