{
    "url": "/personal-finance/find-your-desire-for-financial-freedom/",
    "title": "Find your desire for Financial Freedom",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "img",
            "classInfo": "article-header-image",
            "srcUrl": "/img/personal-finance/find-your-desire-for-financial-freedom.jpg"
        },
        {
            "tag": "p",
            "html": "Why do human beings do what they do? Why do we need to be financially free? Some of them make a killing. Some sacrifice their life in the hope of providing a better life for their children."
        },
        {
            "tag": "p",
            "html": "People are pushed by needs. There are five needs which foster the desire for financial freedom. They are the most fundamental needs and everyone has a collection of these needs."
        },
        {
            "tag": "p",
            "html": "While the first three needs are the most abundant, people often find different means to achieve these needs. Joining the army and putting one’s life in line for the nation or booking a whole IMAX theatre for $40,000 simply to prove to a person who left them seven years ago. Yes, it happened!"
        },
        {
            "tag": "p",
            "html": "Let’s have a look at the fundamental needs which foster financial freedom desires."
        },
        {
            "tag": "p",
            "html": "Five fundamental needs which foster desire for financial freedom are"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Significance</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Growth</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Security</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">4</div><div class=\"copy-container\"><p class=\"description mb-3\">Contribution</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">5</div><div class=\"copy-container\"><p class=\"description mb-3\">Love</p></div>"
        },
        {
            "tag": "h3",
            "html": "Significance"
        },
        {
            "tag": "p",
            "html": "The significance is by far the most important need of all. People have the need to feel significant and having others to acknowledge that they are significant. It is the most primal need."
        },
        {
            "tag": "p",
            "html": "Even Monkeys have them. There is always an Alpha Male in the tribe and most of the males fight for the position. Though we have evolved from them, these needs keep us up to date with the ever growing economy, improving technology and such other things."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“To live intentionally implies that it is not going to be always convenient but it is what will take you to significance if you do not give up.”</i> - <b>Sunday Adelaja, The Mountain of Ignorance</b>. "
        },
        {
            "tag": "h3",
            "html": "Growth"
        },
        {
            "tag": "p",
            "html": "The second in the list is Growth. All businesses say the hardest thing to maintain is the success."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">90 % of the companies fail in the first year</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">96 % of the mutual funds fail in the first decade</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">99 % of the companies vanish in a century</p></div>"
        },
        {
            "tag": "p",
            "html": "We only remember General Electric, AT&T, don’t we? What about Yahoo, Nokia, Enron? Do you still remember them? What about Motorola?"
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Out of your vulnerabilities will come your strength”</i> - <b>Sunday Adelaja, Sigmund Freud</b>. "
        },
        {
            "tag": "h3",
            "html": "Security"
        },
        {
            "tag": "p",
            "html": "The third on the list is Security. The most fundamental need. The need to provide food and shelter for your family. Even though it is the most fundamental why is it in the third? The need for security can be fulfilled simply by needing to be significant or grow."
        },
        {
            "tag": "h3",
            "html": "Contribution / Love"
        },
        {
            "tag": "p",
            "html": "The lack of ability to contribute can drive you crazy. We have the need to be more than what we can possibly be. We have accomplished a lot in the past century. We have abolished war, plague, and famine. We always had war, famine or plague. It wiped 2%  to 20% of the population says Yuval Noah Harari in “Homo Deus: A Brief History Of Tomorrow”. If  you are in your 20’s there is a 32% probability on an average that you will live till your 90’s according to a business insider study. What are you going to do with your lives?"
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“A rich life is lived from a giving heart, not a selfish mind”</i> - <b>Rasheed Ogunlaru</b>. "
        },
        {
            "tag": "h3",
            "html": "Epitome of Financial Illiteracy"
        },
        {
            "tag": "p",
            "html": "Have you ever met anyone whom you consider to be a financial illiterate?"
        },
        {
            "tag": "p",
            "html": "I did. Occasionally I would bring about financial topics which as you know, I love to speak about. I came to know that some people honestly have no interest to speak about finances and they delegated the task to their mom or dad."
        },
        {
            "tag": "p",
            "html": "But, this particular friend of mine was interesting as their family as a whole would delegate the task of financial money management to one of his uncles."
        },
        {
            "tag": "p",
            "html": "I was wonderstruck with this information. I had always believed that any human being is inherently selfish. I have never come across anyone yet who acts selflessly on such a consistent basis."
        },
        {
            "tag": "p",
            "html": "He was confident that his uncle was managing finance of all their families forever! His uncle by the way has his own family, kids, wife and is working to earn his share of income which he spends for his family."
        },
        {
            "tag": "p",
            "html": "Apart from this. He takes care of all the financial planning of my friends family. My inner instinct sensed something was clearly wrong!"
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Every man for himself”</i>"
        },
        {
            "tag": "p",
            "html": "I never gave much thought to it next time and honestly, it was none of my business. My friend would never be bothered to know about finance. He was working with me in Spain as I recommended him."
        },
        {
            "tag": "p",
            "html": "One fine day, I asked him how he is managing all his finances. He told me that he is taking some advice from his uncle and following his lead."
        },
        {
            "tag": "p",
            "html": "My friend was earning as much as I was and I knew as a matter of fact that it was the first time that he was earning that much in his lifetime. He was only 24 years of age at that time."
        },
        {
            "tag": "p",
            "html": "Curious to know more about his uncle's advice on investing, I asked him what was it that his uncle suggested."
        },
        {
            "tag": "p",
            "html": "He said “My uncle suggested me to invest in a Chit Fund and I have been doing that since long before I came to Spain”"
        },
        {
            "tag": "p",
            "html": "I was shocked. I have never heard of it in my entire life."
        },
        {
            "tag": "p",
            "html": "Later, I came to know it is a kind of savings and credit association system. It is a scheme which is organized by financial body or informally among friends."
        },
        {
            "tag": "h4",
            "html": "How it works"
        },
        {
            "tag": "p",
            "html": "Let’s assume that 10 people have gathered to organize a chit fund with an organizer. Usually, the organizer does not participate in the chit fund."
        },
        {
            "tag": "p",
            "html": "Let’s also assume that every person has to pay a sum of ₹20,000 for 10 months. So, every person would be investing ₹200,000 in the chit for a period of 10 months."
        },
        {
            "tag": "p",
            "html": "First month, all the 10 subscribers place their first month installment of ₹20,000 in a pot. The organizer then auctions the money to the 10 subscribers. Any body who bids the lowest amount will receive the first months sum of ₹200,000. Let’s assume that 1st subscriber has won the auction by bidding the lowest ₹170,000."
        },
        {
            "tag": "p",
            "html": "The organizer would then hand the 1st subscriber ₹170,000 and distribute the remaining ₹30,000 after deducting a small percentage fee as his service charge."
        },
        {
            "tag": "p",
            "html": "Anyone who is too desperate for the money would bid the lowest and gain access to a lump sum money immediately after which they would continue paying the chit till the end of the tenure (i.e 9 more months)."
        },
        {
            "tag": "p",
            "html": "The first subscriber has invested ₹200,000 and received ₹170,000. The remaining ₹30,000 is considered as the premium fee for early access to the lump sum money."
        },
        {
            "tag": "h3",
            "html": "Risk"
        },
        {
            "tag": "p",
            "html": "He finishes explaining everything and the first thing I ask him is what happens if someone defaults after obtaining the lump sum money."
        },
        {
            "tag": "p",
            "html": "He was participating in a 20 member chit fund for a period of 20 months and it was informal. Meaning, no one can do anything if the organizer/subscribers default on the payment."
        },
        {
            "tag": "p",
            "html": "What is the advantage of an informal chit fund! <b>Tax…</b>"
        },
        {
            "tag": "p",
            "html": "You do not have to pay any taxes on the interest rates obtained."
        },
        {
            "tag": "p",
            "html": "My friend being a patient chap as he is, chose to wait till the end of the 20 month tenure to receive the payment from the organizer."
        },
        {
            "tag": "p",
            "html": "Only after the 20 months, the organizer offered to pay him the full amount ₹400,000 in cash. My friend was currently in Spain and the organizer was back in India. My friend asked the organizer to pay a set amount by electronic transfer every month."
        },
        {
            "tag": "p",
            "html": "My friend received a total payment of ₹180,000 in total and the remaining ₹260,000 is nowhere to be seen. He might get the money in the next few months or years or he may not."
        },
        {
            "tag": "p",
            "html": "Only time knows the answer to this question. <b>Let’s analyse this situation financially.</b>"
        },
        {
            "tag": "p",
            "html": "He paid a total of ₹349,000 and is scheduled to receive an amount of ₹400,000. A total rate of return of 12.75% for a period of 20 months."
        },
        {
            "tag": "p",
            "html": "What if he paid ₹20,000 every month as a recurring deposit to a bank in India. How much could he have earned?"
        },
        {
            "tag": "p",
            "html": "Paying for a period of 20 months, he would have earned a total sum of ₹424,488. A net profit of ₹24,488 compared to the profit he earned from chit fund which is ₹51,000."
        },
        {
            "tag": "p",
            "html": "Chit fund offers a huge return, exactly 208% more than the recurring deposit as the recurring deposit only offers a return of 6.75% per annum."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Recurring Deposit is a special kind of Term Deposit offered by banks in India which help people with regular incomes to deposit a fixed amount every month into their Recurring Deposit account and earn interest at the rate applicable to Fixed Deposits”</i> - <b>Wikipedia</b>"
        },
        {
            "tag": "p",
            "html": "Clearly, chit fund wins. The risk of getting the money as promised relies solely on the dedication of the subscribers and continuous participation of the organizer."
        },
        {
            "tag": "p",
            "html": "My friend clearly trusted the organizer too much and the organizer ended up spending my friends ₹280,000. Now, my friend is in trouble. There is no proof that the organizer owes my friend his ₹280,000. Incase, the organizer wishes to default on the payment, there is absolutely nothing which my friend could do."
        },
        {
            "tag": "p",
            "html": "My friend contacted his uncle and still could not successfully retrieve all the money from the organizer."
        },
        {
            "tag": "p",
            "html": "Second mistake my friend did was the fact that he did not know any of the subscribers nor the organizer. That was too much of a risk. There is not emotional or financial obligation from the subscriber or the organizer to keep their end of the bargain."
        },
        {
            "tag": "p",
            "html": "Third mistake my friend did was delegating personal finance to his uncle who happens to have his own family and there by having his own separate personal financial obligations which will prove to be an extremely expensive mistake for my friend and his family."
        },
        {
            "tag": "p",
            "html": "If he had spent the time to find his financial freedom desires, he could have deposited the money in the recurring deposit which is risk free thereby receiving the promised capital + interest earned instead of investing in a chit fund which has a higher risk."
        },
        {
            "tag": "p",
            "html": "There is no use investing in a fund which provides a higher rate of return for a higher risk, as the risk of losing the capital invested is not tolerable in any circumstances."
        },
        {
            "tag": "p",
            "html": "Taking control of your financial freedom is the key to financial success. Expecting others to take control of your financial life while leading you to success is just wishful thinking."
        },
        {
            "tag": "p",
            "html": "Such scenarios are just a pipe dream. Your desire to attain your financial freedom has to have some meaning to you. It is your dream, your purpose and you should be the one attaining it. When it comes to personal financial success the journey itself is as important as the destination."
        },
        {
            "tag": "p",
            "html": "The journey towards your personal financial success will teach you some life lessons which will be useful for a lifetime. Having said that, It is not a surprise that the lottery winners go bankrupt a few years after winning millions of dollars."
        },
        {
            "tag": "p",
            "html": "<b>If you do not know how to save</b> or to multiply the money with a solid reason for the money to stay with you, certainly <b>you will end up wasting the money</b> on things which you do not need for a ridiculous price."
        }
    ]
}