{
    "url": "/personal-finance/home-loan-is-it-a-boon-in-disguise/",
    "title": "Home Loan: Is it a Boon in Disguise",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "img",
            "classInfo": "article-header-image",
            "srcUrl": "/img/personal-finance/home-loan-is-it-a-boon-in-disguise.jpg"
        },
        {
            "tag": "p",
            "html": "It all starts with a dream of having a roof on top of one’s head for the sake of their family."
        },
        {
            "tag": "p",
            "html": "But many end up not being able to afford to buy a home with cash."
        },
        {
            "tag": "p",
            "html": "Liberate your income by stepping down the expenses or stepping up your salary. Start saving a substantial portion of your salary towards owning a home."
        },
        {
            "tag": "p",
            "html": "Even if you want to buy a home with a mortgage/loan you might need to pay 10 – 30% upfront with your saved income."
        },
        {
            "tag": "p",
            "html": "<i>Let’s do some maths.</i>"
        },
        {
            "tag": "p",
            "html": "$100,000 home requires a minimum capital of $30,000 to be eligible to buy a home. By saving $1000 every month it would take 2 and half years."
        },
        {
            "tag": "p",
            "html": "$30,000 / $1000 = 30 months / 2 and half years."
        },
        {
            "tag": "p",
            "html": "$30,000 / $500 = 60 months / 5 years."
        },
        {
            "tag": "p",
            "html": "Let’s do the math for the saving all the money $100,000."
        },
        {
            "tag": "p",
            "html": "$100,000 / $1000 = 100 months or 8 years and 4 months."
        },
        {
            "tag": "p",
            "html": "$100,000 / $500 = 200 months or 16 years and 8 months."
        },
        {
            "tag": "p",
            "html": "The trick is to get the amount of money that you are planning to save right. You don’t want to save too little every month and keep saving for 16 years and 8 months in a row only to find out that the home you would like to buy is no longer available for $100,000 but for $300,000."
        },
        {
            "tag": "h3",
            "html": "Setting a Relistic Goal"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">What is the inflation rate of your currency? Is it 5% , 2% 10% ?</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">What is the average rate at which the housing market inflates in your region?</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">What is your average savings allotted for building your new home?</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">4</div><div class=\"copy-container\"><p class=\"description mb-3\">What is the current average price of building a home of your liking in the area along with the land price?</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">5</div><div class=\"copy-container\"><p class=\"description mb-3\">How long is it going to take for you to save up the stipulated money to build a new home?</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">6</div><div class=\"copy-container\"><p class=\"description mb-3\">Will getting a home loan offset the housing inflation?</p></div>"
        },
        {
            "tag": "p",
            "html": "The thing to remember when obtaining a home loan is that you are willing to bet that the money that you will be paying for the home (along with the interest) will be less than the value of the home in 10 years, 15 years or 20 years."
        },
        {
            "tag": "p",
            "html": "But if you save up 30% of your house value while continuing to pay rent for your accommodation does it make sense? Or is it better to get the home loan instead?"
        },
        {
            "tag": "p",
            "html": "From a purely mathematical standpoint,"
        },
        {
            "tag": "p",
            "html": "Saving $1000 every month for 8 years and 4 months to reach $100,000 makes sense if the rent and the housing inflation stay just right while the money you put away earns you the right interest."
        },
        {
            "tag": "p",
            "html": "During these 8 years, you will also be spending around $50,000 on housing alone assuming that the rent is $500."
        },
        {
            "tag": "p",
            "html": "Let’s say that the interest earned from the money saved every month through minimal risk funds are at an average of 8 % compounded annually (current interest rate on fixed deposit hovers around 7.1% P.A. as of 2018)."
        },
        {
            "tag": "table",
            "html": "<tr><th>Year</th><th>Cumulative Recurring Deposits Per Year</th><th>Total Interest Earned at 8% Per Annum</th><th>Total Interest Earned</th><th>Balance</th></tr><tr><td>1</td><td>₹12,000</td><td>₹593.89</td><td>₹593.89</td><td>₹12,593.89</td></tr> <tr><td>2</td><td>₹12,000</td><td>₹1,601.40</td><td>₹2,195.29</td><td>₹26,195.29</td></tr> <tr><td>3</td><td>₹12,000</td><td>₹2,689.51</td><td>₹4,884.80</td><td>₹40,884.80</td></tr> <tr><td>4</td><td>₹12,000</td><td>₹3,864.67</td><td>₹8,749.47</td><td>₹56,749.47</td></tr> <tr><td>5</td><td>₹12,000</td><td>₹5,133.84</td><td>₹13,883.31</td><td>₹73,883.31</td></tr> <tr><td>6</td><td>₹12,000</td><td>₹6,504.55</td><td>₹20,387.86</td><td>₹92,387.86</td></tr> <tr><td>7</td><td>₹12,000</td><td>₹7,984.92</td><td>₹28,372.78</td><td>₹112,372.78</td></tr> <tr><td>8</td><td>₹12,000</td><td>₹9,583.71</td><td>₹37,956.49</td><td>₹133,956.49</td></tr>"
        },
        {
            "tag": "p",
            "html": "In this case, It does not make sense to save up all the money while paying the rent for your housing. It is better to save the minimum on the housing and then buy your home ASAP."
        },
        {
            "tag": "p",
            "html": "Also, check the current house price trend. Every government has its own housing price index. India has its own relatively new Residex to track the current housing price trends in 50 different cities."
        },
        {
            "tag": "p",
            "html": "These Indexes can be of great use to help you decide if it is the right time to buy a home in the area which you would like to. Some websites even have the option to choose year and price per square foot or square meter in the graph to accurately predict the price movement."
        },
        {
            "tag": "p",
            "html": "The major trend for the majority of the regions in India is downwards according to the <a href='https://residex.nhbonline.org.in'>Residex</a> in 2017. So it would be the right move to buy a property in the coming years in India."
        },
        {
            "tag": "h3",
            "html": "Million Dollar Question!"
        },
        {
            "tag": "p",
            "html": "If the house price trend is downwards or just rebounding from the bottom trough should you buy a property in the region if you have saved up the minimum capital of 20 -30 % of the total estimated value of the house."
        },
        {
            "tag": "img",
            "classInfo": "article-header-image",
            "srcUrl": "/img/personal-finance/delhi-house-price-index.jpg"
        },
        {
            "tag": "p",
            "html": "You could buy your home with a mortgage in Delhi for example during 2015 – 2016 as housing price were in its trough."
        },
        {
            "tag": "p",
            "html": "If we are planning to buy a home with about 1200 Square feet, the price per square feet is ₹12,859 in September of 2015. We would need about ₹15,430,800 or ₹15.43 Million."
        },
        {
            "tag": "p",
            "html": "If we buy the same piece of property in June of 2017, the price per square feet is ₹15,605. We would need ₹18,726,000 or ₹18.72 Million."
        },
        {
            "tag": "img",
            "classInfo": "article-header-image",
            "srcUrl": "/img/personal-finance/delhi-house-price-table.png"
        },
        {
            "tag": "p",
            "html": "If you are in 2015 and all you see is the price dropping, you might wait for it to drop further only to find that it is starting to rise again."
        },
        {
            "tag": "p",
            "html": "The trick is to buy the property around the time frame between late 2015 – 2016. I understand it is hard to get it just right."
        },
        {
            "tag": "p",
            "html": "Opportunities arise when there is blood on the streets! When there is peak pessimism."
        },
        {
            "tag": "p",
            "html": "But between 2007 to 2012 the housing prices doubled and it has almost stayed the same for the next 6 years. So the long-term prospects of hurrying to buy a home today are questionable. If you buy a home today for 18.72 Million Rupees, the home price might stay the same for the next few years before moving up or down."
        },
        {
            "tag": "p",
            "html": "Chances are the house price will double during the 7 – 10 years of boom and drop and stay roughly in the same region for the following decade."
        },
        {
            "tag": "p",
            "html": "Chances are the house prices will double 2- 4 times during your lifetime. The trick is to never buy the property when it is at its peak and never try to sell the property when the price is in its trough."
        },
        {
            "tag": "h3",
            "html": "Can you get it Right?"
        },
        {
            "tag": "p",
            "html": "Yes, you can, you need more information on the history of the land prices in the region. Wait for the right opportunity and grab it when the time is right and pessimism is at its peak to get the best deal out of the housing market."
        },
        {
            "tag": "h3",
            "html": "Home Loan"
        },
        {
            "tag": "p",
            "html": "The question then comes - should you save all the money and buy a home with cash or save about 20 – 30 % of the total value and buy a home today."
        },
        {
            "tag": "p",
            "html": "Let’s say that you have put $30,000 upfront and took a loan for $70,000 from the bank."
        },
        {
            "tag": "p",
            "html": "Chances are you will be paying 1 and a half times to 2 and half times the total loan value if you are paying your home loan for 25 years."
        },
        {
            "tag": "p",
            "html": "The house price might only have doubled once during the time frame."
        },
        {
            "tag": "p",
            "html": "How to calculate if it’s worth taking a mortgage now?"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Calculate the total interest payment for the bank loan obtained.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Calculate the average home price you would like to pay today.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Calculate the home rent you would likely pay while saving to buy a home.</p></div>"
        },
        {
            "tag": "p",
            "html": "Let’s check the difference between taking a mortgage and saving the money for buying a home using cash."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">(Total payment for the bank loan obtained along with interest payments + Your Initial upfront payment for your home)</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">(Average home price you would like to pay today + Compound interest earned while saving the money)-(Total Home Rent to pay during the period)</p></div>"
        },
        {
            "tag": "p",
            "html": "House price in the next decade or two can only be speculated but the general 2 – 5 year trend can be reliably predicted to either move upward or downwards and we also know that the house price is going to double at least once depending on the country in 25 years on an average."
        },
        {
            "tag": "p",
            "html": "These numbers should provide you with enough information to take appropriate action."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">If the  (Total payment for the bank loan obtained along with interest payments + Your Initial upfront payment for your home) is lesser, it makes sense to take a home loan.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">If the (Average home price you would like to pay today + Compound interest earned while saving the money)-(Total Home Rent to pay during the period) is lesser, it makes sense to save the money with cash.</p></div>"
        },
        {
            "tag": "p",
            "html": "Since we have not taken the housing inflation for both the cases, the result should roughly provide the right answer."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">If it takes less than a decade to save up the required capital and you predict the house price trend to be downward for the next 2- 6 year period, SAVE THE MONEY TO BUY A HOME. When the trend starts to change and the price starts to spike up, you can consider buying a home with 50-60% down payment and repay the loan in less than a decade.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">If it takes more than 15 years to save the money, may be consider stepping down and buying a 1 bedroom flat instead of a 2 bedroom villa.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">After analyzing your house price index and if you are fairly certain that the prices are about to rebound from the trough soon and if you don’t have 100% cash for buying your home and if you are certain that you would repay the home loan in the next decade, get the loan and buy your home.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">4</div><div class=\"copy-container\"><p class=\"description mb-3\">If the home prices are stable for the past few years, it is better to keep saving the money and wait for the trough or signs of prices rising. Keep saving till then.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">5</div><div class=\"copy-container\"><p class=\"description mb-3\">If you do not have any money saved up and you see there is a spike in the residential market or there is going to be a spike in the market, it’s better that you let this opportunity pass. Be prepared for the next opportunity.</p></div>"
        },
        {
            "tag": "p",
            "html": "All the above scenario work well when the rent for the living is not more than 30 % of your total income."
        },
        {
            "tag": "h3",
            "html": "Housing Bubble"
        },
        {
            "tag": "p",
            "html": "What happens if your country has a 3% down payment option to obtain a mortgage?"
        },
        {
            "tag": "p",
            "html": "It is a great option. Go for it!"
        },
        {
            "tag": "p",
            "html": "For example in the US, Fannie Mae currently offers 97% of the house value as a mortgage for a primary residence property with a loan not exceeding $453,100. The debtor should have a minimum credit score of 620."
        },
        {
            "tag": "p",
            "html": "Should you really save up 30% of your income before buying a home?"
        },
        {
            "tag": "p",
            "html": "<b>No! Definitely not.</b>"
        },
        {
            "tag": "p",
            "html": "Let’s assume that you are buying a home worth $200,000. The minimum required down payment would then be $6000 which means that you will be taking a mortgage of $194,000."
        },
        {
            "tag": "p",
            "html": "That is a considerable mortgage which attracts an average compound interest of 4.6%."
        },
        {
            "tag": "p",
            "html": "Even if you choose to pay the mortgage in 360 installments which is a 30 year period, you would be paying around $1358 on a monthly basis which is substantial for an average person earning about $30,000 a year."
        },
        {
            "tag": "p",
            "html": "You would have paid around <b>$468,841.66</b> for a 30 year period."
        },
        {
            "tag": "p",
            "html": "How does it make sense to get a 3% down payment option then?"
        },
        {
            "tag": "p",
            "html": "Let's look at the bigger picture."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">From the lenders perspective, 3% down payment option is riskier.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">From a government's perspective, they are too desperate to induce artificial growth.</p></div>"
        },
        {
            "tag": "p",
            "html": "Any rational person will know that if a person cannot possibly save 30% of the house value, he cannot pay off the house."
        },
        {
            "tag": "p",
            "html": "For a government to provide such a radical scheme, they must be really desperate for growth."
        },
        {
            "tag": "p",
            "html": "After introducing a 3% option for buying a home, anybody who cannot afford to save 30% of the total value of the home (which is the case with 37% of the families in the US) will start to go for the 3% option."
        },
        {
            "tag": "p",
            "html": "There is a sudden spike in the housing market. All the people who couldn’t previously afford to buy a home are now eligible to buy one with not much commitment at all. They are only paying 3% of the total value of a home."
        },
        {
            "tag": "p",
            "html": "That’s not much of a ownership, the bank practically owns the home. The only belief is that the debtor will repay the mortgage on a monthly basis."
        },
        {
            "tag": "p",
            "html": "The sudden spike in the housing price will induce urgency and more and more people will start buying a home. So, if there is a 3% option, the best way is to get a new home with a 3% down payment."
        },
        {
            "tag": "p",
            "html": "What next? All the bad debtors will start defaulting on the payment. If enough people default on the mortgage then it will be a successful recreation of the 2008 housing bubble."
        },
        {
            "tag": "p",
            "html": "But that was due to subprime mortgages right? They typically had a credit score of less than 640."
        },
        {
            "tag": "p",
            "html": "Just like 2007, if people start buying more than one home what happens? It will be an eventuality that someone will default on the payment."
        },
        {
            "tag": "p",
            "html": "Whenever banks take the fall, the government will back them up with our tax dollars. This will be an eventuality."
        },
        {
            "tag": "p",
            "html": "What can you do about it? Take maximum advantage of the situation. When the media starts promoting people to buy a new home, start selling yours."
        },
        {
            "tag": "p",
            "html": "Chances are that you can sell yours at a much higher price. After selling yours and repaying all the mortgage left, you can invest the money on government bonds or any risk-free investments."
        },
        {
            "tag": "p",
            "html": "What if you do not sell the house but instead choose to keep paying the mortgage? When the house price hits rock bottom, you will essentially be paying a higher mortgage for a home which isn’t worth as much."
        },
        {
            "tag": "p",
            "html": "It is generally painful and you would be lucky if your company was still afloat after the stock crash. Generally, the smaller companies take a harder hit."
        },
        {
            "tag": "p",
            "html": "The larger companies are generally backed by the governments. They have nothing to lose. Fire a few employees and get the balance sheet in order."
        },
        {
            "tag": "p",
            "html": "Anything can happen. I am not proposing a doomsday theory here. If you find an opportunity, it is always better to cash in on the opportunity."
        },
        {
            "tag": "p",
            "html": "After the fall, when no one wants to buy a home, go buy two of ‘em."
        }
    ]
}