{
    "url": "/psychology/can-a-smoker-ask-you-to-not-smoke/",
    "title": "Can a Smoke ask you to Not Smoke?",
    "image": "/img/psychology/can-a-smoker-ask-you-to-not-smoke.jpg",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Psychology",
            "crumbUrl": "/psychology/"
        }
    ],
    "content": [
        {
            "tag": "p",
            "html": "A good piece of advice provided even by a child abuser if valid should be taken."
        },
        {
            "tag": "p",
            "html": "I believe that we can learn from everybody just in two ways."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">What to do?</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">What not to do?</p></div>"
        },
        {
            "tag": "p",
            "html": "In both ways, it is better to learn from someone else’s experience rather than exhausting your potential into Karma."
        },
        {
            "tag": "p",
            "html": "If a smoker tells someone not to start smoking and that once started it is almost impossible to give up! Shut up and listen to them. They know they started something that they do not know how to give up! It requires willpower and meaningfulness to stop smoking. Stopping smoking is not as simple as stopping something you have to replace it with another habit or force your will upon the impulse to smoke long enough for you to stop wanting to smoke."
        },
        {
            "tag": "p",
            "html": "You are essentially learning what not to do from them. This does not in any way immediately invalidate what they said."
        },
        {
            "tag": "p",
            "html": "This happened to Jordan Peterson himself, he keeps telling everyone to organize their room first before starting to organize the country! It is in many ways what our Indian ancestors have always told us. It is an age-old knowledge that we have grown up with but just choose not to follow them anyway! so he went through a period of indescribable pain and withdrawal syndrome from Benzodiazepine medicine which took him to Canada, the USA, Russia, and many other countries which I haven’t told and many many months to recover and stop taking the medication which was prescribed by doctors but not before going through various near-death experiences."
        },
        {
            "tag": "p",
            "html": "During this period in time, he had not organized his office space and someone took a picture and posted it online and it went viral! I’m like it doesn’t matter man! He is telling something valid why do you care if he is following it or not. If you think it is good advice take it or leave it! The same goes with this blog right! No one would sit through and read a blog post if they thought it was not important for them."
        },
        {
            "tag": "p",
            "html": "A Priest, a Yogi, a teacher, a prisoner, a murderer, or a 5-year-old can share their piece of wisdom and if it is meaningful and it makes sense to incorporate them into our lives, it is our solemn duty to incorporate them into our lives. As human beings, we can never be perfect ever! But I think that is our strength, it means there is something within us guiding us to do what is most meaningful in life."
        },
        {
            "tag": "p",
            "html": "That is the reason people get bored, that is the reason people destroy buildings and glasses for fun! That is the reason why people watch TV all day long ( to escape from the pointlessness of NOW) and take them to a fairyland and make them feel nostalgic or make them want to experience what they say or vice versa."
        },
        {
            "tag": "p",
            "html": "It is funny that every blog that I now write comes right back to finding meaning in life. I think it has to right? That is the source of our motivation in life. Or so I think! If not what do we have to live for? Why bother about the future? Just kill ourselves now and be done with the unbearable misery of life right? If life is meaningless why suffer? All the suffering would immediately become meaningless as well. So life evident has to become meaningful with the responsibilities that we choose to take in life."
        },
        {
            "tag": "p",
            "html": "The responsibilities are also fundamental choices that we make in life right? It was definitely once your choice to choose this responsibility and follow through with it! You sacrificed your potential then to opt for this responsibility. Responsibility at the same time is also a form of burden right? Like Atlas shouldering the whole world on his back."
        },
        {
            "tag": "p",
            "html": "If Atlas was a real person living a meaningless life, he wouldn’t even walk, let alone carry the weight of the whole world while walking. That is the meaning of taking what you can carry and shouldering them as long as you can."
        },
        {
            "tag": "p",
            "html": "Don’t smoke, be a good citizen and live a cancer-free life, and do take the advice of a smoker."
        }
    ]
}