{
    "url": "/personal-finance/power-of-dreaming/",
    "title": "The Power of Dreaming",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "img",
            "classInfo": "article-header-image",
            "srcUrl": "/img/personal-finance/power-of-dreaming.jpg"
        },
        {
            "tag": "p",
            "html": "It all starts with a dream to become successful in life. The dream has to be justified with a definiteness of purpose. The purpose then drives us to plan and to take action. Keep repeating the action with discipline and there you have it! A glimpse of the path to success."
        },
        {
            "tag": "p",
            "html": "Assuming you are dreaming to become successful in the field that you love, you would find it relatively easy to learn from your mistakes. Learning from the mistakes fine tunes your skills & improves it to an extent that you become more and more valuable day by day."
        },
        {
            "tag": "h3",
            "html": "What if I am really Comfortale where I am?"
        },
        {
            "tag": "p",
            "html": "You should start attending seminars by Tony Robbins or Harv Eker. They have the habit of making you realize your false perceptions. They make you really uncomfortable and uncomfortable is what we want everybody to feel. That’s when people start taking action and start moving forward in life towards success."
        },
        {
            "tag": "p",
            "html": "Feeling uncomfortable about your current situation is the best thing that could happen to you."
        },
        {
            "tag": "h3",
            "html": "How do you become Successful in Life"
        },
        {
            "tag": "p",
            "html": "You have probably heard that you have to provide value. Value also means helping people solve a problem. It has to be in your area of expertise."
        },
        {
            "tag": "p",
            "html": "How do you find an opportunity to solve a problem? Chris Guillebeau, Author of “$100 startup” has some really good insights."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Inefficiency in the market can be compensated by your product/services.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">The advent of new technology or opportunity. For example – Android and play store in the late 2000’s.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Being efficient and talented in your area of expertise.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">4</div><div class=\"copy-container\"><p class=\"description mb-3\">Providing customer what they want and not what you think they want.</p></div>"
        },
        {
            "tag": "h3",
            "html": "Does providing Value make you successful?"
        },
        {
            "tag": "p",
            "html": "No. It simply provides you with an opportunity to earn. To become successful, you should be the kind of person that people think about in order to resolve that problem. “Losing my virginity” by Richard Branson has some perfect suggestions."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Make a positive difference in people’s life. Doing good for others without expecting anything in return at times is good for business.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Believe in your Ideas and be the best you could possibly be in business/personal life.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Have fun along the way to success and always look after your team.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">4</div><div class=\"copy-container\"><p class=\"description mb-3\">Never give up.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">5</div><div class=\"copy-container\"><p class=\"description mb-3\"><b>Active Listening</b> - Take notes when necessary and keep facing challenges.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">6</div><div class=\"copy-container\"><p class=\"description mb-3\"><b>Hire Your Weaknesses</b> – Delegate and spend more time with your family. Always listen to your families opinions and then make your own decisions.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">7</div><div class=\"copy-container\"><p class=\"description mb-3\"><b>Go Offline</b> – Turn Off your Laptop and iPhone before you engage with the world every day. Embark on the journey of your life and experience it to the fullest.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">8</div><div class=\"copy-container\"><p class=\"description mb-3\"><b>Communicate, Collaborate And Then Communicate More</b> – Always remember to convey the ideas in a simplistic term.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">9</div><div class=\"copy-container\"><p class=\"description mb-3\"><b>Do What You Love</b> – surround yourself with people you love and people who love you.</p></div>"
        },
        {
            "tag": "h3",
            "html": "The Real Price of not doing What you Love"
        },
        {
            "tag": "p",
            "html": "I vividly remember the first time when one of my colleagues introduced me to the website wishandfly.com - an interesting concept in which the traveler pays a set amount of money, in this case, €150 per traveler and the traveler does not know where he/she is traveling before 48 hours of the date of travel."
        },
        {
            "tag": "p",
            "html": "The moment, I laid my eyes on it. I knew it had a great potential in India and wanted to create a website for exactly this purpose. I was sure that it would be a great success. There began a journey of surprisetours.in. It took me nearly 3 months to finish the website and that meant that I did not learn anything about personal finance during those three months."
        },
        {
            "tag": "p",
            "html": "What next? I am in Spain, trying to run a surprise tours travel agency in India. Will it work out? it might. That would mean that I have to be available over the phone, provide a valid address, register the business, start a business account and market the website."
        },
        {
            "tag": "p",
            "html": "Will I be a millionaire the next day?  Nop. I was enthusiastic about the opportunity to create the website but gave up on it as it was practically not viable since I was in Spain. It would mean that I spend a fortune to set up and start the business and most likely hire people and manage them remotely."
        },
        {
            "tag": "p",
            "html": "I gave up on it after three months. The website is still live earning a total of ₹0 for the past four months. Then, I diverted my attention back to readorb.com. It is the one thing which I am certain that I will get back to, no matter what. I have practically experienced it."
        },
        {
            "tag": "p",
            "html": "Readorb is what I love, without learning about personal finance, I am a failure in my personal life. It is too important to give up. While learning about personal finance, this is the way that I would like to give back to the community. The website and all of its contents are free."
        },
        {
            "tag": "p",
            "html": "What’s the big deal in running a website right? It’s hardly giving back to the community. Try to do the same as a part-time job while also learning about personal finance. The content has to be a quality one else people would never visit it. There are thousands of financial websites out there. The last website which could be a success is Readorb and I am aware of that. Every business has to have its own niche. Mine is a personal financial plan for millennials and I know it works. How? I am a millennial myself."
        },
        {
            "tag": "p",
            "html": "All the personal financial advice provided here are tried and tested. Only out of the experience. Paving a clear financial path and planning for it is half the job done. The other half is to actually execute the formulated plan."
        },
        {
            "tag": "p",
            "html": "So, I gave up on surprise tours and I am back on learning about personal finance. I love learning about personal finance and just because there was an opportunity in India regarding surprise tours does not mean that I will succeed in it. Unless I love the fact of running a travel agency and am passionate about it, I will never be a success. In fact, I will be a failure."
        },
        {
            "tag": "p",
            "html": "Lesson well learnt: <b>Do only what you love and do it consistently.</b>"
        }
    ]
}