{
    "url": "/do-you-really-need-a-budget-to-become-financially-free/",
    "title": "Do you really need a budget to become Financially Free?",
    "image": "/img/personal-finance/do-you-really-need-a-budget-to-become-financially-free.jpg",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "p",
            "html": "We all love freedom. Doesn’t budgeting restrict our freedom of spending?"
        },
        {
            "tag": "p",
            "html": "Yes, it does restrict our freedom to spend. That’s the whole point but it will not feel that way when you get used to the budget."
        },
        {
            "tag": "p",
            "html": "The initial inertia required to start practicing to budget is minimal. But how many of them stick to the budget every month? What about one year? 10 years and your lifetime?"
        },
        {
            "tag": "p",
            "html": "It’s a habit which you should start to befriend rather than hate."
        },
        {
            "tag": "p",
            "html": "As it is the single habit which will definitely move you closer to your financial freedom."
        },
        {
            "tag": "p",
            "html": "Think of yourself as an organization with strict spending. Don’t overspend it as you have other tasks to spend it on as well."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Start to control the money else it will start controlling what you do”</i>. "
        },
        {
            "tag": "p",
            "html": "Freedom to spend the money when you want however you want comes with a price. Money begins to control your freedom."
        },
        {
            "tag": "p",
            "html": "Let’s find out what I mean by that. Every individual has a finite amount of income that he pockets."
        },
        {
            "tag": "p",
            "html": "Majority of the individuals who do not like to budget their spending will eventually learn how to spend all their income before the month ends."
        },
        {
            "tag": "p",
            "html": "Just Google “famous stars being bankrupt”, you will be bombarded with 647,000 results. Some of the most famous among them being <b>50 cents, Mike Tyson, Michael Jackson, Walt Disney</b> and <b>DONALD TRUMP!</b>"
        },
        {
            "tag": "p",
            "html": "Many of them filed for bankruptcy due to various reasons. But it is not uncommon even among the most famous individuals."
        },
        {
            "tag": "p",
            "html": "If celebrities get bankrupt it is easy for them to revert back. But if you do it, it is going to be hard compared to the celebrities."
        },
        {
            "tag": "p",
            "html": "Better plan your expenditures and count your money before planning to spend."
        },
        {
            "tag": "h3",
            "html": "Going over the Budget"
        },
        {
            "tag": "p",
            "html": "Why do you want to plan to budget your expenses?"
        },
        {
            "tag": "p",
            "html": "Is it because you are tired of not having money during the month end? Is it because you are unable to save for your next home?"
        },
        {
            "tag": "p",
            "html": "Find out exactly why is it that you have decided to start budgeting."
        },
        {
            "tag": "p",
            "html": "For example, if you are tired of not having money during the month ends, how tired are you? Will you be able to stick to your budget for 90 days or more without taking a break?"
        },
        {
            "tag": "p",
            "html": "It takes about 90 days for the habit to kick in. You have to be determined enough to pull it off."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“The fact that you are losing something while not budgeting should be emotionally more painful than the joy of being able to spend.”</i>. "
        },
        {
            "tag": "p",
            "html": "If you do not have one or more pressing reasons to perform an act, you will give up some day or the other and end up living in a way you never intended to."
        },
        {
            "tag": "p",
            "html": "Even at the time when we truly intend to budget and start spending strictly on the budget, it is sometimes not possible to stick with it for various reasons."
        },
        {
            "tag": "p",
            "html": "Imagine a budget for one month with an income of $1,000."
        },
        {
            "tag": "p",
            "html": "Example - "
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Rent - <b>$300</b></p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Utility – <b>$100</b></p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Travel and food – <b>$320</b></p></div>"
        },
        {
            "tag": "p",
            "html": "In the example mentioned above, it is easy to go over budget on the utility during winter due to electricity and gas usage."
        },
        {
            "tag": "p",
            "html": "It will indirectly result in your saving less on winter and more on summer due to utility charges."
        },
        {
            "tag": "p",
            "html": "Apart from that you could have a restaurant budget / cheat- day budget."
        },
        {
            "tag": "p",
            "html": "You could come up with as many ideas as possible for adding something new and budgeting it."
        },
        {
            "tag": "p",
            "html": "While some of the budgets keep changing, others can reliably be static as the house rent, internet bill, transport expenses, and even food."
        },
        {
            "tag": "p",
            "html": "Strictly spend the food budget on food and utility on utility without excuses."
        },
        {
            "tag": "p",
            "html": "Always have a purpose for budgeting. Generally, the purpose of budgeting is to enable you to save/free up the money to invest."
        },
        {
            "tag": "p",
            "html": "Budgeting enables you to possibly prevent any financial blunders."
        },
        {
            "tag": "p",
            "html": "Taking a loan to speculate on the stock market because you don’t have the habit of budgeting is a blunder."
        },
        {
            "tag": "p",
            "html": "If it is other people’s money and if it comes with relative ease, we don’t think twice before spending it."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“The pain of saving every little penny and watching it grow will make you think twice before you spend”</i>. "
        },
        {
            "tag": "h3",
            "html": "Alternate way to Spend"
        },
        {
            "tag": "p",
            "html": "There are others who choose to pay by card and generally find out that they have gone a little over budget this time."
        },
        {
            "tag": "p",
            "html": "<b>We generally prefer to spend using the card as spending by cash and watching it dwindle is equally painful as saving the money one penny at a time and watching it go to waste.</b>"
        },
        {
            "tag": "p",
            "html": "Spend using cash, if you run out of money a week early every month. Try to plan a weekly budget."
        },
        {
            "tag": "p",
            "html": "Still thinking the budget is not for you? Even the governments run on budget. They plan for everything and even for the future. Why do you think you shouldn’t?"
        },
        {
            "tag": "h3",
            "html": "Losing the purpose to budget"
        },
        {
            "tag": "p",
            "html": "Having truly experienced a real lack of money continuously for a few years, I had no option but to budget my expenses. I was frugal while working in India. I had no option but to be frugal."
        },
        {
            "tag": "p",
            "html": "My income would barely suffice for my day to day living. It was not much. I was in a lock-in period with the company in India. I was supposed to serve a compulsory two-year term for being trained in IT."
        },
        {
            "tag": "p",
            "html": "I honestly thought that I was financially doomed back in March 2015 when I signed the contract. I knew it was the right career move. Learned a new technology which was worth the risk which I took."
        },
        {
            "tag": "p",
            "html": "By April 2016, after my serving one year in the company, it had to shut down due to various financial reasons. I was jobless for one month, during which I applied for a job in Spain."
        },
        {
            "tag": "p",
            "html": "Luckily, I got the job and migrated to Spain. With the sudden surplus of money, I could spend every penny which I earned and no one could possibly blame me."
        },
        {
            "tag": "p",
            "html": "I never cooked for the first two months in Spain. I was by no means experiencing the same lack of money when I was in India. By all means, I was living a lavish life with the money that I had earned while also saving 70% of my salary."
        },
        {
            "tag": "p",
            "html": "Spending money never felt right even after earning enough to save 70% of my salary every month. Something told me to be frugal always. I still have the lack of ease to spend which was largely attributed to the series of events which I had previously mentioned."
        },
        {
            "tag": "p",
            "html": "But, there was a problem. I never had any purpose to save the money. Although, I saved up 50% of the money for the marriage expenses, the remaining 20% was at my disposal. I could have spent them all."
        },
        {
            "tag": "p",
            "html": "Every month, I started saving the remaining 20% for no particular reason. Just out of habit. It was about €250 every month, It slowly grew. After marriage, the money had grown to a grand total of €2000."
        },
        {
            "tag": "p",
            "html": "During the 8 months alone in Spain, I read around 35 books, largely because I never had the internet and the summer was too hot to venture outside. The combined wisdom of these 35+ books taught me to save for the rainy day."
        },
        {
            "tag": "p",
            "html": "I decided the money which I was saving without any real purpose is an <b>emergency fund!</b>"
        },
        {
            "tag": "p",
            "html": "It was a new term which I stumbled while reading Dave Ramsey's book. Later in 2017, I had learned that women largely crave for financial security. Doesn't matter if they realize it or not."
        },
        {
            "tag": "p",
            "html": "There would be a general discomfort when you ask a woman to travel 8000km without any financial security. The emergency fund would then act as a security for my wife."
        },
        {
            "tag": "p",
            "html": "For some reason, she freaks out when the emergency fund runs dry! So, I always ensured a minimum emergency fund of €2000."
        }
    ]
}