{
    "url": "/personal-finance/emergency-fund-why-is-it-important/",
    "title": "Emergency Fund: Why is it Important?",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "img",
            "classInfo": "article-header-image",
            "srcUrl": "/img/personal-finance/emergency-fund-why-is-it-important.jpg"
        },
        {
            "tag": "p",
            "html": "Have you ever noticed that we keep staring at someone for no reason? It makes everyone uncomfortable."
        },
        {
            "tag": "p",
            "html": "We only do so when the emotions are strong enough and even then rarely consistently unless the other reciprocates."
        },
        {
            "tag": "p",
            "html": "Other 4 senses do not have this intimate interaction. Any other species which relies on smell or hearing does not have this intimate emotional interaction."
        },
        {
            "tag": "p",
            "html": "We as a species who rely on emotions to guide us on the right path should also be able to equally rely on the habits and characters."
        },
        {
            "tag": "p",
            "html": "Much of these habits and principles are nurtured in the childhood."
        },
        {
            "tag": "p",
            "html": "One among them is the necessity and willingness to save. If we do not find pleasure in doing so and if the emotion – pleasure, pain, insecurity is not strong enough, then it is hopeless to start saving money and trying to get your finances right."
        },
        {
            "tag": "p",
            "html": "You will find out that you are starting to save some money to get your finances right only to find out that you stopped doing it in the next few months."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“We are what we see and experience in life. We cannot possibly be anything more”</i>"
        },
        {
            "tag": "p",
            "html": "If you have experienced poverty, misery, and powerlessness for an extended period of time, so much so that you hate to experience them ever again, you will start to get your finances straight."
        },
        {
            "tag": "p",
            "html": "What about those who have experienced the comfort and is used to being comfortable in life. They are usually the middle class, the major consumers of the society."
        },
        {
            "tag": "p",
            "html": "It is going to be hard to break that cycle of spending to be comfortable in life."
        },
        {
            "tag": "p",
            "html": "The starting point to breaking that cycle comes in the form of saving -  saving for emergencies."
        },
        {
            "tag": "h3",
            "html": "Credit Cards"
        },
        {
            "tag": "p",
            "html": "We all have credit cards, don’t we? We generally use them for emergencies."
        },
        {
            "tag": "p",
            "html": "The whole point of saving the money for an emergency fund is to instill a sense of security and start funding your emergencies by yourself."
        },
        {
            "tag": "p",
            "html": "What’s the whole point of saving and liberating yourself from consumerism if you find solace and comfort under the credit card which is also something that you consume?"
        },
        {
            "tag": "p",
            "html": "A credit card is a commodity that you are consuming and paying for it later."
        },
        {
            "tag": "p",
            "html": "If you have a 12-month emergency fund basket and are having multiple streams of income, will you really think of having credit cards in your life?"
        },
        {
            "tag": "p",
            "html": "Credit cards are an abomination to rely on for emergencies."
        },
        {
            "tag": "p",
            "html": "They fund your emergencies (the money that you can’t afford). If you can’t afford it this month, how could you possibly repay the debt in the next few months?"
        },
        {
            "tag": "p",
            "html": "What if there is another emergency the next month?"
        },
        {
            "tag": "p",
            "html": "Emergencies are an eventuality in life. The emergency expenses that you have not predicted for this month will happen to every individual one day or the other."
        },
        {
            "tag": "p",
            "html": "Are you protected for emergencies with your savings?"
        },
        {
            "tag": "p",
            "html": "Benefits of an Emergency Fund:"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Protected by your money, the sense of security and ownership is strong.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">You will be able to experience life with a feeling of security and strong positive emotions.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Could pave the way to take risks and experience life, thereby having a possibility of opening new streams of income.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">4</div><div class=\"copy-container\"><p class=\"description mb-3\">Wanting to extend this security that you have experienced in finance to all aspects of your life and thus making you strive for excellence.</p></div>"
        },
        {
            "tag": "p",
            "html": "The first step to getting your finances right is to start with an emergency fund according to Dave Ramsey, the author of “The Total Money Makeover”."
        },
        {
            "tag": "p",
            "html": "It makes complete sense as starting whatever else must not be hindered by unexpected financial burdens in your life."
        },
        {
            "tag": "p",
            "html": "It paves the way to finish the other endeavors rather than halting it until the emergency is sorted."
        },
        {
            "tag": "h3",
            "html": "Comfort Zone"
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“A comfort zone is a beautiful place but nothing grows there!”</i>"
        },
        {
            "tag": "p",
            "html": "We all have our comfort zones. It’s a place where life just happens to move along with minimal effort from your end."
        },
        {
            "tag": "p",
            "html": "As beautiful as it may sound. There is no growth there because all the action is happening outside your comfort zone."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“Action takes effort; effort has no place in the comfort zone”</i>"
        },
        {
            "tag": "p",
            "html": "Can you name all the famous people that you know? Why do you know them?"
        },
        {
            "tag": "p",
            "html": "The simple answer is that you know them because of the work they do. They are nobody without their success in their work."
        },
        {
            "tag": "p",
            "html": "The work you do has to be yours and has to solve a problem and make life easy to live for others."
        },
        {
            "tag": "p",
            "classInfo": "quote",
            "html": "<i>“You should not just love your work but own it”</i>"
        },
        {
            "tag": "p",
            "html": "Do what you do, do it with love and passion for the work. Begin! Learn! Excel! Start to solve greater problems. You will face hurdles in life - financial, personal and professional. Learn to stay calm. One of the key things that are going to make your life easy is an Emergency Fund."
        },
        {
            "tag": "p",
            "html": "It paves the way to stop worrying about the next calamity and to start taking action. Do what you want to do in life. Experience true freedom!"
        },
        {
            "tag": "h3",
            "html": "A Series of Unfortunate Events"
        },
        {
            "tag": "p",
            "html": "Working abroad could be a life-changing experience for anyone. That proved to be true with the recent set of events which had unfolded during my stay in Spain."
        },
        {
            "tag": "p",
            "html": "Happy that I didn’t have to fulfill my two-year mandatory work in India due to the sudden closure of the company in April 2016. I signed an unbreakable contract with another consultancy which renews every year in order to work in Spain."
        },
        {
            "tag": "p",
            "html": "So began my journey to Spain. I found the unbreakable contract to be a plus, as I want to settle down somewhere abroad, largely due to the difference in the lifestyle between India and other developing nations."
        },
        {
            "tag": "p",
            "html": "I was happily working till the start of March 2018 in Spain through the Indian company with an unbreakable contract. The visa was intercompany transfer visa. The Indian company has made a partnership with another consultancy in Spain. Let’s call the Spanish consultancy “B”. “B” then contracts me to a multinational company as a contractor."
        },
        {
            "tag": "p",
            "html": "Everybody was happy with this arrangement until “B” decided to sell the existing contract with the multinational company to “C” along with all the people working in it through “B”."
        },
        {
            "tag": "p",
            "html": "What’s wrong? Things quickly get complicated as the Indian company does not have any existing partnership with Spanish consultancy “C” which currently holds all the rights to contract me to that particular multinational company."
        },
        {
            "tag": "p",
            "html": "All the employees who came through the Indian company were thrown out one fine morning on the 9th of May 2018. We could no longer work for the multinational company."
        },
        {
            "tag": "p",
            "html": "We honestly thought we were fired! Until then, I knew no one from company “C” and thought that the Indian company or the consultancy “B” would come to the rescue."
        },
        {
            "tag": "p",
            "html": "No one turned out to care about what had happened and the only person who came to the rescue was consultancy “C”. We were supposed to work remotely inside the consultancy “C” for the multinational company for a few months until our “situation” was sorted."
        },
        {
            "tag": "p",
            "html": "My wife was quick to find an opportunity in this dilemma. She requested me to ask consultancy “C” if they would hire me directly."
        },
        {
            "tag": "p",
            "html": "As luck would have it, it did not come to that before I could ask them. Consultancy “C” offered that exact scenario as an option to resolve this current “situation”."
        },
        {
            "tag": "p",
            "html": "I was swift in letting them know my intention of joining the consultancy “C” directly. That would mean that I would be terminating my supposedly unbreakable contract with the Indian company."
        },
        {
            "tag": "p",
            "html": "I didn’t give it much thought. The sum payable as per the contract was a staggering $50,000 which by no means is a small amount. I still signed a contract with the consultancy “C”. Luckily, the contract would no longer be valid until the immigration approves the contract."
        },
        {
            "tag": "p",
            "html": "It was the first week of June 2018. The immigration authorities in Spain are notorious for their vacation during the summer. I was certain that it would take at least one month for the immigration to approve the contract."
        },
        {
            "tag": "p",
            "html": "Until then, I would be paid by the Indian company and the consultancy “B” through consultancy “C”."
        },
        {
            "tag": "p",
            "html": "Everything was planned and everyone is happy, right? Nop. Apparently, the Indian company grew desperate and wanted me to renew the existing contract with them."
        },
        {
            "tag": "p",
            "html": "Honestly how do you expect me to renew the contract with the Indian company which no longer has the right to contract me for that particular multinational company?"
        },
        {
            "tag": "p",
            "html": "It is to be noted that the Indian company in question does not have any other contract with other companies in Spain. The total strength of the Indian consultancy is a grand total of 11 people."
        },
        {
            "tag": "p",
            "html": "Wow! I informed the Indian company of my intentions to terminate the contract by the end of the contract period!"
        },
        {
            "tag": "p",
            "html": "A series of unfortunate events unfolded:"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">I was forced to find a new home with a notice period of 3 days in a country whose language I barely speak, as the accommodation I stayed was from the consultancy “B”.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Social Security payments from the consultancy “B” has stopped.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">The salary payment from the Indian company for the last month in question (June 2018) was never received.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">4</div><div class=\"copy-container\"><p class=\"description mb-3\">Experience letter along with the past three months payslips was never received.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">5</div><div class=\"copy-container\"><p class=\"description mb-3\">I was blackmailed by the Indian company to sign the contract which I never did.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">6</div><div class=\"copy-container\"><p class=\"description mb-3\">I was forced to shift my house while not being paid.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">7</div><div class=\"copy-container\"><p class=\"description mb-3\">Seeing all the commotion, the multinational company stopped allowing us to work remotely and wanted us to join them after receiving a valid approval from immigration.</p></div>"
        },
        {
            "tag": "p",
            "html": "Jobless, homeless, unprotected by social security while being unpaid for a month in a country whose language I barely speak was an unbelievable experience. I used up half of my emergency fund."
        },
        {
            "tag": "p",
            "html": "Fortunately, my wife had found a job five months prior. So she had a steady stream of income in our family. Our visas are due to expire shortly."
        },
        {
            "tag": "p",
            "html": "What do you think would have unfolded if for some reason, my wife chose not to work and I had no emergency fund?"
        },
        {
            "tag": "p",
            "html": "I would have signed another unbreakable contract with the Indian consultancy and would have let them suck me dry."
        },
        {
            "tag": "p",
            "html": "The consultancy “C” offered us 3 times more than what the Indian consultancy and the consultancy “B” had offered previously."
        },
        {
            "tag": "p",
            "html": "Such an opportunity was rare due to the visa & language constraints which I had. I would have easily let the opportunity to pass if I had no emergency fund."
        },
        {
            "tag": "p",
            "html": "The risk would have been too much. The reward would have to proportionately outweigh the risk. That was made possible by increasing the streams of income in our family and having saved a comfortable emergency fund as a cushion to absorb the negative impacts of risk."
        },
        {
            "tag": "p",
            "html": "I could comfortably say that <b>emergency funds allow you the space to choose what you would truly want, rather than be constrained by your circumstances</b>."
        },
        {
            "tag": "p",
            "html": "I truly experienced the freedom of choice due to our opting to choose saving for emergencies. I believe you can experience the same when you have a comfortable cushion for yourself."
        }
    ]
}