{
    "url": "/personal-finance/buying-a-car-the-right-way/",
    "title": "Buying a Car the Right Way",
    "image": "/img/personal-finance/buying-a-car-the-right-way.jpg",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "p",
            "html": "Every plan, savings or budget is personalized and cannot be implemented by your neighbor. It won’t be the right fit for them. So is your car."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Which car should you buy? A Ferrari? A Toyota? or a Mini Cooper?</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Do you want it new or don’t mind if it is a few years old?</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Is a 2 seater enough for you? How about a 5 seater?</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">4</div><div class=\"copy-container\"><p class=\"description mb-3\">Do you want to buy a petrol or a diesel engine?</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">5</div><div class=\"copy-container\"><p class=\"description mb-3\">Do you usually travel long distances? Is it for driving within the city limits?</p></div>"
        },
        {
            "tag": "p",
            "html": "You can personalize it even further by wanting a sunroof/convertible."
        },
        {
            "tag": "p",
            "html": "The concept of buying a car the right way depends on one’s financial situation. Ask yourself before buying a car."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Do I already have an emergency fund in place?</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Are you going to pay all cash for the car?</p></div>"
        },
        {
            "tag": "p",
            "html": "Both the answers to the above questions should be a yes before choosing to buy a car."
        },
        {
            "tag": "h3",
            "html": "Why shouldn't you Pay for the Car with a Loan?"
        },
        {
            "tag": "p",
            "html": "The minute you take the car out of the showroom the price of the car goes down by a minimum of 30% to 50%."
        },
        {
            "tag": "p",
            "html": "If you have a loan you should be paying an interest on the loan. How much is it that you are paying? And how long are you going to pay?"
        },
        {
            "tag": "p",
            "html": "For the convenience of traveling in your car is it worth paying $200 / $300 every month excluding fuel and parking charges?"
        },
        {
            "tag": "p",
            "html": "Would you rather be a little less comfortable traveling on a public transport and saving $150 to $250 till you have saved enough to buy a car?"
        },
        {
            "tag": "p",
            "html": "<b>Chances are that if you start the practice of saving the money to buy a car you will end up buying a second-hand car.</b>"
        },
        {
            "tag": "p",
            "html": "And you will feel just as happy as buying a new car."
        },
        {
            "tag": "p",
            "html": "Choose to be financially free especially when it comes to paying for depreciating assets."
        },
        {
            "tag": "p",
            "html": "<b>The general rule of thumb is to save one year’s worth of income for buying a car.</b>"
        },
        {
            "tag": "p",
            "html": "Is that not enough? Maybe you could choose a cheaper model and settle for a second hand or better yet, increase your income!"
        },
        {
            "tag": "h3",
            "html": "Comfor And Prestige"
        },
        {
            "tag": "p",
            "html": "We choose to buy a car because we want to be comfortable, not getting constrained by the time limits of public transport and generally wanting to save time."
        },
        {
            "tag": "p",
            "html": "We will end up saving about one to a maximum of two hours every day by traveling in a car."
        },
        {
            "tag": "p",
            "html": "<b>What Will You Use These Hours For?</b>"
        },
        {
            "tag": "p",
            "html": "Would you rather spend the time watching TV, Browsing / Cooking your tomorrow’s lunch?"
        },
        {
            "tag": "p",
            "html": "An average man watches TV / uses a mobile phone for over 4 hours a day."
        },
        {
            "tag": "p",
            "html": "But browsing is pleasurable for us and for most of them waiting in traffic in a car is not."
        },
        {
            "tag": "p",
            "html": "Would you trade $250 every month for getting enough time to browse / cook / whatever you want to do?"
        },
        {
            "tag": "p",
            "html": "That’s exactly what you are doing when you buy a car which you can’t afford instead of traveling in a public transport for a few years."
        },
        {
            "tag": "p",
            "html": "But I am getting a car am I not?"
        },
        {
            "tag": "p",
            "html": "Yes. But is the car worth the money which you are paying for? It is depreciating every day, every time you use and every extra mile it moves."
        },
        {
            "tag": "p",
            "html": "You are better off with a second-hand car with less mileage. It would do the same job and you would end up not spending 50% more for the same car just because it was not used before."
        },
        {
            "tag": "p",
            "html": "People also buy a car for the prestige of owning it."
        },
        {
            "tag": "p",
            "html": "We all would like to be treated well and the people who judge you often judge you by the appearances and it includes the car you drive."
        },
        {
            "tag": "p",
            "html": "What is the car that fits your standard and appeases your pride?"
        },
        {
            "tag": "p",
            "html": "If you are from a middle class or having a rich background owning a car is a basic requirement and is often taken for granted."
        },
        {
            "tag": "p",
            "html": "Do you earn as much and save as much?"
        },
        {
            "tag": "p",
            "html": "The truth is if your financial situation is bad, as in case, you go into debt for buying a depreciating asset and cannot repay it within the next 5 years, you don’t deserve to buy a car as long as it is not absolutely impossible to commute without it."
        }
    ]
}