{
    "url": "/personal-finance/debt-management-strategy/",
    "title": "Debt Management Strategy",
    "subcategoryPresent": false,
    "breadcrumb": [
        {
            "crumbTitle": "Blog",
            "crumbUrl": "/"
        },
        {
            "crumbTitle": "Personal Finance",
            "crumbUrl": "/personal-finance/"
        }
    ],
    "content": [
        {
            "tag": "img",
            "classInfo": "article-header-image",
            "srcUrl": "/img/personal-finance/debt-management-strategy.jpg"
        },
        {
            "tag": "p",
            "html": "Debt management requires your utmost commitment to get rid of debt. The first step in making sure that you start reducing your debt is an emergency fund."
        },
        {
            "tag": "p",
            "html": "You need to accumulate six months of your income as an emergency fund before venturing into debt repayments. You do not know what is going to happen the next month."
        },
        {
            "tag": "p",
            "html": "Make sure that you are covered for your emergencies. After you have 6 months of your emergency fund accumulated, cut your credit card. You do not need them."
        },
        {
            "tag": "p",
            "html": "All the excuses for having a credit card is to cover for emergencies. Stop accumulating more debts."
        },
        {
            "tag": "p",
            "html": "Saving 30% of your salary as emergency fund will take you 18 months to accumulate the 6 months income as an emergency fund. So, start saving soon."
        },
        {
            "tag": "p",
            "html": "Find 30% of your income. Start earning more money by opening up multiple streams of income. Just find them! Always pay your default debt payments."
        },
        {
            "tag": "p",
            "html": "I realize that you are in debt because of the lack of money. If you want to break this cycle, you need to find more money / save more money by cutting down your expenses. That’s the only way out."
        },
        {
            "tag": "p",
            "html": "Start taking control of your finances. Anyone in debt is either earning too little or spending too much. Which category are you in?"
        },
        {
            "tag": "p",
            "html": "Spend only the bare minimum towards food, travel, school fees, insurance, debt repayments, house rent and save the rest."
        },
        {
            "tag": "p",
            "html": "If you cannot afford to have kids, don’t have them till you increase your income."
        },
        {
            "tag": "p",
            "html": "If you are like me, saving 6 months of your income as emergency fund will give you a sense of security. A deep satisfaction for starters."
        },
        {
            "tag": "p",
            "html": "Use that to repay all your debts. Start by segregating all the debts in terms of how long it takes for you to repay."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Short Term Debt is any debt which is paid within the next 5 years.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">2</div><div class=\"copy-container\"><p class=\"description mb-3\">Mid Term Debt is repaid within 5 - 15 years from today.</p></div>"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">3</div><div class=\"copy-container\"><p class=\"description mb-3\">Long term Debt is any debt which takes more than 15 years to repay.</p></div>"
        },
        {
            "tag": "p",
            "html": "Now, where does your 30% of savings go after accumulating 6 months of your income as an emergency fund?"
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Pay your short term debt first. They are the debts for which you pay maximum interest rates. Finish it off ASAP.</p></div>"
        },
        {
            "tag": "p",
            "html": "Now, after finishing off your short term debts, you must have liberated more cash. I.e. Your cash which you were repaying your short term debt + 30% of your income."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Use this cash flow to repay your mid term debts. Finish them off.</p></div>"
        },
        {
            "tag": "p",
            "html": "Now, after finishing off your mid term debts, you must have a better cash flow than ever before. Your short term debts payments which you were repaying + your mid term debt payments which you were paying + 30% of your income."
        },
        {
            "tag": "div",
            "classInfo": "item-container",
            "html": "<div class=\"icon\">1</div><div class=\"copy-container\"><p class=\"description mb-3\">Use this cash flow to repay all of your long term debts except your home mortgage.</p></div>"
        },
        {
            "tag": "p",
            "html": "Make sure that you call your bank every single time you are repaying extra to ensure that the extra cash goes into the principal repayment."
        },
        {
            "tag": "p",
            "html": "Banks have the bad habit of not doing that. It is better to always ensure this and if you hold a debt and want to reduce the interest charged, some countries have the option to transfer all the debt to another company which offers to provide lesser interest rates."
        },
        {
            "tag": "p",
            "html": "If your country has that option, make sure that you make the most use of this option. Call your credit card company to ensure that they reduce your interests on the debt or you want to move all your debts to another company which has a reduced interest rate for your credit card loan."
        },
        {
            "tag": "p",
            "html": "All the developed nations have the option to transfer all your credit card balance to another credit card company at 0% interest rates. Make sure, you do not stack more debts as they will be charged at standard rate rather than 0%."
        },
        {
            "tag": "p",
            "html": "This option of credit card balance transfer is available in India as well. There is a restraint though. You need to stay in one credit card company for at least a year before you can transfer your credit card debts and the credit card balance transfer is particularly beneficial if you find a bank which is willing to take the credit balance at 0%."
        },
        {
            "tag": "p",
            "html": "So, after repaying all of your debts. Make sure that you invest your new cash flow into your investment strategy. This strategy could take you anywhere between 6 months to about 10 years to repay all of your debts."
        },
        {
            "tag": "p",
            "html": "The repayment period highly depends on how deep are you in debt."
        },
        {
            "tag": "p",
            "html": "For example, if you only have credit card debts, you could easily repay them by first transfering all your debt to a 0% interest account and repaying the credit balance ASAP."
        }
    ]
}